{
    "elements": [
        {
            "from": "https://cyberleninka.ru/article/n/tehnologii-virtualnoy-i-dopolnennoy-realnosti-vozmozhnosti-i-prepyatstviya-primeneniya",
            "ref": [
                "1.\tАНО «Оргкомитет «Сочи-2014» // NextSpace.URL: https://next.space / portfolio / sochi-2014 /.",
                "2.\tБлог команды Revizto. Опыт пользователей ( [б.г]) // Revizto. URL: https://revizto.com/ru/blog /cases.",
                "3.\tИнтерактивный музей для детей «Моя будущая профессия» ( [б.г]) // ARProduction. URL: http://arproduction.ru / cases /museum /.",
                "4.\tЛьвов М. (2016) Виртуальная реальность становится реальной // Mediavision.",
                "URL: http://mediavision-mag.ru /uploads / 08-2016/48_49_Mediavision_08_2016.pdf.",
                "5.\tМировой рынок AR/VR в 2018 году вырастет до 18 млрд долл. (2017) // Computerworld Россия. № 19. URL: https://www.osp.ru/ cw/2017 /19 /13053468 /.",
                "6.\tРаспоряжение Правительства РФ от 28.07.2017",
                "№ 1632-р «Об утверждении программы «Цифровая экономика Российской Федерации»» // Консультант-Плюс. URL: http://www.consultant.ru / document / cons_ doc_LAW_221756/.",
                "7.\tРынок виртуальной реальности в России ([2017]) // Институт современных медиа (MOMRI). URL: http://momri.org /wp-content /uploads /2017/04/MOMRI.-VR-market-in-Russia.-April-2017-rus.pdf.",
                "8.\tТрачук А. В., Линдер Н. В. (2016) Адаптация российских фирм к изменениям внешней среды: роль инструментов электронного бизнеса // Управленческие науки. №1. С. 61-73.",
                "9.\tТрачук А. В., Линдер Н. В. (2017а) Инновации и производительность российских промышленных компаний // Инновации. № 4 (222). С. 53-65.",
                "10.\tТрачук А. В., Линдер Н. В. (2017б) Инновации и производительность: эмпирическое исследование факторов, препятствующих росту методом продольного анализа // Управленческие науки. Т. 7, № 3. С. 43-58.",
                "11.\tТрачук А. В., Линдер Н. В. (2017в) Перспективы применения мобильных платежных сервисов в России: теоретический подход к пониманию факторов распространения // Вестник факультета управления СПбГЭУ № 1-1. С. 322-328.",
                "12.\tТрачук А. В., Линдер Н. В. (2017г) Распространение инструментов электронного бизнеса в России: результаты эмпирического исследования // Российский журнал менеджмента. Т. 15, № 1. С. 27-50.",
                "13.\tУказ Президента РФ от 09.05.2017 № 203 «О Стратегии развития информационного общества в Российской Федерации на 2017-2030 годы» // КонсультантПлюс. URL:http://www.consultant.ru / document / cons_doc_ LAW_216363/.",
                "14.\tУказ Президента РФ от 07.05.2018 № 204 «О национальных целях и стратегических задачах развития Российской Федерации на период до 2024 года» // КонсультантПлюс. URL: http://www.consultant.ru / document / cons_doc_ LAW_297432 / .",
                "15.\tЦифровое десятилетие. В ногу со временем (2017) // PWC. URL: https://www.pwc.ru/ru/publications /global-digital-iq-survey-rus.pdf.",
                "16.\tAfter mixed year, mobile AR to drive $ 108 billion VR/ AR market by 2021 (2017) // Digi-capital. URL: https:// www.digi-capital.com / news / 2017 / 01 / after-mixed-year-mobile-ar-to-drive-108-billion-vrar-market-by-2021 / .",
                "17.\t2018 Augmented and Virtual Reality Survey Report (2018) // Perkins Coie and Upload. URL: https:// www.perkinscoie.com /images / content /1/ 8 /v2 /187785 / 2018-VR-AR-Survey-Digital.pdf.",
                "18.\tAugmented Reality and Virtual Reality Market by Offering (Hardware & Software), Device Type (HMD, HUD, Handheld Device, Gesture Tracking), Application (Enterprise, Consumer, Commercial, Healthcare, Automotive), and Geography - Global Forecast to 2023 (2018) // Markets and Markets. URL: https://www.marketsandmarkets.com / Market-",
                "Reports / augmented-reality-virtual-reality-market-1185. html.",
                "19.\tAzuma R. T. (1997) A Survey of Augmented Reality // Presence: Teleoperators and Virtual Environments. Vol. 6, № 4. P. 355-385.",
                "20.\tCaudell T. P., Mizell D. W. (1992) Augmented reality: an application of heads-up display technology to manual manufacturing processes // Proceedings of the Twenty-Fifth Hawaii International Conference on System Sciences. 7-10 Jan. 1992. URL: https:// ieeexplore.ieee.org / document /183317 / .",
                "21.\t5 Conclusions From John Riccitiello VRLA 2017 Keynote on VR (2017) // AppReal. URL: https:// appreal-vr.com / blog / 5-conclusions-from-john-riccitiello-vrla-2017-keynote-on-vr /.",
                "22.\tFuture Reality: Virtual, Augmented & Mixed Reality (VR, AR & MR) Primer (2016) // Bank of America Merryll Lynch. URL: https://www.bofaml.com / content / dam /boa mlimages / documents / articles / ID16_1099 / virtual_reality_ primer_short.pdf.",
                "23.\tHeiligM. L. (1992) El Cine delFuturo: The Cinema of the Future // Presence: Teleoperators and Virtual Environments. Vol. 1, № 3. P. 279-294.",
                "24.\tKaiser R., Schatsky D. (2017) For more companies, new ways of seeing. Momentum is building for augmented and virtual reality in the enterprise // Deloitte University Press. URL:https://www2.deloitte.com / content / dam / insights /u s / articles /3768_Signals-for-Strategists_Apr2017 /DUP_ Signals-for-Strategists_Apr-2017.pdf.",
                "25.\tKruegerM. W. (1983) Artificial Reality. NewYork: Addison-Wesley.",
                "26.\tKunkel N., Soechtig S., Miniman J. et al. (2016) Tech Trends 2016: Augmented and virtual reality go to work. [S.l.]; Deloitte University Press // Deloitte University Press. URL: https://www2.deloitte.com / content",
                "/ dam / Deloitte / global / Documents / Technology / gx-tech-trends-2016-innovating-digital-era.pdf.",
                "27.\tLaValle S. M. (2017) Virtual Reality /University of Illinois. [S.l.:] Cambridge University Press. 418 p. URL: http://vr.cs.uiuc.edu / vrbook.pdf.",
                "28.\tMilgram P., Kishino F. (1994) A taxonomy of mixed reality visual displays // IEICE Transactions on Information and Systems. Vol E77-D, № 12. P. 13211329.",
                "29.\tOPS Solutions to Display the Power of Enterprise AR at HANNOVER MESSE 2018 (2018) // Light Guide Systems. URL: http://lightguidesys.com / blog / ops-solutions-display-power-enterprise-ar-hannover-messe-2018 /.",
                "30.\tPanetta K. (2017) Top Trends in the Gartner Hype Cycle for Emerging Technologies // Gartner. URL: https:// www.gartner.com / smarterwithgartner /top-trends-in-the-gartner-hype-cycle-for-emerging-technologies-2017 /.",
                "31.\tProfiles in Innovation: Virtual & augmented reality. Understanding the race for the next computing platform (2016) // Goldman Sachs. URL: http://www. goldmansachs.com / our-thinking / pages / technology-driving-innovation-",
                "folder /virtual-and-augmented-reality /report.pdf.",
                "32.\tSutherland I. E. (1965) The Ultimate Display // Proceedings of IFIP 65. Vol. 2. URL: http://worrydream.com/refs /Sutherland%20-%20The%20 Ultimate%20Display.pdf.",
                "33.\tTrachuk A., Linder N. (2017) The adoption of mobile payment services by consumers: an empirical analysis results // Business and Economic Horizons. 2017. Vol. 13, № 3. P. 383-408.",
                "34.\tVince J. (1995) Virtual reality systems. New York: ACM Press; Addison-Wesley Publishing Co. 388 p."
            ],
            "text": " ﻿УДК 338.24.01 А. В. ИВАНОВА Главный специалист-эксперт отдела бюджетной политики в сфере юстиции, предупреждения и ликвидации последствий чрезвычайных ситуаций Департамента бюджетной политики в сфере государственной военной и правоохранительной службы и государственного заказа Министерства финансов Российской Федерации. Область научных интересов: новые технологии, распространение инноваций, технологическое предпринимательство, современные бизнес-модели. E-mail: knoorook@gmail.com ТЕХНОЛОГИИ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ: ВОЗМОЖНОСТИ И ПРЕПЯТСТВИЯ ПРИМЕНЕНИЯ АННОТАЦИЯ 1 1ервые попытки создания интерактивных устройств, позволяющих взаимодействовать с имитируемой реальностью или дополняющих реальность накладываемой информацией, предпринимались еще в начале XX века, сама концепция смешанной реальности («континуум реальности-виртуальности), элементами которой являются AR и 'УК в современном представлении, является достаточно молодой (24 года), равно как и рынок самих технологий виртуальной и дополненной реальности. И хотя понятия и концепции виртуальной и дополненной реальности не претерпели радикальных изменений за последние 30 лет, но технологии виртуальной и дополненной реальности прошли значительный эволюционный путь как в плане совершенствования устройств и программного обеспечения, так и контента и уже пережили несколько скачков роста. Их применение не ограничится лишь сферой развлечений и игр. Многие эксперты считают, что технологии виртуальной и дополненной реальности наряду с BigData, облачными технологиями, искусственным интеллектом и некоторыми другими станут ключевыми технологиями четверной промышленной революции. Технологии дополненной и виртуальной реальности могут лечь в основу новой вычислительной платформы. Уже сегодня проекты на их основе помогают не только создавать концептуально новые рынки, но и менять существующие. В данной статье рассмотрено развитие понятий виртуальной и дополненной реальности, присущих им видов технологий, а также современные тренды рынка технологий виртуальной и дополненной реальности. В ходе опроса выявлены препятствия для массового распространения технологий дополненной и виртуальной реальности: высокая стоимость внедрения и последующей эксплуатации решений; недостаток специализированного контента и несовершенство устройств; неочевидная польза от использования дополненной и виртуальной реальности. На основе эмпирического исследования сформирован достаточно широкий спектр выгод от использования технологий виртуальной и дополненной реальности: ускорение и удешевление процессов обучения, тренировок и инструктажа, а также увеличение их эффективности, сокращение затрат на элементы и расходные материалы, необходимые в обучении, и на обучающий персонал; предотвращение угрозы для здоровья и жизни сотрудников и других людей в процессе специального обучения и тренировок (медицинские операции и инвазивные процедуры, эвакуация, обеспечение безопасности, спасение в различных чрезвычайных ситуациях) и связанная с этим оптимизация расходов на выплаты компенсаций; сокращение количества ошибок и ускорение процесса при сборке, ремонте и эксплуатации специального оборудования, поиске информации, необходимых деталей, расположения товаров на складе; значительное снижение аварийности, а также стоимости эксплуатации единиц техники за счет своевременного выявления неисправностей; ускорение процесса проектирования и прототипирования объектов, значительное снижение затрат и времени на физическое моделирование; улучшение клиентского опыта, дизайна продуктов и торговых площадок и соответствующее увеличение объемов продаж; совершенствование (упрощение) и повышение результативности коммуникаций. КЛЮЧЕВЫЕ СЛОВА НОВЫЕ ТЕХНОЛОГИИ, ТЕХНОЛОГИИ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ, ЦИФРОВАЯ ФАБРИКА, ИНДУСТРИЯ 4.0, ЧЕТВЕРТАЯ ПРОМЫШЛЕННАЯ РЕВОЛЮЦИЯ, ИННОВАЦИИ. Рис. 1. Модель гибридной реальности [Milgram P., ^Ыио F., 1994] ВВЕДЕНИЕ В последнее время часто ведутся дискуссии о дополненной и виртуальной реальности. Обе технологии освещаются в СМИ, становятся объектами исследований, о них пишут книги и снимают фильмы. На бурное развитие технологий дополненной и виртуальной реальности значительное влияние оказал рынок мобильных устройств, который за последние 10 лет изменился до неузнаваемости: на смену кнопочным аппаратам пришли сенсорные смартфоны и планшеты с полноценной операционной системой, оснащенные мощной видеокамерой, датчиками позиционирования и гироскопами [Трачук А. В., Линдер Н. В., 2017в]. Нарастающая вычислительная мощность устройств и повсеместная цифровая трансформация возвели технологии дополненной и виртуальной реальности на принципиально новый уровень, где они могут выйти за пределы индустрии развлечений и охватить широкий спектр новых сфер деятельности человека. На сегодняшний день технологии виртуальной и дополненной реальности стали источником технологических возможностей и способствуют не только созданию концептуально новых рынков, но и расширению уже имеющихся [Трачук А. В., Линдер Н. В., 2017г]. Помимо сферы развлечений, технологии дополненной и виртуальной реальности сегодня широко используются для проектирования, обучения и переподготовки специалистов в программных продуктах для инженеров, архитекторов, дизайнеров, риелторов и ритейлеров. Технологии дополненной и виртуальной реальности используются в образовании и медицине, на их базе разрабатываются обучающие программы и тренажеры, медицинские аппараты моделируют и проводят операции. В связи с изложенным выше актуален вопрос о влиянии, которое могут оказать технологии дополненной и виртуальной реальности на бизнес. ПОНЯТИЕ И КОНЦЕПЦИИ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ Модель смешанной (гибридной) реальности, или континуума реальности-виртуальности (рис. 1), впервые описана в 1994 году [М^гаш Р., К^Ыпо Р., 1994]. Смешанная реальность определена как система, в которой объекты реального и виртуального миров сосуществуют и взаимодействуют в реальном времени, в рамках виртуального континуума. Промежуточными звеньями в этой модели являются дополненная реальность и дополненная виртуальность. Дополненная реальность ближе к реальному миру, а дополненная виртуальность - ближе к виртуальному. Авторы модели выделили ее основные элементы: • Полная реальность - привычный мир, который нас окружает; • Виртуальная реальность - цифровой мир, полностью созданный с помощью современных компьютерных технологий; • Дополненная реальность - реальный мир, который «дополняется» виртуальными элементами и сенсорными данными; • Дополненная виртуальность - виртуальный мир, который «дополняется» физическими элементами реального мира. В настоящем исследовании рассматриваются, прежде всего, дополненная реальность и виртуальная реальность. Принципиальное различие между ними состоит в том, что виртуальная реальность конструирует полностью цифровой мир, полностью ограничивая доступ пользователя к реальному миру, а дополненная реальность лишь добавляет элементы цифрового мира в реальный, видоизменяя пространство вокруг пользователя. В виртуальной реальности среда создается посредством комплексного воздействия на его восприятие с использованием шлемов виртуальной реальности или иных технических средств, которые динамически обновляют видимое пользователем пространство. В человеческом мозге нейроны реагируют на виртуальные элементы так же, как и на элементы реального мира. Поэтому человек воспринимает виртуальную среду и реагирует на происходящие внутри виртуального мира события точно так же, как на имеющие место в реальности [ЬаУаПе 8. М., 2017]. Термин «виртуальная реальность» получил распространение в середине 1980-х годов, употребил и популяризировал его Джарон Ланье, американский ученый в области визуализации данных и биометрических технологий, пионер в области технологий виртуальной реальности и их коммерческого продвижения. Собственно технологии появились во второй половине XX века. Однако некоторые эксперты считают, что отдельные элементы виртуальной реальности описаны учеными и философами задолго до этого. С нашей точки зрения, первым шагом к созданию технологий виртуальной реальности можно считать попытки препятствия применения создания устройства, искусственно воссоздающего условия реального мира и при этом оказывающего комплексное воздействие на восприятие человека. В 1929 году был запатентован рычажный тренажер полетов «Линк Трэйнер». В качестве визуального образа использовалась движущаяся картинка, навигационные рычаги передавали движение, вращение, падение, изменение курса. Таким образом создавалось удовлетворительное ощущение движения. Способность подарить пользователю наиболее реалистичные ощущения, погрузить его в искусственно созданный мир ощущений возможно только при комплексном воздействии на человеческое восприятие. Эти эффекты рассматривались как необходимые для развития киноиндустрии в 1950-х годах [Heilig M. L., 1992]. Для того чтобы охватить взглядом традиционные экраны кинотеатров, человеку достаточно 5% поля зрения. В целом же восприятие человека на 70% (еще 20% - слух, 5% - обоняние, 4% - осязание и 1% - вкус) зависит именно от визуальной составляющей. Для создания эффекта полного визуального погружения необходимо задействовать все 100% поля зрения и при этом сохранить четкость изображения. Соответственно, для создания абсолютной иммерсивности такой же эффект должен быть достигнут и в отношении других составляющих восприятия. В 1957 году на базе Анненбергской школы Университета штата Пенсильвания Мортон Хейлиг создал первый в мире виртуальный симулятор «Сенсорама», который внешне напоминал игровой автомат с ограждающим куполом и представлял собой своеобразный 4Б-кинотеатр для одного пользователя. Патент на устройство был получен в 1962 году. Пользователь мог совершить виртуальную поездку на мотоцикле по улицам Бруклина. Эффект присутствия достигался путем воздействия на все основные органы чувств одновременно: экран демонстрировал запись «от первого лица», снятую одновременно тремя кинокамерами, сиденье вибрировало, вентиляторы создавали ощущение встречного ветра, стереодинамики транслировали звуки оживленной улицы, в камеру поступали соответствующие запахи. В 1967 году Айван Сазерленд создал «Дамоклов меч» -первый шлем виртуальной реальности. К потолку крепился головной дисплей, транслирующий образы, генерируемые на компьютере. Кроме того, шлем позволял изменять генерируемые образы в соответствии с движениями головы. Изобретатель отмечал, что устройства виртуальной реальности - «это зеркало в математическую страну чудес» [Sutherland I. E., 1965]. «Идеальный» дисплей (носимое устройство), подключенный к компьютеру, дает шанс познакомиться с идеями, которые не реализованы в физическом мире. Пределом развития данной технологии станет устройство, с помощью которого компьютер сможет управлять существованием материи. Изобретения Хейлига и Сазерленда не имели коммерческого успеха, но послужили основой последующих разработок. Их идеи вдохновили Эндрю Липпмана, который вместе с коллегами в MIT со своей командой в 1978 году создал первую интерактивную карту Аспена (штат Колорадо). Благодаря ей можно было совершить виртуальный тур по городу на автомобиле. В 1972 году Мирон Крюгер ввел термин «искусственная реальность» с целью определить результаты, которые могут быть получены при помощи системы наложения видеоизображения объекта (человека) на генерируемую компьютером картинку и при помощи других разработанных к тому времени средств [Krueger M. W., 1983]. В 1980-х годах технологии виртуальной реальности были использованы в ряде проектов NASA, например для создания шлема виртуальной реальности. Компания VPL Research создала очки виртуальной реальности EyePhone и сенсорный костюм DataSuit, способные анализировать движения головы и тела и транслировать их в рамках контролируемой компьютерной симуляции. В 1990-х технологии виртуальной реальности нашли применение в игровой индустрии. В 1993 году компания Sega разработала консоль Genesis - игровую платформу с использованием технологий виртуальной реальности. К сожалению, несовершенство графической и аппаратной составляющих привело к тому, что у пользователей возникали тошнота и головокружение как побочные эффекты. Из-за этого консоли так и не поступили в продажу. Их высокая себестоимость привела к тому, что от технологий виртуальной реальности временно отказались. Первые попытки реализовать дополненную реальность относятся к началу XX века. Еще во времена Первой мировой войны в авиации начали использовать коллиматорные прицелы - оптические устройства, комбинирующие естественное изображение цели с наложенным изображением прицельной марки, спроецированной в бесконечность. Термин «дополненная реальность» впервые предложил Том Коделл в 1992 году, описывая цифровые дисплеи, которые использовались при постройке самолетов. Сборщики носили с собой портативные компьютеры, могли видеть чертежи и инструкции с помощью шлемов, имеющих полупрозрачные дисплейные панели [Caudell T. P., MizellD.W., 1992]. В 1992 году Льюис Розенберг разработал одну из первых функционирующих систем дополненной реальности для ВВС США. Экзоскелет Розенберга позволял военным виртуально управлять машинами, находясь в удаленном центре управления. В 1994 году Жюли Мартин поставила спектакль «Танцы в киберпространстве», где акробатов и танцоров погружали в виртуальную среду посредством проекцирования на сцену виртуальных объектов. В целом, в 1990-х и 2000-х годах разработки в сфере дополненной реальности часто были связаны с созданием авианавигации. Например, ставилась задача автоматически определять направление движения в зависимости от выбранной летчиком цели, одновременно индикаторы показывали соответствующую информацию на фоне наблюдаемой им внешней обстановки. Иными словами, в реальном времени те реальные объекты, которые наблюдал пилот, сопровождала дополнительная информация. В 1997 году Рональд Азума сформулировал основные критерии дополненной реальности: совмещение реального и виртуального миров, взаимодействие в реальном времени, отображение в 3D-пространстве. Азума считал, что неправильно ограничивать понятие AR какими-то определенными технологиями (устройствами), например очками. Помимо добавления каких-либо элементов виртуального в реальное, в рамках дополненной реальности также возможно удаление элементов реального [Azuma R.T., 1997]. В начале 2000-х годов разработчики технологий дополненной и виртуальной реальности вновь обратились к индустрии развлечений. В 2000 году благодаря технологиям дополненной реальности в игре Quake появилась возможность преследовать чудовищ по настоящим улицам. Правда, для этого нужен был виртуальный шлем с датчиками и камерами, что не способствовало популярности игры, но стало предпосылкой для появления известной ныне PokemonGo. В 2010-х технологии дополненной и виртуальной реальности сделали еще один шаг в сторону потребительской аудитории. 1 августа 2012 года малоизвестный стартап Oculus запустил кампанию по сбору средств на выпуск шлема виртуальной реальности на платформе Kickstarter. Разработчики обещали пользователям «эффект полного погружения» за счет применения дисплеев с разрешением 640 на 800 пикселей для каждого глаза. В 2014 году компания Google начала тестирование GoogleGlass - мини-компьютера, встроенного в оправу очков. В 2016 году компания Microsoft представила HoloLens - умные очки для работы с дополненной реальностью. Эти события содействовали активному продолжению работ в области технологий дополненной и виртуальной реальности. Таким образом, проанализировав историю развития их технологий, можно отметить, что у них есть много общего: • в основе технологий лежат схожие алгоритмы; • интерактивное взаимодействие с пользователем в режиме реального времени; • отображение в ЗБ-пространстве передается посредством технических средств. Дополненная реальность совмещает реальный и виртуальный миры, дополняет реальный мир и расширяет его восприятие. Виртуальная реальность, естественно, полностью виртуальна, заменяет реальный мир, стремится к абсолютной иммерсивности (достижению эффекта полного погружения). Хотя понятия и концепции виртуальной и дополненной реальности не претерпели радикальных изменений за последние З0 лет, этого нельзя сказать о самих технологиях. Технологии дополненной и виртуальной реальности прошли значительный эволюционный путь как в плане совершенствования устройств и ПО, так и контента. Далее приведены варианты устройств виртуальной и дополненной реальности, представленные на рынке в настоящий момент. Устройства виртуальной реальности. Шлемы и очки (Head Mounted Display, HMD). В шлеме перед глазами пользователя расположены два дисплея, шоры защищают от попадания внешнего света, предусмотрены стереонаушники, встроенные акселерометры и датчики положения. На дисплеях транслируются немного смещенные друг относительно друга стереоскопические изображения, обеспечивая реалистичное восприятие трехмерной среды. В большинстве своем продвинутые шлемы виртуальной реальности довольно громоздкие, но в последнее время появляются упрощенные легкие варианты (в том числе картонные), которые обычно предназначены для смартфонов с приложениями виртуальной реальности. Шлемы для виртуальной реальности делятся на три типа: • настольные шлемы подключаются к компьютеру (HTCVive, OculusRift) или консолям (Playstation VR), требуют высокой мощности аппаратных средств; • дешевые мобильные гарнитуры работают в связке со смартфонами, менее требовательные и громоздкие, чем компьютерные, представляют собой держатель для смартфона с линзами (Samsung Gear VR, Google Cardboard, YesVR); • автономные очки виртуальной реальности - самостоятельные устройства, работают под управлением специальных или адаптированных операционных систем, обработка изображения происходит непосредственно в самом шлеме: OculusGo, HTCViveFocus, SulonQ, DeePoon, AuraVisor. Пока не поступили в продажу. Комнаты виртуальной реальности (Cave Automatic Virtual Environment). Изображения транслируются непосредственно на стены комнаты, чаще всего это Motion Parallax 3D-дисплеи (с их помощью у пользователя формируется иллюзия объемного предмета, поскольку на экране отображается специальная проекция виртуального объекта, сгенерированная в зависимости от положения пользователя относительно экрана). Иногда для создания эффекта полного погружения в таких комнатах используются 3D-очки или даже шлемы. Некоторые эксперты считают, что такой вид виртуальной реальности более совершенен, так как дисплеи позволяют отображать виртуальные элементы в более высоком разрешении, нет необходимости надевать громоздкие устройства и путаться в проводах, отсутствует эффект укачивания, упрощается самоидентификация, потому что пользователь постоянно видит себя. Вспомогательные гарнитуры. Информационные перчатки и джойстики помогают лучше распознавать положение пользователя в пространстве и его действия. Иные устройства. К ним можно отнести различные ножные платформы (3DRudder) и беговые дорожки (VirtuixOmni). Пользователь имеет возможность контролировать движения своих ног, а в случае с дорожками - даже перемещаться в пространстве, не опасаясь столкнуться с препятствиями в реальном мире. Устройства дополненной реальности. Умные очки и шлемы. При помощи технологии компьютерного зрения автономные и компактные устройства со встроенными датчиками и камерами позволяют анализировать пространство вокруг пользователя, формировать карту пространства для ориентирования в ней. Большинство очков оснащено функцией распознавания голоса и движений, ими можно управлять, не задействуя рук. Изображения проецируются на линзы очков или специальные мини-дисплеи, нет необходимости в дополнительных метках для генерации контента. Различают бинокулярные (Hololens, DAQRISmartGlasses, Meta 2); монокулярные (GoogleGlass, Vuzix M3000) модели очков и шлемов. Мобильные устройства. Практически любой современный смартфон или планшет может стать устройством дополненной реальности, достаточно лишь установить со- ответствующую программу. Для распознавания объектов чаще всего применяются маркерная технология, маркерами могут выступать QR-коды, сгенерированные точки, логотипы, компьютерное зрение и распознавание лиц. Интерактивные стенды и киоски, проецируемые в дополненной реальности. Инструмент широко используется в сфере продаж, на различных выставках. Стенды и киоски представляют собой широкоформатные экраны, позволяющие отображать фотореалистично визуализированные объекты в определенном контексте (например, демонстрация определенных функций продукта), просматривать информацию в интерактивном режиме. Изображение накладывается на любую поверхность (объект). Подводя итог, стоит сказать, что на сегодняшний день рынок технологий дополненной и виртуальной реальности только начинает развиваться и применение технологий не ограничится лишь сферой развлечений и игр. Уже сегодня проекты с их использованием помогают не только создавать концептуально новые рынки, но и расширять уже имеющиеся. НАПРАВЛЕНИЯ РАЗВИТИЯ РЫНКА ТЕХНОЛОГИЙ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ Представители Bank of America Merrill Lynch в своем исследовании 2016 года заявляют, что наряду с BigData, облачными технологиями, искусственным интеллектом технологии дополненной и виртуальной реальности станут ключевыми технологиями четвертой промышленной революции, могут стать ключевым фактором вычислительной платформы следующего поколения. Переломный момент в развитии данных технологий ожидается в 2020 году [Future Reality, 2016]. Консалтинговая и аудиторская компания PricewaterhouseCoopers ежегодно проводит исследование индекса цифровой компетентности среди компаний, осу- Рис. 2. Цикл зрелости технологий [Panetta K., 2017] ществляющих инвестиции в цифровые технологии, 10% сегодня вкладываются в дополненную реальность (в России - 15%), а 7% - в виртуальную (в России - 9%). При этом через три года в эти технологии будут готовы вложиться уже 24 и 15% опрошенных компаний соответственно [Цифровое десятилетие, 2017]. По данным исследования PricewaterhouseCoopers, на фоне других активно развивающихся направлений (Интернет вещей, искусственный интеллект, робототехника, 3Б-печать) технологии виртуальной и дополненной реальности в меньшей степени окажут дестабилизирующее влияние для их отраслей и бизнес-моделей. Компания Gartner, являющаяся одним из главных игроков на рынке аналитики информационных технологий, ежегодно составляет график цикла зрелости технологий [Panetta K., 2017]. График цикла зрелости технологий (рис. 2) показывает технологии в соответствии с их текущим положением во времени и уровнем ожиданий пользователей. Как можно заметить, технология дополненной реальности находится почти на самом дне «пропасти разочарования». Это можно объяснить несоответствием ожиданий по итогам тестирования поступивших в массовую продажу устройств и программных продуктов для дополненной реальности. На данном этапе обычно выявляются недостатки технологии. Виртуальная реальность успела пройти «пропасть разочарования» и находится на стадии «склон просвещения». У нее формируется стабильная аудитория, разработчики приступают к коммерческому внедрению и активно ищут решения существующих проблем. Согласно прогнозам, технология виртуальной реальности будет внедрена приблизительно через 2-5 лет, дополненная реальность - через 5-10 лет. Интересно сравнить настоящие результаты с предыдущими периодами. Так, в 2011-2012 годах технология дополненной реальности находилась на вершине «пика чрезмерных ожиданий», а виртуальная реальность - на дне «пропасти разочарований», как дополненная реальность сегодня. Если проанализировать цикл зрелости других технологий (например, смартфоны, голосовое и биометрическое распознавание, магазины приложений и т. п.), то можно сделать вывод о том, что прогноз Gartner достаточно точен. Поэтому данные исследования вполне можно рассматривать как вектор технологий. Технологии виртуальной и дополненной реальности находят все большее практическое применение на предприятиях. В ближайшем будущем дополненная реальность и виртуальная реальность привнесут изменения в устоявшиеся бизнес-процессы и задачи, благодаря чему можно будет получить принципиально новый опыт [Kunkel N., Soechtig S., Miniman J. et al., 2016] (табл. 1). Таблица 1 Применение технологий виртуальной и дополненной реальности [Kaiser R., Schatsky D., 2017] Что? Где ? Потенциальные результаты Управление и взаимодействие Визуальные подсказки, помогающие работнику выполнять задачи по эксплуатации, ремонту и монтажу (сборке) Аэрокосмическая промышленность, ВПК, автомобильная промышленность, строительство, здравоохранение, нефтегазовая отрасль, энергетика и коммунальные услуги, технические и прикладные науки Увеличение продуктивности, налаженный рабочий процесс, сокращение рисков, удаленное взаимодействие Иммерсивное обучение Создание реалистичной среды для тренировок, которая в обычных условиях сопряжена с высоким риском или высокими затратами для персонала; воспроизведение определенных условий и явлений для целей психологической реабилитации Потребительский сегмент, здравоохранение, высшее образование / программы повышения квалификации, промышленные продукты Сокращение рисков, снижение затрат, усиление терапевтического эффекта, сохранение расходных материалов Улучшение клиентского опыта Улучшение клиентского опыта посредством внедрения настраиваемых и уникальных методов взаимодействия с компанией, брендом или продуктом Автомобильная промышленность, банковское дело и ценные бумаги, потребительские продукты, медиа и развлечения, туризм, сфера услуг Вовлечение клиента, увеличение маркетинговых возможностей, рост продаж, увеличение конкурентоспособности бренда Дизайн и анализ Визуализация данных, проектирование, новые формы анализа Аэрокосмическая промышленность и ВПК, автомобильная промышленность, строительство, высшее образование, недвижимость, технические и прикладные науки Экономия затрат, увеличение эффективности, выявление недочетов проектирования на ранних этапах, новые методы анализа данных, составление отчетности и прогнозирование На сегодняшний день разработку контента и ПО для виртуальной и дополненной реальности можно сравнить с разработкой мобильных приложений. Так, на рынке присутствуют разработчики конечного продукта и инструменты для бизнеса на основе этих технологий. Контент и ПО можно также разделить на два типа: • ориентированные на потребителя, призванные создать впечатления, эмоциональные переживания или обеспечить прямое информирование: реклама, игры и развлечения, демонстрация продукта и его характеристик; • ориентированные на сотрудников, с тем чтобы те могли решать прикладные задачи и повысить экономическую эффективность: o обучение и формирование навыков; o прототипирование и визуализация; o помощь в эксплуатации оборудования; o коммуникации. В 2016 году инвестиционный банк GoldmanSachs провел глобальный анализ рынка технологий виртуальной и дополненной реальности, составлен прогноз потенциала рынка в 2020 и 2025 годах в различных направлениях деятельности [Profiles, 2016]. По мнению экспертов, совокупный объем рынка программного обеспечения для виртуальной и дополненной реальности в 2025 году составит 35 млрд долл., а совокупная аудитория - 315 млн пользователей (в 2017 году объем рынка составил примерно 9,1 млрд долл. [Мировой рынок, 2017]). Рис. 3. Доля продаж программного обеспечения виртуальной и дополненной реальности к 2025 году, млрд долл. [Profiles, 2016] Рис. 4. Прогноз рынка ПО для виртуальной и дополненной реальности в 2025 году, млрд долл. [Profiles, 2016] iНе можете найти то, что вам нужно? Попробуйте сервис подбора литературы. Рис. 5. Прогноз рынка технологий виртуальной и дополненной реальности, млрд долл. [Augmented Reality, 2018] 70 60 50 40 30 20 10 60,5 5 1 VR AR 12017 \"2023 Специалисты пришли к выводу, что, помимо сферы развлечений, в ближайшем будущем технологии виртуальной и дополненной реальности получат широкое распространение не только в сфере развлечений, но и в сферах недвижимости, коммерции и здравоохранения (рис. 3). Аналитики считают, что доля ПО в сегменте B2C составит 54%, а в сегменте B2B - 46% [Profiles, 2016]. Развитие программного обеспечения и контента для дополненной реальности значительно отстанет от того же для виртуальной, и к 2025 году три четверти рынка будут принадлежать именно решениям для виртуальной реальности (рис. 4). Однако со временем разрыв сократится [Profiles, 2016]. По прогнозу GoldmanSachs, устройства виртуальной реальности вскоре станут так же популярны и функциональны, как мобильные телефоны. С помощью таких девайсов пользователи смогут смотреть кино и сериалы, присутствовать на массовых мероприятиях и совершать покупки. А это значит, что виртуальная реальность заметно расширит возможности малого и крупного бизнеса. Прогнозы других компаний отличаются от представленных в исследовании GoldmanSachs. Так, предполагается, что совокупный объем рынка аппаратного и программно- го обеспечения для технологий виртуальной реальности в 2023 году вырастет до 34,1 млрд долл., а для технологий добавленной реальности - до 60,5 млрд долл. [Augmented Reality, 2018] (рис. 5). Ключевым драйвером роста объема рынка устройств виртуальной реальности станет распространение шлемов виртуальной реальности благодаря индустрии игр и развлечений. Значительный прирост в области технологий дополненной реальности, преобладание технологий дополненной реальности над технологиями виртуальной реальности обусловлены в первую очередь растущим спросом на устройства дополненной реальности в сфере здравоохранения, прогнозируется значительный спрос на системы индикации, выводимые на лобовые стекла, готовые программные решения с дополненной реальностью для сферы продаж и рост объемов инвестиций в создание устройств дополненной реальности. Кроме того, популярность именно дополненной реальности можно объяснить следующими факторами: • более широкие возможности для применения; • простота разработки, более низкие технические требования; Рис. 6. Прогноз объема выручки на рынке технологий виртуальной и дополненной реальности к 2020 году, млрд долл. Рис. 7. Прирост пользовательской базы основных платформ виртуальной реальности в России, млн долл., в 2016-2020 годах [Рынок, [2017]]. Звездочка обозначает прогноз • широкий спектр устройств, в частности мобильных, более низкая их стоимость. Аналитики полагают, что рынок устройств дополненной реальности будет расти быстрее, чем рынок устройств виртуальной реальности и через три года дополненная реальность станет одной из основных технологий [After mixed year, 2017]. Значительная доля прироста на рынке тех и других технологий будет обусловлена разработками ПО в сегменте B2C, аппаратного обеспечения. К 2021 году наибольшее распространение получат именно мобильные устройства дополненной и виртуальной реальности (примерно 75 и 16%), оставшаяся доля примерно поровну распределится между носимыми устройствами виртуальной и дополненной реальности [After mixed year, 2017]. В целом, прогнозы на перспективу 2020 года варьируют, однако тенденция к многократному росту прослеживается во всех исследованиях (рис. 6). Что касается игроков на мировом рынке, в зависимости от их функций можно выделить следующие категории: Рис. 8. Структура российского B2B рынка технологий виртуальной реальности по проектным областям [Рынок, [2017]] • Приложения и контент (игры, развлечения, соцсети и СМИ, спорт и трансляции, туризм, журналистика, образование, производство, здравоохранение, реклама и аналитика): Google, Microsoft, Sony, Apple, Valve, Facebook, Disney; • Инструменты и платформы (дистрибьюторы, SD-ин-струменты, reality capture): Unity, Unreal Engine, Dolby Atmos, Valve, Facebook; • Инфраструктура (шлемы, очки, комплектующие): Oculus, Apple, Daqri, Google, Microsoft, Valve, HTC. На основании анализа соответствующих категорий The Venture Reality Fund составили карту мирового рынка виртуальной и дополненной реальности. 2017 год стал во многом определяющим для VR-индустрии: вышли потребительские версии специальных гарнитур от Oculus, HTC, Google и Sony, а многие крупные игровые издательства и студии выпустили или анонсировали игры различных жанров и форматов для виртуальной реальности. Во многих странах, включая Россию, были созданы первые отраслевые объединения с целью консолидировать маркетинговые и интеллектуальные активы, выработать единые технологические стандарты. Российские компании, пусть и немногие, активно изучают возможности применения технологий дополненной и виртуальной реальности в бизнесе. О том, что компании готовы с ними работать, свидетельствует создание в 2015 году Ассоциации дополненной и виртуальной реальности и в 2016 году первого в стране «VR-консорци-ума», в рамках которого крупней- препятствия применения шие технологические и медиакомпании объединили свои компетенции. В России наблюдаются во многом те же тенденции, что и в других странах [Рынок, [2017]]. Более того, анализ развития событий на российском рынке виртуальной реальности в 2017 году позволяет сделать прогноз, что российские компании могут претендовать на заметное место на мировом рынке технологий виртуальной реальности (рис. 7). Российский потребительский рынок устройств, ПО и контента для виртуальной реальности к концу 2016 года оценивался в размере 21,7 млн долл., рынок решений B2B - 6,2 млн долл. Основные заказчики: высокотехнологичные государственные и частные компании и крупные бренды. Основные разработчики: крупные IT-интеграторы, разрабатывающие комплексные решения в сфере виртуальной реальности, и небольшие креативные студии, занимающиеся разработкой инсталляций в виде виртуальной реальности. В 2016 году количество компаний в сегменте технологий виртуальной реальности значительно увеличилось -от нескольких десятков до более ста. Также на рынке насчитывается более трех сотен небольших (до 5 человек) креативных команд, производящих и активно продвигающих контент и решения в сфере виртуальной реальности [Рынок, [2017]]. Крупнейшие российские компании начинают интересоваться технологиями виртуальной реальности. В бизнес их внедрили пока единицы, но за 2016 год количество таких энтузиастов выросло более чем в два раза, а значит, можно оптимистично оценить тренд на российском рынке. Также одним из ключевых факторов, оказавших влияние на формирование российского рынка, стал рост объема инвестиций: в 2015 году - 3,4 млн долл., в 2016-м - 13 млн долл. Российский рынок бизнес-ориентированных решений в сфере виртуальной реальности к концу 2016 года оценивался в размере 6,2 млн долл. (рис. 8). Основными драйверами рынка в России являются технология виртуальной реальности для мобильных устройств и разработка контента для просмотра видео в формате 360° и нетребовательных с точки зрения технических характеристик. В целом, можно сделать вывод о том, что технологии стремительно развиваются и уже пережили несколько скачков роста. НЕДОСТАТКИ ТЕХНОЛОГИЙ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ Сегодня компании и инвесторы продолжают вкладывать миллионы долларов в технологии виртуальной и дополненной реальности, однако сами технологии еще не стали массовыми. В развитии технологий виртуальной и дополненной реальности существуют определенные проблемы: • Громоздкие или неудобные гарнитуры для использования продуктов в сфере виртуальной реальности. Пользователей смущает дизайн устройств. В отношении продуктов с дополненной реальностью многие пользователи также заявляют о неудобстве очков; • Недостаток качественного контента. Пользователи заявляют об однообразии существующего контента, его низком качестве, несовершенной реализации; • Высокая стоимость устройств. Большинство компаний заинтересовано в приобретении полноценных носимых устройств - шлемов и очков, для использования их продукции не подходят мобильные устройства и маломощные варианты шлемов и очков [Augmented and Virtual Reality, 2018]; • Юридические проблемы. В основном компании выражают свои сомнения по поводу проблем с конфиденциальностью данных и кибербезопасностью; • Высокий уровень конкуренции со стороны других разработчиков в процессе сотрудничества с компаниями, ищущими проекты в сфере дополненной и виртуальной реальности или готовыми инвестировать в такие проекты. Повсеместному распространению технологий дополненной и виртуальной реальности мешает ряд недостатков, выявленных в ходе их активного тестирования и использования. Пока не удалось ликвидировать эти недостатки в полной мере (табл. 2). Среди общих проблем можно выделить дороговизну носимых устройств (шлемов и очков). Если шлем виртуальной реальности может позволить себе далеко не каждый рядовой пользователь, то умные очки дополненной реальности могут быть не по карману даже некоторым компаниям. Такая же ситуация складывается в области специализированного ПО. Заказные решения будут стоить бизнесу немалых денег, особенно если они выходят за рамки стандартных или разрабатываются для узкоспециализированных областей и должны учитывать ряд отраслевых особенностей. Общей является также проблема несовершенства устройств и ПО. Современный уровень технологического развития банально не позволяет раскрыть весь потенциал дополненной и виртуальной реальности. Одно из свойств виртуальной реальности - иммерсивность. Однако эффекта полного погружения достичь невозможно в силу низкого разрешения дисплеев, малой мобильности устройств и недостаточной производительной мощности платформ (ПК, консоли). Проблемы низкой мобильности устройств виртуальной реальности в первую очередь связаны с обилием проводов, ограниченной зоной трекинга, громоздкими размерами и тяжестью шлемов и комплектующих, ограниченностью пространства, в котором можно свободно перемещаться. Проблема совершенствования размеров комплектующих, например джойстиков, не требует масштабных разработок, однако пока не представляется возможным уменьшить размеры и вес шлемов, увеличить их автономность и мобильность без ущерба для качества картинки и производительности. Таким образом, главная задача разработчиков - совершенствование дизайна и мобильности без ущерба техническим характеристикам устройств. В дополненной реальности главная проблема устройств связана уже не с разрешением картинки, а с углом обзора. Для мобильных устройств видимая область дополненной Таблица 2 Классификация существующих недостатков технологий виртуальной и дополненной реальности Категория Аппаратное обеспечение Контент Программное обеспечение Безопасность Технология виртуальной реальности Тяжелые и неудобные шлемы, крупные гарнитуры; пространственная ограниченность при перемещении; невозможность отремонтировать на месте; высокая стоимость; недостаточное разрешение дисплеев Недостаток качественного контента; ошибки с точки зрения научной точности при переносе реальных объектов и явлений в виртуальный мир; плохо проработанный мир (отсутствие целостности, некорректное пространственное соотношение между элементами), баги; технические ограничения; высокая стоимость специализированного контента Зависимость от производительной мощности ПК и консолей; недостатки графики; отсутствие непосредственной совместимости с платформами и интеграция с другими программами; плохая оптимизация контента, низкая производительность; недостаточно оперативное устранение ошибок Отсутствие механизма защиты персональных данных и конфиденциальной информации; вредоносное ПО Технология дополненной реальности Маленький угол обзора; невозможность отремонтировать на месте; высокая стоимость носимых устройств, прямая зависимость между производительностью и стоимостью Недостаток качественного контента; ошибки с точки зрения научной точности при переносе реальных объектов и явлений в виртуальный мир; технические ограничения; высокая стоимость специализированного контента Ошибки распознавания объектов; некорректное отображение накладываемых данных; некорректное расположение объектов в пространстве; несовместимость с платформами, отсутствие интеграции с другими программами; низкая производительность; баги, недостаточно оперативное устранение ошибок Отсутствие механизма защиты персональных данных и конфиденциальной информации; вредоносное ПО Воздействие на • Тошнота, головокружение, головная боль, усталость глаз; пользователя • нагрузка на шею и позвоночник; • потеря ориентации, ощущения времени, реальности; • столкновение с объектами реального мира, травмоопас-ность Рассеянное внимание, потеря фокуса, утомляемость; травмоопасность реальности ограничена экраном смартфона или планшета, а самый большой угол обзора составляет 90° (Meta 2). Пока не решен и вопрос информационной безопасности. Сами по себе устройства дополненной и виртуальной реальности не обладают механизмом защиты персональных и конфиденциальных данных, поэтому инструменты обеспечения кибербезопасности придется искать и приобретать дополнительно. Недостаточная адаптированность контента под конкретную платформу или устройство актуальна для обоих видов реальности. То, что будет работать на Apple, не запустится на Android. То же самое с HTCVive и Playstation VR. Далеко не все программы AR и VR являются кросс-платформенными, что существенно сужает возможности их использования. Однако многие эксперты считают, что технологии дополненной и виртуальной реальности обладают огромными долгосрочными перспективами и многие недостатки удастся устранить в ближайшие пять лет. По мнению Дж. Ричителло, генерального директора компании Unity, которая создала межплатформенную среду для разработки компьютерных игр, в 2018-2019 годах предстоит снизить стоимость и увеличить функциональность устройств виртуальной реальности [5 Conclusions, 2017]. Такое заявление, в принципе, соответствует ожиданиям компании Gartner (см. рис. 2): технологии виртуальной реальности будут готовы для широкого применения в ближайшие 2-5 лет. Подводя итог, можно сказать, что рынок технологий виртуальной и дополненной реальности стремительно растет и развивается. В 2018 году ожидается увеличение объема рынка дополненной и виртуальной реальности почти на 95% в сравнении с показателями 2017 года, к 2020 году рынок вырастет многократно (по разным прогнозам, от 3 до 18 раз). Большинство аналитиков отдают первенство дополненной реальности, потому что она имеет более широкие возможности для применения, более проста в разработке, ее легко передавать посредством мобильных устройств. Так, по мнению экспертов, наибольший прирост рынка будет обеспечен именно за счет дополненной реальности для мобильных устройств. Виртуальная реальность захватит нишу игр и развлечений и В2В-сегмент, решения дополненной реальности найдут широкое применение и в сегменте В2С. Данные технологии открывают новые возможности в области моделирования и визуализации данных, навигации, проектирования, обучения и тренировок, формирования клиентского опыта и коммуникаций. Они могут быть полезны для компаний в разных отраслях, эксперты выделяют здравоохранение, образование, ритейл, недвижимость и строительство. Рис. 9. Перспективные сферы применения технологий виртуальной и дополненной реальности, ед., по ответам респондентов ТЕХНОЛОГИИ ВИРТУАЛЬНОЙ И ДОПОЛНЕННОЙ РЕАЛЬНОСТИ В РОССИЙСКИХ КОМПАНИЯХ Методология исследования С целью изучить опыт применения технологий AR/ VR и их влияния на процессы в российских компаниях проведены полуструктурированные интервью. Вопросы о применении новых технологий были составлены с учетом результатов исследований [Трачук А. В., Линдер Н. В., 2016; 2017а; Trachuk A., Linder N., 2017]. Вопросы о факторах, препятствующих использованию технологий, сформулированы с учетом исследования [Трачук А. В., Линдер Н. В., 20176]. Информантов мы искали среди друзей и знакомых, среди участников сообществ, посвященных технологиям дополненной и виртуальной реальности, в социальных сетях (Facebook, ВКонтакте). В интервью приняли участие 35 человек, в качестве респондентов выступали представители обоих полов - 19 мужчин и 16 женщин, преимущественно в возрасте до 35 лет (85,8%).Области профессиональной деятельности: развлечения, игры, образование, IT, маркетинг, государственная служба, медицина, социология, финансы, логистика, автоматизация, авиастроение, электроэнергетика, журналистика. Среди информантов были отобраны респонденты, которые: • имеют опыт использования технологий виртуальной или дополненной реальности в своей работе; • знают примеры такого использования в других компаниях в своей отрасли; • работают в компании, планирующей внедрить решения в области дополненной или виртуальной реальности в ближайшем будущем; • непосредственно задействованы в сфере разработки, внедрения или продажи аппаратного обеспечения или контента для дополненной или виртуальной реальности; • имеют научный и исследовательский интерес в данной области (обладают представлениями о текущем уровне развития технологий). Респондентам предлагалось пройти заочное интервьюирование при помощи онлайн-приложения «Google Формы». Выбор формата интервьюирования был обусловлен невозможностью проведения очных встреч и бесед с респондентами в силу различных обстоятельств. Вопросы были сгруппированы в три блока: iНе можете найти то, что вам нужно? Попробуйте сервис подбора литературы. • общий блок - вопросы с целью больше узнать о самом респонденте; • вводный блок - вопросы для того, чтобы узнать степень осведомленности респондента о технологиях; • специальный блок - вопросы, относящиеся непосредственно к предмету исследования. Последние два блока содержали вопросы, отвечая на которые нужно было выбрать один из нескольких вариантов или дать развернутый ответ. На случай, если формы будут заполнены некачественно, предусмотрено обсуждение ответов на третьем этапе с целью дополнить и уточнить их. Общение с респондентами осуществлялось посредством голосового или текстового чата в мессенджерах (Facebook, ВКонтакте, Telegram, Discord). Особое внимание было уделено обсуждению следующих вопросов: • Видите ли вы потенциал для применения технологий дополненной и виртуальной реальности в своей работе (положительный эффект от их использования)? • С какими рисками можно столкнуться (вы сталкивались) при использовании данных технологий? • Какие факторы, на ваш взгляд, препятствуют внедрению технологий дополненной и виртуальной реальности в российских компаниях? С какими проблемами вы столкнулись? • Что ожидает рынок технологий дополненной и виртуальной реальности в ближайшие 5 лет? Для более глубокого понимания результатов использован метод кейс-стади, проведен SWOT-анализ с целью систематизировать данные, полученные в ходе предыдущих этапов исследования, выявлены слабые и сильные стороны технологий дополненной и виртуальной реальности, возможности их применения и угрозы, с которыми могут столкнуться компании. Результаты исследования В целом, большинство респондентов относятся к технологиям с оптимизмом (положительные характеристики составили 71%). С эмоциональной точки зрения опыт использования описан как «полезный», «необходимый», «меняющий представление о будущем», «захватывающий», «эффективный», «результативный», «интересный», «имеющий потенциал», «без перспектив дальнейшего применения в ближайшем будущем», «в целом занимательный, но мало-реализуемый», «не оправдывающий затрат». Деятельность трех респондентов связана непосредственно с разработкой программного обеспечения (контента) стратегические решени' е рис я м № 3 (108) 2018 енеджмент в сфере развлечений с использованием дополненной и виртуальной реальности, еще один респондент занимается продажей готовых решений (также в сфере развлечений и игр). Еще 22 респондента использовали дополненную и виртуальную реальности в своей работе: более одного раза -только 13 человек, используют на постоянной основе -3 человека. Шесть респондентов высказали мнение о возможности внедрения технологий в настоящее время, еще 18 сочли, что в России технологии смогут получить распространение не раньше 2024-2025 годов. Девять респондентов не имели дела с дополненной и виртуальной реальностью в своей работе, но пятеро из них видят потенциал технологий в своей сфере деятельности (в образовании, медицине и социологии). Исключением стала сфера финансов, оба представителя отметили, что не видят перспектив для использования решений дополненной и виртуальной реальности в финансовом анализе, при этом один из них считает, что технологии дополненной могут оказаться полезными при обучении работе в специализированных программах. Девять человек считают, что их отрасль готова к внедрению данных технологий уже сегодня (образование, продажи, логистика, автоматизация, авиастроение, социология и психология). Тринадцать респондентов отметили высокий потенциал применения в ближайшем будущем. Три человека сомневаются в развитии именно российского В2В-сег-мента в ближайшем будущем, объясняя это неблагоприятной институциональной средой и отсутствием необходимой инфраструктуры. Наиболее оптимистичные прогнозы дали респонденты, работающие в крупных коммерческих компаниях. Представители средних и малых предприятий и лица, работающие в государственном секторе и бюджетных учреждениях, проявили сдержанность. Это легко объяснимо, ведь на ранних этапах принятие технологии требует большой смелости и больших вложений. Однако когда внедрение технологий станет массовым, именно малый и средний бизнес выиграет от их использования больше всего, так как выгода, например за счет значительного сокращения операционных издержек, будет превосходить затраты на внедрение. Помимо развлечений и игр наиболее перспективными сферами для внедрения и применения технологий респонденты назвали образование, медицину, строительство и не- Рис. 10. Применение технологий в трех секторах экономики, %, по ответам респондентов Пер ви чный с ектор 15 15 85 41 59 Третичный сектор 51 49 1 Виртуальная реальность ■ Дополненная реальность движимость, коммерцию и маркетинг (рис 9). Превосходство виртуальной реальности над дополненной наблюдается только в сферах развлечений, игр и туризма, представляющих больший интерес для потребителя. Такие результаты подтверждают ожидания большинства экспертов: дополненная реальность в силу своих особенностей (автономность устройств, удобство и легкость их ношения, доступ к реальному миру) имеет большие перспективы применения во всех секторах экономики (начиная с добычи сырья и заканчивая сферой услуг) (рис. 10). В примерах в основном описывались случаи моделирования ситуаций в обучении и тренировках в условиях виртуальной реальности, технологии дополненной реальности в основном применялись для оптимизации производственных процессов и визуализации информации. Приведем несколько примеров: • «Дважды использовали шлемы виртуальной реальности при моделировании социальных ситуаций, нужно было в первый раз создать ситуацию захвата заложников в кинотеатре, второй раз - имитировать землетрясение. Пока тестировали сами, на коллегах, картинка не очень. В дальнейшем планировали использовать в комплексной терапии пациентов с определенными фобиями и расстройствами». • «Испробовала УК /ЛЯ в имитации поиска человека и тушении пожара, также в прыжке с парашютом (МЧС России). Больше как развлечение выглядело. Не могу сказать, что в нашей сфере имеет потенциал, по крайней мере сейчас». • «Проводили экспериментальный урок астрономии среди учеников 4-го класса, показывали фильм в формате 360°, рассказывающий о космических телах и явлениях. Ребята были в восторге, очень заинтересовались тематикой. Покупали очки для смартфонов, в среднем стоят рублей 800, а смартфоны и так есть почти у всех ребят. Планируем чаще проводить такие уроки, очень удобно и интересно, особенно в изучении естественных наук, главное, чтобы фильмы выпускали». • «Занимаюсь разработкой систем учета и маркирования для складских помещений и производств... Дополненная реальность позволит создавать системы логистики с интерактивной навигацией, на что в ближайшем будущем подсядут многие компании». • «В ритейле можно использовать дополненную и виртуальную реальность для сортировки и расположения товаров по результатам аналитики поведения покупателя в магазине, у нас демонстрировали на работе один раз, интересная вещь. Руководство планирует ввести в работу к 2019 году». • «Вижу перспективы дополненной реальности для отображения различных показателей и технических характеристик, помощи в ремонте и т. п. Но при современном уровне развития аппаратной части разрабатывать такие системы не имеет смысла». • «Использовали в качестве эксперимента при подготовке выставочного стенда, посвященного Великой Отечественной войне, при наведении на рЯ-код открывались небольшие документальные отрывки сражений, описанных на стенде». Таблица 3 Риски внедрения и использования технологий дополненной и виртуальной реальности Риск Причина возникновения Последствие Риск, недостаточная информированность Отсутствие достоверной информации о результатах внедрения и применения технологий дополненной и виртуальной реальности в других компаниях Увеличение затрат на эксплуатацию и обучение персонала, увеличение срока окупаемости, потеря инвестиций Технологические риски Повреждение (неисправность) устройства и комплектующих, несовершенство устройств (неудобство ношения, маленький угол обзора), неподходящие условия внешней среды (например, контрастность накладываемых изображений в «умных» очках дополненной реальности зависит от освещенности помещения), низкое разрешение картинки, проблемы распознавания объектов, некорректное отображение (проектирование) объектов Приостановка рабочего процесса (задержки), потеря возможной выгоды, затраты на ремонт /покупку устройства, невозможность использовать все возможности технологий Неприятие сотрудниками Отсутствие понимания принципов работы устройств, низкая информированность, боязнь потерять работу Рост денежных и временных затрат на обучение и информирование сотрудников, пересмотр политики управления и систем мотивации и вовлечения сотрудников, возможные сокращения штата (крайний случай) Несовершенство (отсутствие) контента Отсутствие необходимых программ или их своевременного обновления, баги Приостановка рабочего процесса (задержки), невозможность использования устройств дополненной и виртуальной реальности Информационная безопасность Утечка информации, взлом системы Потеря данных, упущенные выгоды, затраты на доработку / покупку решений в сфере безопасности Травмы и негативное влияние на здоровье Столкновение с объектами реального мира, тошнота и головокружение, напряжение глаз, психоэмоциональное напряжение Рост количества требований о компенсационных выплатах, невозможность продолжительного использования устройств Зависимость от смежных технологических областей Недостаточная мощность совместно используемого оборудования (ПК, консоли, смартфоны, дисплеи) Рост затрат на материально-техническое обеспечение • «Делали анимированные маски, по типу Snapchat'oB-ских, для продвижения продукта». Важно отметить качественные результаты использования технологий виртуальной и дополненной реальности, их влияние на рабочий процесс, которые были выделены респондентами в ходе интервью: • обучение и тренировки : o сокращение времени обучения и инструктажа, увеличение их эффективности благодаря наглядности и интерактивности информации, большей вовлеченности участников в процесс; o сокращение затрат на расходные материалы, необходимые при обучении; o сокращение затрат на обучающий персонал и увеличение количества лиц, проходящих обучение; o предотвращение потенциальных рисков: если заранее моделировать ситуации (медицинские операции и инвазивные процедуры, эвакуация, обеспечение безопасности, спасение при различных ЧС), можно избежать потенциальной угрозы для здоровья и жизни сотрудников и других людей во время обучения и тренировок, а компаниям - компенсаций и страховых выплат; • рабочий процесс: o сокращение временных затрат на поиск товаров на складе (выделена область, где находятся необходимые товары); o сокращение количества ошибок и временных затрат при сборке, ремонте и эксплуатации специаль- ного оборудования (отображены интерактивные пошаговые инструкции, графические подсказки, есть индикация ошибок); о помощь в управлении и обеспечении безопасности во время авиа- и космических полетов, морских перевозок, эксплуатации военной техники, автотранспорта (безопасность и «комфорт» передвижения и эксплуатации обеспечиваются благодаря анализу окружающей среды и соответствующим навигационным подсказкам, а также мониторингу состояния технических систем и полноценной пошаговой технической поддержке в процессе устранения неисправностей; о значительно снижена аварийность, а стоимость эксплуатации единиц техники за счет своевременного выявления неисправностей; о тестирование (краш-тестирование) оборудования и техники (экономия средств); о моделирование этапов производства - увеличение производительности труда, сокращение ошибок; о сокращение времени на проектирование объектов, систем коммуникации (выявление ошибок на ранних этапах, возможность в режиме реального времени обновлять информацию о готовности объекта); продажи: о увеличение выручки за счет улучшения клиентского опыта (с помощью приложения потребитель может получить подробную информацию о продукте, Рис. 11. Факторы, препятствующие распространению технологий дополненной и виртуальной реальности 1 Высокая стоимость внедрения и эксплуатации | Недостаток контента, несовершенство ПО Отсутствие понимания возможностей их использования (неочевидность выгод) ! Сопротивление руководства, персонала Несовершенство существующих устройств Сложность внедрения его характеристиках, бренде, «примерить» вещи в электронной примерочной, узнать, как будут смотреться элементы интерьера /мебели, как будет выглядеть готовый товар, как он функционирует) и привлечения новых пользователей (создание \"Л'о^'-эффекта); о сокращение арендных площадей (нет необходимости хранить весь ассортимент в каждой торговой точке); о поддержка анализа поведения покупателя в магазине, на основании чего совершенствуется дизайн стендов и мерчандайзинг, которые влияют на объем продаж; о формирование более точного представления о конечном виде продукта (упрощен процесс разработки, сокращены временные и финансовые затраты на расходные материалы и визуализацию); • коммуникации: о построение деловых отношений (обучение персонала навыкам делового общения и взаимодействия с коллегами, партнерами и клиентами); о удаленное взаимодействие со всеми подразделениями независимо от их географического положения, упрощение процесса коммуникации, сокращение расходов на командировки, участие в семинарах и встречах; о более эффективное взаимодействие внутри команды за счет вовлечения всех сотрудников в процесс обсуждения, работы, решения задач; • реабилитация: о более быстрое и эффективное лечение пациента (борьба с фобиями, ПТСР, облегчение боли, устранение тревожности), которое представляет собой конкурентное преимущество и позволяет устанавливать более высокие цены за услуги. Таким образом, благодаря ответам респондентов удалось выяснить, в чем выгоды от использования технологий дополненной и виртуальной реальности, хотя этот список, очевидно, не является полным, поскольку респонденты ра- ботают в нескольких отраслях. Некоторые выгоды, например упрощение и увеличение эффективности процессов обучения и коммуникации, являются достаточно универсальными и могут оказаться полезными для любой компании. В результате исследования на основе полученных данных охарактеризованы перспективы рынка Б2Б-технологий виртуальной и дополненной реальности в России. Что же касается рисков, которые могут возникнуть в процессе внедрения и использования технологий дополненной и виртуальной реальности, могут возникнуть и риски (табл. 3). В целом, большинство рисков являются допустимыми и не грозят серьезными последствиями для компании. Хотя в зависимости от масштабов некоторые риски могут стать для небольших или новых компаний критическими (потеря вложенных средств). В процессе принятия взвешенного и правильного решения о внедрении технологий дополненной и виртуальной реальности важную роль играет существующая в компании политика по управлению рисками. Эффективный риск-менеджмент позволит избежать или свести к минимуму последствия наступления рисков. Респонденты также обозначили ряд факторов, которые, по их мнению, в большей степени препятствуют массовому распространению данных технологий (рис. 11). Большинство факторов, названных респондентами, являются следствием существующих недостатков технологий (см. табл. 3). Так, респонденты считают, что массовому распространению препятствуют: • Высокая стоимость внедрения и эксплуатации решений в сфере дополненной и виртуальной реальности. Как уже говорилось ранее, интерактивные стенды, виртуальные комнаты и носимые устройства стоят довольно дорого, как и программное обеспечение и контент « под заказ», удовлетворяющие всем потребностям компании. Сравнительно бюджетные варианты -шлемы VR для смартфонов, мобильные устройства, многопользовательские программные решения -не могут обеспечить нужный эффект (не удовлетворяют потребностям компании), в связи с чем их внедре- Таблица 4 Результаты применения VR в процессе подготовки к зимней Олимпиаде в 2014 году Возможность • 3Б-проектирование; • интеграция трехмерной модели с данными из других систем эксплуа-танта; • отображение данных и характеристик объектов; • возможность просмотра объектов «изнутри»; • расстановка и изменение расположения объектов; • создание любых маркетинговых материалов; • одновременная работа множества пользователей; • удаленный доступ; • разграничение прав доступа и разделение работы на участки; • возможность совместного просмотра; • учет всех вносимых изменений в режиме реального времени; iНе можете найти то, что вам нужно? Попробуйте сервис подбора литературы. • доступ ко всем версиям проекта; • визуализация пользовательских примечаний к объектам; • онлайн-взаимодействие подразделений; • формирование отчетности; • расстановка людей на объектах; • возможность перемещаться по объектам; • возможность взаимодействия персонажей с объектами, выполнения специфических действий Результат • Создание модели, объединяющей архитектурно-планировочные, конструктивные и инженерные решения с отражением всех технико-экономических показателей; • выявление недостатков объектов уже на этапе проектирования; • проверка эксплуатационных гипотез задолго до физического воплощения объекта строительства; • составление смет каждого объекта; • проработка сооружений, территорий и инфраструктуры «под ключ»; • проработка спонсорских программ; • отсутствие необходимости физического присутствия всех сотрудников на объекте, на одной территории; • демонстрация коллегам, партнерам, инвесторам и другим заинтересованным людям объектов; • отчетность перед лицами, принимающими решение; • взаимодействие в рамках единой модели без потери конфиденциальности информации по каждому объекту; • обучение обслуживающего персонала и волонтеров (проработка маршрутов); • тренировки специального персонала (охрана и безопасность), отработка действий во время определенных ситуаций; • изучение территории, расположения и внутреннего устройства объектов Эффект • Сокращение количества ошибок; • сокращение продолжительности планирования и создания (доработки) объектов; • экономия издержек на физическое моделирование (макеты); • сокращение продолжительности и стоимости поиска оптимальных конструкторских и дизайнерских решений на всех этапах подготовки к Играм; • экономия затрат на персонал (субподрядчиков, проектировщиков, рабочих, маркетологов, обучающий и управляющий персонал); • экономия времени и затрат на приобретение и расстановку объектов; • упрощение и удешевление коммуникаций между всеми участниками проекта (подрядчиками, спонсорами, организаторами, работниками служб, волонтерами и т.д.); • упрощение и удешевление отчетности; • привлечение дополнительных инвестиций; • убыстрение взаимодействия между работниками подразделений; • возможность проведения обучения и тренировок в привязке к определенным локациям до момента сдачи объектов в эксплуатацию; • сокращение времени обучения и инструктажа; • сокращение затрат на элементы и расходные материалы, необходимые в обучении; • сокращение затрат на обучающий персонал ние не имеет смысла. Исключение составляют маркетинг, продажи, образование и журналистика, то есть ориентированные на потребителя (информирование, wow-эффект, визуализация информации). В таких областях возможно применение решений c использованием технологии дополненной реальности для мобильных устройств. • Недостаток специализированного контента и несовершенство устройств. Для ряда областей (медицина, инженерия, физика, ракето-, автомобиле- и авиастроение) или выполнения узкоспециализированных задач (ремонт оборудования, навигация) необходим контент, отвечающий целому набору требований, в том числе научной достоверности и высокой степени точности. Его могут предложить далеко не все разработчики. Кроме того, есть технологические ограничения (производительная мощность устройств и платформ, разрешение дисплея, угол обзора, механизмы трекин-га и распознавания объектов, проблемы мобильности и столкновения с объектами реального мира и т.д.), которые не позволяют реализовать все возможности дополненной и виртуальной реальности. • Неочевидная польза. У многих руководителей и сотрудников опыт взаимодействия с виртуальной и дополненной реальностью сводится к использованию фильтров в Инстаграме, просмотру клипов в формате 360° на YouTube через смартфон, а также туманных воспоминаний о рекламе каких-то очков от Google, с помощью которых можно проверять время и прогноз погоды, не доставая телефон. Технологии рассматриваются как инструмент продвижения, способный создать \"Л'о^'-эффект. Игнорируются многогранные возможности их внедрения в рабочие, образовательные и коммуникационные процессы. В СМИ по-прежнему делается акцент на применении в игровой и развлекательной индустрии, в то время как конкретные примеры и результаты использования в других сферах не попадают в фокус внимания. В совокупности с отложенным во времени эффектом это делает неочевидной пользу внедрения. • Сопротивление внедрению технологий со стороны руководства или сотрудников. Неприятие изменений руководством - камень преткновения, не сдвинув который думать о внедрении каких-либо технологий не приходится. С сотрудниками дело обстоит проще, хотя потребуются затраты на обучение, мотивирование, вовлечение и определенное время. По мнению респондентов, данный фактор во многом обусловлен субъективным мнением, складывающимся благодаря совокупности всех остальных факторов, и по мере устранения недостатков технологий виртуальной и дополненной реальности проблема неприятия решится сама собой. • Конфиденциальность данных и кибербезопасность. Вопросы актуальны в силу доступа к пользовательским данным. В глобальном смысле проблема сведена к сложности и высокой стоимости подходящего решения. В меньшей степени респондентов волнует вопрос сложности внедрения и эксплуатации (ремонтопригодности устройств и своевременного обновления программного обеспечения), отсутствие квалифицированных кадров, способных заниматься внедрением и обслуживанием профессионального оборудования. Многие опрошенные напрямую связывали сложность с затратами: при желании можно найти техцентр или специалиста, вопрос будет именно в размере оплаты соответствующих услуг. Наша гипотеза состоит в том, что главными факторами, препятствующими распространению технологий виртуальной и дополненной реальности в российских компаниях, являются высокая стоимость и сложность их внедрения в совокупности с неочевидностью пользы от их использования. Полученные результаты позволяют считать ее отчасти верной, поскольку, по мнению респондентов, сложность внедрения не является критическим фактором. Вместе с тем информантов беспокоит отсутствие качественного и специализированного контента, удовлетворяющего профессиональным требованиям. В завершение интервью респондентам был задан вопрос об их ожиданиях относительно развития рынка технологий дополненной и виртуальной реальности в ближайшие пять лет. Большая часть респондентов считает, что наибольшим потенциалом роста в ближайшем будущем обладают пользовательские решения. Именно рост инвестиций и объемов продаж в сегменте В2С обеспечит развитие в дальнейшем В2В-сегмента (за счет совершенствования характеристик устройств, роста количества квалифицированных кадров, увеличения контента и устранения существующих недостатков). Внедрение технологий виртуальной и дополненной реальности в целом не вызывает опасений у представителей российских компаний, большинство относится к ним положительно, однако половина респондентов считает, что массовое распространение в России данные технологии смогут получить не раньше 2024-2025 годов. Собраны мнения об основных факторах, препятствующих внедрению указанных технологий в российских компаниях. Выявлены ожидания относительно основных тенденций и направлений развития данных технологий в России в ближайшем будущем. Проекты в области технологий виртуальной и дополненной реальности Российский и зарубежный бизнес активно исследует возможности, которые могут предоставить технологии виртуальной и дополненной реальности. За последние несколько лет значительно выросло число компаний, занимающихся разработкой бизнес-решений с применением данных технологий. Проект «Виртуальный Сочи-2014» [АНО, 2014] был реализован российской компанией №х18расе (в прошлом уугегга), одним из лидеров в области создания интерактивных визуализаций и симуляций. С помощью уникальной платформы для построения 3Б-моделей можно быстро создавать качественные и достоверные виртуальные копии реальных объектов любой сложности. На базе платформы NextSpace реализовано почти 200 проектов. По заказу АНО «Оргкомитет «Сочи-2014» компания NextSpace создала интерактивную 3Б-модель территории, где проводились XXII Олимпийские зимние игры и XI Паралимпийские зимние игры 2014 года. Представлена территория площадью 600 км2 и более 10 000 зданий (детально проработаны более 30 ключевых объектов): строящиеся спортивные объекты (интерьеры и экстерьеры), объекты социальной и дорожной инфраструктуры, предусмотрены инструменты визуализированной отчетности и виртуального обучения волонтеров и других сотрудников. По сути, на базе Unity 3d (игровой движок) создано подобие массовой многопользовательской ролевой онлайн-игры, где тысячи людей занимались комплексным планированием Игр в Сочи: проектировали сооружения, планировали территории и развитие временной инфраструктуры (банкоматы, рекламные стенды, вендинг и т. п.), взаимодействовали с другими участниками, учились управлять Играми и готовили персонал). Таким образом, «Виртуальный Сочи-2014» представляет собой передовую систему планирования и организации, реализация проекта позволила значительно усовершенствовать рабочие процессы на всех этапах подготовки (табл. 4). Результаты реализации данного проекта во многом сопоставимы с положительными эффектами, описанными респондентами в ходе интервью. Полученный опыт позволил основателям компании NextSpace впоследствии запустить Revizto - продукт, позволяющий любой компании применять инструменты для эффективного управления и совместной работы при проектировании и информационном моделировании зданий, в том числе используя шлемы и гарнитуры виртуальной реальности. Пакетные решения Revizto, аналогичные реализованным в олимпийском проекте, используют более 50 тысяч пользователей в 150 странах мира. На официальном сайте компании оставляют отзывы самые разные клиенты (университеты и музеи, строительные, проектные и инжиниринговые компании, дизайнерские студии, агентства недвижимости) [Блог команды, [б.г.]], в каждом из них описываются положительные эффекты от внедрения инструментов в их бизнес, в особенности - значительное ускорение координации на всех этапах реализации проектов (до 30%). Таким образом, можно считать, что опытные результаты, полученные в ходе реализации проекта «Виртуальный Сочи-2014» и применения программного пакета Revizto, доказывают наличие положительного эффекта технологий виртуальной реальности на процессы внутри компаний. Рассмотрим примеры использования технологий виртуальной и дополненной реальности в российских компаниях. Виртуальная лаборатория дополненной реальности «Моя профессия». По заказу Дворца школьников в Астане компания AR Production создала первый в мире музей, все экспонаты которого являются виртуальными. В здании дворца расположены 30 интерактивных проектов (22 из них -проекты на стыке технологий дополненной и виртуальной реальности). На стены помещения нанесены контрастные знаки. Благодаря очкам виртуальной реальности пользователь видит трехмерные сцены, с которыми можно взаимодействовать при помощи джойстика. В музее подготовлены препятствия применения обучающие и развлекательные проекты с использованием проецируемой дополненной реальности. Так, играя, ребенок может ознакомиться с крупнейшими отраслями промышленности, например поэтапно возвести здание или изучить сплавы, смешивая их компоненты в плавильном котле. Открытие лаборатории позволило привлечь новую аудиторию. Данный проект наглядно продемонстрировал, что в образовании использование методов геймификации в сочетании с визуализацией материала с использованием виртуальных элементов позволяет глубже вовлекать обучающихся в образовательный процесс, удерживать их внимание и повышать мотивацию к обучению, соответственно, получаемые знания и навыки усваиваются лучше. Посетителям было предложено осмотреть интерактивный научный парк, информационный центр по атомной энергетике, зимний сад, планетарий, образовательные кружки и программы и т.д., что, соответственно, увеличит прибыль учреждения не только за счет деятельности самого музея, но и за счет прироста новых потребителей в остальных проектах [Интерактивный музей [б.г.]]. Проекционная система дополненной реальности (LightGuideSystems) на производстве. На каждом этапе сборочного процесса рабочие получают наглядную информацию о необходимых действиях (анимированная подсветка объектов, визуальные подсказки в виде текста, символов, графики, чертежей или видео), которая проецируется на рабочую поверхность. После внедрения проекционных систем в различных производственных компаниях компания Light Guide Systems проводит мониторинг результатов. Так, например, в концерне Fiat Chrysler Automobiles был проведен эксперимент: перед операторами была поставлена задача собрать зубчатые передачи и цепи. Весь процесс был разделен на 10 последовательных этапов. Работником нужно было выбрать необходимые комплектующие, провести монтаж и убедиться, что все сделано без ошибок. Часть операторов руководствовалась стандартными бумажными инструкциями, а другая часть использовала инструменты дополненной реальности. В последнем случае были получены: • сокращение числа ошибок на 80%; • сокращение продолжительности рабочего цикла на 38%; • увеличение пропускной способности на 82%. Применение данной проекционной системы в процессе тренировок в обучающем производственном центре Chrysler World Class Manufacturing Academy позволило также выявить следующие положительные эффекты: • улучшение качества производственного процесса на 80% (совокупный показатель); • сокращение ошибок на 90%; • сокращение продолжительности рабочих циклов на 40-50%; • сокращение общей длительности процесса на 38%; • углубление профессиональных компетенций работников. Подобные результаты отмечены многими пользователями решения. Это доказывает, что выявленные результаты не являются случайными [OPS Solutions, 2018]. * * * Получен положительный эффект от внедрения дополненной реальности в производственные и образовательные процессы, от использования в качестве инструмента для привлечения новой аудитории и увеличения прибыли. Таким образом, опыт внедрения технологий в целом позволяет судить об их потенциале для дальнейшего использования в бизнесе. SWOT-анализ технологий дополненной и виртуальной реальности В ходе интервью и анализа кейсов применения технологий получены данные, которые позволяют выявить слабые и сильные стороны технологий, возможности их применения и угрозы, с которыми могут столкнуться компании. Для систематизации информации из источников и интервью построена SWOT-матрица (табл. 5). Таким образом, технологии виртуальной и дополненной реальности имеют целый ряд преимуществ. Их возможности практически безграничны в образовании, медицине, науке, спорте, промышленном использовании, а также в сфере игр и развлечений и других отраслях. При условии грамотного использования потенциала технологий компаниям удастся добиться желаемых выгод за счет увеличения Сильные стороны: • разнообразие сфер применения; • нативное управление; • инновационность; • мощный ЗБ-инструмент; • взаимодействие в режиме реального времени Слабые стороны: • технологические ограничения и несовершенство ПО; • недостаток качественного контента; • высокая стоимость; • отсутствие квалифицированных кадров; • негативное влияние на здоровье Возможности: • высокий потенциал рынка, наличие свободных ниш; • готовность среды (компаний) к внедрению технологии; • рост интереса инвесторов; • развитость смежных рынков Угрозы: • конкурентные технологии (интернет вещей, искусственный интеллект, робототехника); • недостаток сведений об опытных результатах использования; • непредсказуемость внешней среды; • молодой рынок Таблица 5 SWOT-анализ применения технологий дополненной и виртуальной реальности производительности труда сотрудников, совершенствования рабочих процессов, привлечения новых потребителей и клиентов, углубления профессиональных компетенций своих сотрудников. ПРАКТИЧЕСКОЕ ПРИМЕНЕНИЕ ПОЛУЧЕННЫХ РЕЗУЛЬТАТОВ Массовому распространению технологий виртуальной и дополненной реальности препятствует ряд факторов, связанных в основном с недостатками технологического характера, но можно ожидать, что к 2020 году существенные недостатки будут устранены. В совокупности с параллельным развитием других цифровых технологий (BigData, блокчейн, искусственный интеллект, интернет вещей) это позволит сформировать к 2030 году платформу для активного развития и совершенствования технологий дополненной и виртуальной реальности. Если разработчики устройств не будут завышать потребительские ожидания (как было в свое время с GoogleGlass), а потенциальные создатели контента не разочаруются в данных технологиях, уже к 2025 году можно будет говорить об их полноценном переходе на стадию стабильного коммерческого внедрения. Драйверами развития рынка в целом будут знания, умения и компетенции, накопленные в процессе разработки потребительских решений. В частности, в области виртуальной реальности будут служить опорой разработки для игровой и развлекательной индустрии, а в области дополненной реальности - технологии дополненной реальности для мобильных устройств и head-up дисплеев, а также решения в сфере здравоохранения, продаж и электронной коммерции. Залог успеха внедрения - наличие новаторов и ранних последователей. Очень важно, чтобы компании в разных отраслях делились своим опытом внедрения технологий, а проекты в сфере технологий дополненной и виртуальной реальности освещались в СМИ и сети. О потенциальных возможностях должны рассуждать не только разработчики и руководители компаний, но также рядовые пользователи и сотрудники, которые воспользуются технологиями сами и будут рекомендовать использовать ее на своем предприятии. Нужны масштабные, зрелищные, вирусные кейсы, какими были PokemonGo. При условии грамотного использования потенциала данных технологий компаниям удастся добиться увеличения прибыли благодаря росту производительности труда сотрудников, оптимизации рабочих и производственных процессов, привлечения новых потребителей и клиентов, углубления профессиональных компетенций своих сотрудников. Анализ возможностей и недостатков технологий дополненной и виртуальной реальности, основных проблем, с которыми может столкнуться бизнес на этапе их внедрения и последующей эксплуатации, позволяет определить ряд факторов внешней и внутренней среды. Зная их, российские компании смогут минимизировать негативные последствия применения данных технологий: Регулирование Приняты регулирующие нормативные акты [Распоряжение, 2017; Указ, 2017; Указ, 2018], направленные на развитие информационного общества, формирование, поддержку и регулирование национальной цифровой экономики, обеспечение глобальной конкурентоспособности российской науки, а также поддержку отечественных разработчиков программного обеспечения. Одним из направлений развития цифровой среды является поддержка развития существующих и создания новых условий для возникновения прорывных и перспективных сквозных цифровых платформ и технологий, в том числе технологий дополненной и виртуальной реальности. В частности, к концу 2018 года планируется определить перечень необходимых стандартов и ресурсного обеспечения в области информационной безопасности, а к середине 2020 года принять соответствующие национальные стандарты [Распоряжение, 2017]. Данные меры позволят снизить риски, связанные с информационной безопасностью дополненной и виртуальной реальности. При разработке национальных проектов в области образования, науки и цифровой экономики следует ориентироваться на задачи, к которым отнесены: • создание инфраструктуры для передовых научных исследований и разработок; • обеспечение цифровой безопасности; • обеспечение подготовки высококвалифицированных кадров для цифровой экономики; • создание сквозных цифровых технологий преимущественно на основе отечественных разработок; • внедрение цифровых технологий и платформенных решений в приоритетные отрасли экономики и социальной сферы; • формирование комплексной системы финансирования проектов (венчурное финансирование, иные институты развития) по разработке и внедрению цифровых технологий и платформенных решений [Указ, 2018]. Также стоит отметить деятельность Национальной технологической инициативы, в частности план мероприятий («дорожной карты») «Нейронет». Согласно этому документу, уже к 2025 году планируется реализовать ряд мероприятий на пути к интеграции систем виртуальной и дополненной реальности в сферы образования, медицины, развлечений и спорта; к 2035 году ожидается внедрение систем интеграции человека с виртуальной средой. Таким образом, государство планирует оказывать всестороннюю поддержку разработчикам в области технологий дополненной и виртуальной реальности. Инфраструктура iНе можете найти то, что вам нужно? Попробуйте сервис подбора литературы. Так, развитию технологий способствует создание специализированных сообществ (Ассоциации дополненной и виртуальной реальности, «VR-Консорциума», отраслевого союза «НейроНет»), объединяющих представителей бизнеса, государства и частных лиц, работающих в отрасли. Совместными усилиями выявляются основные потенциальные направления развития, оказывается всесторонняя поддержка в разработке и монетизации данных технологий, ведется международная просветительская деятельность, что является существенным аспектом успешного развития технологий в В2С-секторе в ближайшем будущем. Молодость рынка Мировой рынок технологий виртуальной реальности находится в стадии формирования, международное разделение компетенций еще не завершено, основные глобальные производители контента пока не предпринимают существенных действий. В сегментах устройств уже заявили о себе технологические компании-лидеры, задавшие определенные стандарты, но у российских разработчиков контента и программного обеспечения есть все шансы занять достойное положение среди зарубежных конкурентов и претендовать на позиции поставщиков технологических и продуктовых УЯ-решений в сфере виртуальной реальности (особенно для стран Азии). Специалисты Бурное развитие национальной анимационной индустрии в последние 5 лет привело к тому, что на рынок труда вышли многочисленные высококвалифицированные аниматоры, художники, эксперты по визуализации компьютерной графики. Кроме того, в России сложилась сильная школа программистов и инженеров. В условиях благоприятной конъюнктуры валютного рынка и падения курса рубля по отношению к мировым валютам высококвалифицированный труд российских разработчиков в области контента и программного обеспечения стал сверхконкурентоспособным с точки зрения мировой цены на работы аналогичного качества. Их компетенции могут оказаться востребованы прежде всего в сферах анимации, детских и образовательных приложений, проектной визуализации в виртуальной реальности. В данном исследовании проанализированы возможности применения технологий виртуальной и дополненной реальности в бизнес-процессах компаний, выявлены основные факторы, препятствующие внедрению указанных технологий в российских компаниях. "
        },
        {
            "from": "https://cyberleninka.ru/article/n/dopolnennaya-realnost-eyo-vidy-i-instrumenty-sozdaniya",
            "ref": [
                "1.\tНепалкова А.А., Никулина Т.А., Применение технологий дополненной и виртуальной реальности для привлечения потребителей к взаимодействию с // Практический маркетинг №4. - 2019.",
                "2.\tПетрова Л.А., Кузнецова Т.Е., Цифровые технологии в экономике и бизнесе // Цифровая экономика.",
                "- 2020.",
                "3.\tRoxo M., Britto P. Augmented Reality Trends to the Field of Business and Economics: A Review of 20 years of Research. Asian Journal of Business Research, 2018."
            ],
            "text": " ﻿Дополненная реальность, её виды и инструменты создания Augmented reality, types and creation tools Биткин Валерий Владимирович Студент 2 курса Факультет Институт экономики и предпринимательства Национальный Нижегородский Государственный Университет им. Н.И. Лобачевского Россия, г. Нижний Новгород e-mail: valera-bitkin@yandex. ru Bitkin Valéry Vladimirovich Student 2 term Faculty ofInstitute of Economics and Entrepreneurship National Nizhny Novgorod State University named after N.I. Lobachevsky Russia, Nizhny Novgorod e-mail: valera-bitkin@yandex. ru Аннотация. В последние годы дополненная реальность стала широко использоваться как для досуга, так и для бизнес-задач. Данная статья обобщает основные виды и инструменты разработки дополненной реальности. Annotation. In recent years, augmented reality has become widely used for both leisure and business purposes. This article summarizes the main types and tools for developing augmented reality. Ключевые слова: дополненная реальность, классификация, инструменты разработки. Key words: augmented reality, classification, development tools. Дополненная реальность — это интегрированные в реальное пространство текста, графики или аудио с помощью носимого устройства отображения или проецируемых графических наложений в режиме реального времени. Дополненную реальность от виртуальной отличает наличие элементов реального мира. Дополненная реальность используется, чтобы улучшать взаимодействие пользователей с окружающим миром, а не отделять его и позволяет адаптировать информацию в зависимости от меняющихся условий. Технология дополненной реальности уже несколько лет активно набирает обороты. Её используют как крупные компании для решения серьезных бизнес-задач, так и обычные пользователи смартфонов в качестве досуга. Существует множество видов дополненной реальности и на первый взгляд достаточно сложно разобраться, как все они работают и чем отличаются. Можно по-разному классифицировать дополненную реальность, но, в целом, работу технологии можно условно разделить на маркерную и безмаркерную. В первом случае камера смартфона (или любого носимого устройства) отслеживает маркер, и с помощью специального программного обеспечения на него накладывается цифровой контент. При безмаркерной технологии используется метод SLAM (метод одновременной локализации и построения карты). Это способ распознавания окружения камеры путём разложения картинки на геометрические объекты и линии. Каждой отдельной форме система присваивает точку или множество точек, фиксируя их расположение на пространственных координатах на последовательных кадрах видеопотока. На самом деле видов дополненной реальности гораздо больше. В качестве меток иногда выступают совершенно необычные вещи. Можно выделить основные виды дополненной реальности: 1. Привязка к маркеру. В случае привязки к какой-то метке контент дополненной реальности запускается, когда в поле зрения камеры появляется триггер. Меткой в таком случае могут служить: изображения, логотипы, фотографии или даже звуки. Причем маркеры могут быть совершенно разного размера. В основном этот способ используется для \"оживления\" полиграфии или картин, когда нужно наложить цифровой контент на уже заранее созданные физические маркеры. Правда отсюда вытекает и минус такой технологии: приложения требуют обязательного присутствия метки, которой может и не быть под рукой. 2. Привязка к плоскости. В этом случае распознаются как горизонтальные, так и вертикальные плоскости (например пол и стены в вашей комнате). Такая механика применяется, когда нет необходимости держать маркер в поле зрения телефона, когда метка не нужна. К сожалению, на данный момент не все мобильные устройства поддерживают данный метод привязки, и это существенно ограничивает круг пользователей. 3. Привязка к геолокации. Технология полезна для навигации внутри больших помещений, заводов, фабрик, производственных предприятий. На данный момент эти решения обладают достаточно высокой погрешностью (ошибки возможны до 15 метров) и в помещениях работают хуже, чем на улице. Но прогресс не стоит на месте, и мы надеемся скоро увидеть более высокую точность. Или, например, представим себе такую ситуацию. Мы выходим на оживленную улицу с множеством кафе, магазинов и офисов компаний. Наводя телефон на такой проспект, мы можем видеть какой рейтинг у того или иного заведения, какие там сегодня акции, и, например, режим работы. В этом случае нет задачи распознавания изображения. Эта технология основывается на использовании присутствующих в нашем мобильном устройстве GPS-приемника, компаса и акселерометра. Благодаря им, телефон знает, в каком направлении мы смотрим. И таким образом, для дополнения реальности устройству просто нужно правильно отреагировать на показания датчиков. Интересный вид дополненной реальности — AR-портал. В цифровой реальности появляется пространство в режиме 360°. Пространством может служить фото -, видео- материалы или отрисованные в графике. AR портал может работать как обычный стенд (как видеостена в супермаркетах), демонстрируя рекламное вертикальное видео или анимационные ролики. Создается иллюзия появления как бы \"за стеклом\" или \"отражение\" в зеркале виртуального мира. Такие порталы можно просматривать и с помощью мобильного телефона. Внутри портала очень реалистичная графика. Фактически там 360-фото. Метка для AR может быть и физической. в этом случае на физическом объекте появляются какие-то дополнительные элементы. Триггером при такой механике служит сам объект. При разработке сканируется сам объект и из него создается цифровая копия в 3D-пространстве. При реализации этого вида дополненной реальности есть две основные проблемы. Первая заключается в создании этой самой копии. Для это нужен 3D-сканер или достаточно дорогой смартфон с LIDARом. Простыми словами LIDAR — это датчик измерения света и дальности до объектов. Наверное, многие слышали, что LIDARbi ставит в свои смартфоны компания Apple в последних моделях. Второй проблемой является отслеживание таких меток — требуется достаточно неплохое разрешение камеры. Реже встречается такой вид дополненной реальности как интеграция реалистичных персонажей — это механика, при которой реальный объект помещают в дополненную реальность. Чтобы достичь такого эффекта есть несколько способов: первый - снять 2D-видео. Реальный объект снимают на хромакее с ракурса человеческого роста, в графическом редакторе удаляется фон и изображение помещается в AR-среду под прямым углом к зрителю. При попытке зрителя обойти объект, он поворачивается к зрителю одной и той же стороной, сохраняя иллюзию объема. Второй способ — это 4D-съёмка. Используется набор специальных камер, захватывающих объект в движении. В результате съёмки получается реалистичная 3D-модель с анимацией, готовая для интеграции в AR-среду. При реализации данного вида дополненной реальности мы добиваемся высокой степени реализма при сравнительно небольшой мощности смартфона. Теперь, немного разобравшись в видах, изучим существующие инструменты для создания дополненной реальности. Чтобы программировать дополненную реальность необходимы наборы средств разработки и соответствующие SDK. Такие SDK разрабатывают компании-гиганты как Google, Facebook, Apple. Набор инструментов ARKit от Apple способен распознавать габариты окружающего пространства, учитывать условия освещения, чтобы интегрировать виртуальные объекты в реальную жизнь. В сочетании с хорошей камерой в устройствах Apple выглядит и правда очень реалистично. Технологию поддерживает большая часть iOS-устройств, что делает библиотеку ARKit самой массовой платформой дополненной реальности в мире. Не так давно был представлен Reality Composer - мощный и простой инструмент, с помощью которого можно упрощать создание интерактивной дополненной реальности без глубоких познаний 3D-моделирования. Помимо собственного продукта, ARKit поддерживают такие игровые движки, как например Unity и Unreal Engine, что позволяет расширить круг разработчиков. AR Quick Look — очередное решение от компании Apple. Встроенные приложения, такие как браузер Safari, Сообщения, Заметки и другие, используют Quick Look для отображения файлов виртуальных объектов в 3D или AR. AR Quick Look работает только на iOS. Можно встраивать Quick Look в свои приложения и даже веб-сайты, а пользователи смогут видеть AR-объекты в реальном мире с анимациями и звуком. Особенно актуально это становится для маркетинга. Например, мы ищем новый холодильник для кухни или вообще кухню целиком. Еще до покупки мы можем \"примерить\" ее у себя дома с соблюдением масштаба, а встроенный аудио помощник расскажет нам о преимуществах такой покупки. Самое главное, что не нужно ничего скачивать на телефон, покидая сайт продавца. Для владельцев онлайн-магазинов удержание целевой аудитории внутри своего сайта и приложения - очень важная задача, так как пользователь может не вернуться назад, увлекшись интерактивом. Ответом Apple от компании Google стал инструмент ARcore. Он использует три ключевые технологии для интеграции виртуального контента с реальным миром: • во-первых, это шесть степеней свободы, которые позволяют телефону понимать и отслеживать свое положение относительно реального мира; • во-вторых, это понимание условий окружающей среды, которое позволяет телефону определять размер и расположение плоских горизонтальных поверхностей, таких как пол или, например, журнальный столик; • в-третьих, это оценка освещенности, которая позволяет телефону понимать текущие условия освещения окружающей среды и придаёт способность цифровым объектам отбрасывать тени. ARCore поддерживают многие устройства. Список таких устройств приведен на официальном сайте Google Developers. С помощью данной технологии виртуальные объекты могут даже перекрываться физическими и быть как бы за ними. Пользоваться этим инструментом также можно на движках Unity и Unreal Engine и нативно в Android Studio. Распространяется ПО бесплатно. В браузере Google тоже стало возможно воспроизведение AR. Сам Google поиск, если ввести в строке браузера, например, слово «медведь», предложит посмотреть на животное в дополненной реальности. Следующий и очень распространенный инструмент от компании Qualcomm - именитого производителя микропроцессоров - платформа Vuforia. Она отслеживает плоские изображения и простые объемные реальные объекты (к примеру, кубы или цилиндры) в реальном времени и распознает текст. С помощью Vuforia можно писать код дополненной реальности на разных языках программирования, ее поддерживает также и Unity, что позволяет создавать мультиплатформенные решения. Vuforia хорошо и стабильно работает на большом количестве устройств, но она не бесплатная. Есть также менее популярные, но тоже довольно неплохие инструменты. Например, Wikitude. Инструмент предоставляет онлайн-студию для наложения простых статичных объектов дополненной реальности. Для этого нужно загрузить маркер в студию, добавить объекты AR и сгенерировать JavaScript. Таким образом весь рендеринг ложится на Wikitude SDK. Платформа весьма дружелюбна к пользователям. Другой инструмент — Easy AR. Казалось бы, название должно говорить само за себя, но нет: EasyAR, к сожалению, не предоставляет никаких инструментов, облегчающих жизнь разработчику. Все что мы имеем — это SDK, инструкции по запуску их примеров, небольшая документация, описывающая базовые принципы распознавания объектов и документация для С++, ее в принципе достаточно для знакомства с классами SDK, потому что все рабочее окружение — это обертка над кодом C++. Теперь поговорим о двух упрощённых решениях для создания дополненной реальности. SDK от компании SnapChat — приложение от Lens Studio, которое используется для создания эффектов AR. Любой пользователь SnapChat сможет рисовать, анимировать и продвигать собственные AR-фильтры, и пользователи успешно практикуют это. Похожим функционалом обладает программа от Instagram — Spark AR. Каких-то серьезных продуктов в дополненной реальности с помощью такого софта, конечно, не создать, но зато это доступные инструменты для новичков в разработке AR. Не стоит забывать важный и мощный инструмент браузерной 3D-графики — WebGL. Пользователи могут просматривать контент в дополненной реальности, используя мобильный браузер. Для этого необходимо разместить ссылку на сайт, на котором размещен WebAR-скрипт в рамках инфо-кампании бренда или в виде отдельной, например, маркетинговой рассылки. Механики отображения AR контента могут быть различными — можно установить объект на плоскость (пол, стена), или навести камеру на изображение, которое будет являться маркером для появления цифровой реальности. И если ранее для взаимодействия с пользователем требовалось скачать приложение, то как раз с помощью WebAR этот сложный путь сокращается до перехода по ссылке на сайт с дополненной реальностью. От пользователя требуется только разрешение на использование камеры. "
        }
    ]
}