{
    "elements": [
        {
            "from": "https://vc.ru/future/186094-webar-novaya-dopolnennaya-realnost-menyayushchaya-kulturu-potrebleniya-osobennosti-i-problemy-tehnologii",
            "text": " Будущее Кристина Шумская 10 дек 2020 10.12.2020 WebAR - новая дополненная реальность, меняющая культуру потребления. Особенности и проблемы технологии \n От компании BlackVR \n {\"id\":186094,\"type\":\"num\",\"link\":\"https:\\/\\/vc.ru\\/future\\/186094-webar-novaya-dopolnennaya-realnost-menyayushchaya-kulturu-potrebleniya-osobennosti-i-problemy-tehnologii\",\"gtm\":\"\",\"prevCount\":null,\"count\":0,\"isAuthorized\":false} {\"id\":186094,\"type\":1,\"typeStr\":\"content\",\"showTitle\":false,\"initialState\":{\"isActive\":false},\"gtm\":\"\"} {\"id\":186094,\"gtm\":null} 5455 просмотров \n Чтобы сделать дополненную реальность доступной для всех и повсюду, предоставляя иммерсивные возможности, люди придумали технологию WebAR - непосредственно в мобильном веб-браузере, когда приложение не требуется. Это упрощает опыт использования AR пользователями, но и имеет ряд недостатков и проблем, которые обсудим в этой статье. \n Что такое webAR? \n WebAR относится к веб-технологиям дополненной реальности, которые позволяют нам испытать AR через свой смартфон без какого-либо дополнительного приложения. Все, что нам нужно, это настраиваемый URL-адрес, который открывается в браузере смартфона, запрашивает разрешение камеры и доставляет контент AR в реальной среде пользователя. \n Проще говоря, вы просто посещаете веб-сайт cо своего смартфона, чтобы ознакомиться с контентом дополненной реальности. Абсолютная простота и доступность WebAR-технологий делают огромный скачок в эволюции и распространении AR во время повсеместного распространения смартфонов в мире. \n Какие преимущества у WebAR \n WebAR позволяет пользователям смартфонов открывать для себя технологию AR самым простым способом — через Интернет — без необходимости установки какого-либо приложения. Такая технология преодолевает барьеры и переносит интерактивные 3D-модели в реальный мир, к которым можно получить доступ через QR-код или ссылку. На данный момент WebAR предлагает ограниченную функциональность по сравнению с AR-приложениями, но уже включает в себя простую 3D-анимацию, видео и определенную степень интерактивности. Кроме того, WebАR поддерживает обнаружение цели-изображения (метки), что является основой механики для демонстрации контента.WebAR можно использовать на всех устройствах Android под управлением Android 6.0 и выше с гироскопом и акселерометром. Таким образом, почти 75% устройств Android могут поддерживать WebAR. В случае c iOS, WebAR можно использовать на устройствах с iOS 11 и выше. Это означает, что WebAR поддерживается на 94% устройств (87% iOS 12 и 9% iOS 11), согласно последним данным из магазина приложений Apple ( Источник: Apple Store ). \n WebAR устраняет трудности, связанные с использованием отдельного приложения, и упрощает использование контента AR для всех. Возможности распространения безграничны, поскольку вы можете поделиться URL-адресом веб-сайта, как и любой другой ссылкой, по нескольким маркетинговым каналам, например, в сообщениях в социальных сетях, цифровой баннерной рекламе, электронной почте, Whatsapp и так далее. \n Ознакомьтесь с этим примером использования WebAR в электронной коммерции, где Shopify демонстрирует, как при совершении покупок в Интернете вы можете видеть продукты в своей реальной среде из самого браузера. \n Daniel Beauchamp @pushmatrix 11 июл 2018 Browse for products, preview them in AR, and then buy with Apple Pay. All within Safari on iOS 12. It's a delightful experience that Shopify merchants will be able to offer this fall. #arkit #ios12 #shopify https://t.co/KLOKkBKAjp \n Это не только улучшает опыт покупок, но и устанавливает точные ожидания от продукта за счет правильной визуализации, что было ограничением при совершении покупок в Интернете. \n Какие недостатки у WebAR \n О надвигающейся революции AR/VR уже много сказано и написано. Ранние неудачи Google Glass и миллиарды долларов, вложенных в такие стартапы, как Magic Leap, без ясного результата, вызывают множество критики в адрес иммерсивных технологий. Несмотря на амбициозные прогнозы о масштабах AR/VR, сделанные Тимом Куком, Марком Цукербергом и многими другими, критики поспешили указать на явные пробелы в массовом внедрении этой технологии. И мы не исключение. \n Да, у WebAR тоже есть определенные проблемы, и мы всегда об этом стараемся проговаривать с нашими заказчиками. Хоть к WebAR-контенту можно получить доступ на большинстве современных смартфонов, для нормальной работы требуется приличная скорость Интернета. Кроме того, из-за интенсивной работы с 3D-контентом и анимацией кэширование браузера не может использоваться должным образом, что иногда приводит к замедлению работы пользовательского устройства, а также к “дрифту” моделей.Дрифт - небольшое смещение положения AR-контента относительно графического маркера или плоскости. Однако нельзя не отметить, что в большинстве случаев инновационности опыта достаточно, чтобы создать более тесную связь от взаимодействия с пользователем, несмотря на эти проблемы. Мы предполагаем, что только с появлением повсеместного распространения 5G эта проблема перестанет быть актуальной. \n По всем параметрам производительность AR просто лучше в приложениях. Ограничение памяти на веб-странице, на которой отображается изображение AR, является одним из препятствий для повышения производительности WebAR, поскольку оно напрямую влияет на качество графики и анимации. \n Более того, функциональность WebAR также более ограничена по сравнению с AR на основе приложений. Например, размещение предметов на стене или выполнение реальных измерений будет проблематичным. По сравнению с процессом разработки AR на основе приложений, во время создания опыта WebAR разработчики не могут получить доступ ко всем возможностям и функциям устройств, для которых они его создают, таким образом они могут работать только с основным функционалом. \n Только время покажет, смогут ли WebAR технологии эффективно решить задачу массовой доставки AR-контента каждому. Но поскольку будущее высокотехнологичных и доступных AR-очков для потребительского рынка все еще кажется далеким, оно определенно превратилось в захватывающую возможность для брендов, желающих попробовать что-то новое. Следите за новостями об иммерсивных технологиях! \n Технологии, лежащие в основе WebAR \n WebAR является частью иммерсивного интернета и, хотя для него не требуется приложение, он все же имеет некоторые технические требования. Прежде всего, ваш смартфон должен иметь датчики, такие как гироскоп, акселерометр и RGB-камеру — вещи, которыми оснащены большинство современных смартфонов — для запуска страниц WebAR. Кроме того, ваш браузер должен поддерживать WebXR: API, который позволяет пользователям просматривать контент AR/VR без установки дополнительных плагинов или программного обеспечения, а также с установленной по умолчанию ARCore на некоторых устройствах с ОС Android. \n \n Для пользователей устройств iOS, Apple разработала AR Quick Look, расширение, которое позволяет пользователям использовать ARKit в Интернете. Это обеспечивает быстрый и легкий доступ к AR через Интернет — AR Quick Look использует модели в формате USDZ. Затем, после того, как изображение AR отображается на экране, доступ к опыту AR осуществляется одним касанием. Расширение работает в браузере Safari и встроенных приложениях, таких как почта, заметки и сообщения, и позволяет вам видеть высококачественные 3D-объекты. \n Особенности применения WebAR-технологии \n WebAR активируется триггерами (QR-кодами или ссылками), и, хотя он использует веб-оптимизацию для загрузки контента, его размер по-прежнему ограничен. Причем, лучше, если изображение QR-кода будет плоским, нанесенным на неотражающий материал и определенного размера. Но если ИИ компьютерного зрения мобильного устройства может обнаруживать определенные характерные точки изображения, код в конечном итоге будет работать. \n AR на основе таких приложений, как Instagram и Snapchat, использует облачную CMS, которая дает пользователям возможность работать с AR на основе какого-либо триггера, то есть ссылки, маркера или даже лица пользователя. Триггер делает запрос к бэкэнд-системе на отправку ресурсов и кода для запуска AR. Существует определенное ограничение на размер файла AR (4 МБ) для быстрой загрузки и правильной работы на всех устройствах. \n Отрасли, в которых уже можно использовать WebAR-технологию \n Самое интересное и максимально доступное сейчас применение WebAR — это выдача контента в результатах поискового запроса в Google. Например, когда вы ищете информацию об акулах, вы можете поместить анимированную версию животного в дополненной реальности. \n Также вы можете примерить туфли, чтобы увидеть, как они будут выглядеть на самом деле, через официальный сайт производителя. Последняя функция открывает совершенно новый диапазон возможностей для совершения покупок в Интернете, поскольку клиенты будут более уверены в своей покупке, если они смогут сначала опробовать ее, взаимодействуя с 3D-моделью продукта. \n Электронная коммерция и реклама. WebAR может поднять опыт электронной коммерции на новый уровень. В случае маркетинга он предлагает новую платформу для рекламных кампаний, поскольку люди могут просто отсканировать QR-код или перейти по ссылке и получить более интересную и интерактивную рекламу, которая им действительно понравится и заставит провести больше времени с вашим брендом. \n Образование. Применение WebAR в образовательном процессе может стать отличным способом вовлечь учащихся в учебные классы и сделать весь учебный процесс более интерактивным и увлекательным. Кроме того, в перспективе это сможет помочь студентам ориентироваться в кампусе университета и получать новую информацию по мере посещения какой-нибудь лаборатории или экспоната. \n Развлекательная программа. Использование WebAR в развлекательных целях, возможно, наиболее очевидно, поскольку взаимодействие с ним само по себе действительно весело. Его можно использовать для игр или даже для продвижения фильмов. Sony Pictures фактически использовала WebAR для продвижения Джуманджи, и они предложили действительно увлекательный опыт, основанный на голосовом взаимодействии, чтобы подарить захватывающее 3D-приключение. \n Бизнес. Одна из самых интересных реализаций WebAR — визитки в 3D AR. При сканировании QR-кода на экране телефона появляется интерактивная карточка. Оттуда вы можете перемещаться по социальным сетям, электронной почте и т.д. Ваша визитная карточка WebAR также позволит вам отслеживать аналитику: сколько людей использовали QR-код. \n Будущее WebAR \n WebAR на данный момент является еще далекой от совершенства технологией, которая во многих случаях не позволит нам избавиться от необходимости устанавливать приложения на мобильные устройства для получения качественного AR-контента. Однако и мобильные устройства являются не совершенным средством потребления AR контента. Многие варианты работы с дополненной реальностью через смартфон позволяют пользователю по-новому взаимодействовать с продуктом, хоть и являются не самыми удобными из-за ограничений интерфейса. \n Мы ожидаем в ближайшие годы приход потребительских очков дополненной реальности и повсеместного распространения сетей 5-го поколения. Первая технология позволит предоставлять пользователям наилучший опыт получения контента в дополненной, даже смешанной, реальности. Вторая же технология при соответствующем развитии алгоритмов для генерации и воспроизведения контента позволит минимизировать самую главную проблему, существующую сейчас у webAR опытов: задержку в передаче данных. Кристина Шумская, Глава отдела разработки Black VR \n Вложение сейчас в развитие WebAR опыт — это больше формат пилотных проектов, которые показывают потенциал и могут научить наших клиентов, как правильно выстраивать взаимодействие бренд — WebAR — потребитель. Попытки разработки интересного и необычного опыта сейчас — вклад в свою экспертизу и готовность в будущем ответить вызовам, появляющимся с новыми технологиями.#webar #blackvr #webar_технологии #webar_разработка \n {\"id\":186094,\"type\":\"num\",\"link\":\"https:\\/\\/vc.ru\\/future\\/186094-webar-novaya-dopolnennaya-realnost-menyayushchaya-kulturu-potrebleniya-osobennosti-i-problemy-tehnologii\",\"gtm\":\"\",\"prevCount\":null,\"count\":0,\"isAuthorized\":false} {\"contentId\":186094,\"count\":0,\"isReposted\":false,\"gtm\":null} {\"id\":186094,\"type\":1,\"typeStr\":\"content\",\"showTitle\":false,\"initialState\":{\"isActive\":false},\"gtm\":\"Post \\u2014 Add To Favorites \\u2014 Click\"} {\"id\":186094,\"gtm\":null} {\"voteData\":{\"id\":186094,\"type\":1,\"typeStr\":\"content\",\"state\":0,\"withUsers\":1,\"contentId\":186094,\"subsite\":{\"id\":199118,\"name\":\"\\u0411\\u0443\\u0434\\u0443\\u0449\\u0435\\u0435\",\"avatar\":\"https:\\/\\/leonardo.osnova.io\\/64d1192b-d0a7-553e-b439-ed3b9eaf59b6\\/\",\"url\":\"https:\\/\\/vc.ru\\/future\",\"type\":2},\"place\":\"content\",\"isHidden\":false,\"count\":3,\"gtm\":\"Post\"}} \n {\"id\":486048,\"url\":\"https:\\/\\/vc.ru\\/u\\/486048-kristina-shumskaya\",\"name\":\"\\u041a\\u0440\\u0438\\u0441\\u0442\\u0438\\u043d\\u0430 \\u0428\\u0443\\u043c\\u0441\\u043a\\u0430\\u044f\",\"avatar\":\"66700a47-d0a4-53e4-804e-b8dac70374b4\",\"karma\":73,\"description\":\"\\u0421\\u0442\\u0430\\u0442\\u044c\\u0438 Black VR \\u0442\\u0435\\u043f\\u0435\\u0440\\u044c \\u0447\\u0438\\u0442\\u0430\\u0439\\u0442\\u0435 \\u043d\\u0430 \\u043a\\u043e\\u0440\\u043f\\u043e\\u0440\\u0430\\u0442\\u0438\\u0432\\u043d\\u043e\\u0439 \\u0441\\u0442\\u0440\\u0430\\u043d\\u0438\\u0446\\u0435 https:\\/\\/vc.ru\\/u\\/900363-black-vr\",\"isMe\":false,\"isPlus\":false,\"isVerified\":false,\"isSubscribed\":false,\"isNotificationsEnabled\":false,\"isShowMessengerButton\":false,\"isShowSubscribe\":true} \n Вакансии Разместить Показать ещё Все вакансии \n Комментарии \n\n Написать комментарий... \n \n"
        },
        {
            "from": "https://evergreens.com.ua/ru/articles/web-ar-technology.html",
            "text": " Многие бизнесы — независимо от масштаба — рассматривают AR в качестве элемента маркетинговой стратегии, а тем более после появления технологии дополненной реальности в браузере (Web AR). Вместо скачивания и установки очередного приложения, намного проще предоставить вашим пользователям доступ к функциям AR через мобильный браузер. Отказ от экономики приложений важен, потому что клиенты, как правило, быстро теряют к ним интерес: 21% из них используют приложение только один раз, а 71% перестают его открывать в течение 90 дней. Технология дополненной реальности в вебе открывает новые возможности для бизнеса и принесет вашей компании новые конкурентные преимущества без инвестиций в разработку дополнительных приложений. Ключевые особенности Web AR технологии 1. Не требуется установка приложений.Web AR решения могут варьироваться от использования датчиков гироскопа/ акселерометра и камер для запуска и проецирования дополненной реальности на реальные объекты до более сложных решений. 2. Маркетинговая аналитика. Подключайте панель управления аналитикой и отслеживайте просмотры, пользователей, среднее время взаимодействия, конверсию CTA-кнопок, получите доступ к тепловым картам и отчетам о местоположении пользователей. 3. Rich-контент. В AR можно использовать все типы 2D и 3D-контента, включая интерактивные модели объектов, стандартное и видео с прозрачным фоном, статичную и анимированную графику, 360° видео с эффектом погружения, фотограмметрию и многое другое. 4. Кнопки CTA (призыва к действию). Настройте кнопки CTA для отправки сообщений, совершения телефонных звонков, перехода на веб-страницы, сбора контактной информации, обмена сообщениями в социальных сетях. 5. Игры.Используйте Web AR-игры (например квесты и 3D-головоломки), чтобы привлечь и порадовать своих клиентов. 6. Различные способы активации.Функция дополненной реальности может активироваться с помощью QR-кодов, коротких ссылок, прямых ссылок на ваш AR-сайт, NFC-чипов и других маркеров дополненной реальности. 7. Отслеживание изображения-маркера. Любая графика или фото могут выступать в качестве маркера дополненной реальности для проецирования содержимого на плоские или изогнутые изображения (визитки, флаеры, упаковка продукта, стены и т.д.). 8. Дополненная реальность на основе данных геолокации. Показывайте пользователям уникальный контент в зависимости от их местоположения: динамическая реклама, основанная на геолокации объекта, виртуальные указатели и маршруты, чтобы привлечь покупателей в магазин (геофенсинг). 9. Кроссплатформенность.Доступ к Web AR можно получить с широкого спектра совместимых устройств на базе iOS и Android. Но, поскольку Web AR — технология довольно новая, при ее реализации необходимо учитывать несколько моментов, самыми важными из которых являются: 1. Совместимость с браузерами.Не в каждом мобильном браузере есть поддержка Sensors API, или же могут отсутствовать определенные датчики в самом устройстве. При выпуске приложения через магазин можно контролировать, на каких устройствах оно будет работать, но в Интернете у вас такого контроля не будет. 2. Ограниченный доступ к камере с поддержкой AR.Камера с функциями AR отличается от традиционной тем, что обрабатывает дополненную реальность на уровне операционной системы устройства. Текущие реализации веб-интерфейса AR требуют, чтобы вычисления производились поверх ОС, что приводит к задержкам, ухудшению рендеринга, а иногда даже к видимым “подтормаживаниям”. Инструменты Web AR для создания веб-сайтов с дополненной реальностью Если вы заинтересованы в дальнейшем изучении возможностей дополненной реальности и технологии Web AR, мы подобрали несколько эффективных инструментов, которые могут вам в этом помочь. 8th Wall — комплексное решение для Web AR 8th Wall Web — это воплощение SLAM-движка 8th Wall, гипер-оптимизированного для реализации AR в браузерах в режиме реального времени. Он полностью построен с использованием совместимых со стандартами JavaScript и WebGL. Этот инструмент для Web AR позволяет создавать дополненную реальность с эффектом погружения в браузере на любом мобильном устройстве. Без дополнительных приложений. Augmania — инструмент для быстрого запуска AR Augmania поддерживает все типы цифровых медиа: от видео до 3D-объектов, игр и изображений. Она не требует ни навыков программирования, ни знаний 3D-дизайна и позволяет пользователям создавать и запускать live-демонстрации, интерактивные бренд-стори в дополненной реальности, использовать несколько каналов продвижения, AR-сторителлинг и не только. А еще обеспечивает доступ к аналитике в реальном времени. Google AR — экспериментальные браузеры для AR WebARonARCore и WebARonARKit — это два экспериментальных браузера для Android и iOS соответственно, которые позволяют разработчикам создавать AR-контент с помощью веб-технологий. Они не являются официальным продуктом Google (но созданы его разработчиками) и предназначены, по сути, для экспериментов. Инструменты для отображения AR-содержимого в вебе Scene Viewer — это иммерсивное средство просмотра на Android, которое позволяет использовать 3D и AR на вашем веб-сайте или в приложении, а пользователям — легко просматривать, размещать, рассматривать и взаимодействовать с доступными в Интернете 3D-моделями в своем пространстве. Большинство браузеров на Android совместимы с 3D и AR; он также поддерживает эти возможности для Google Поиска. Реализация очень проста: вам понадобится создать правильно отформатированные ссылки на веб-страницу. В зависимости от возможностей устройства и настроенных параметров, интерактивные 3D-модели будут через камеру проецироваться на окружение пользователя или их можно будет увидеть просто как 3D: если на устройстве установлены службы Google Play для AR, то Scene Viewer может показать модель в дополненной реальности или в 3D-виде; если на устройстве отсутствуют службы Google Play для AR, то Scene Viewer будет отображать контент только в 3D. Кстати, в Google Поиске вы уже можете найти 3D-изображения многих животных, например, льва, тигра, пингвина и даже динозавров: Источник: https://blog.google/products/search/travel-back-time-ar-dinosaurs-search/ AR Quick Look. Apple выпустили собственное расширение, благодаря которому пользователи могут просматривать 3D-объекты в дополненной реальности прямо в установленных iOS-приложениях (Safari, Messages, Mail). AR Quick Look также поддерживает модели и сцены, созданные в Reality Composer, что позволяет с легкостью создавать интерактивный контент, которым можно делиться и совместно просматривать на iPhone и iPad. Для этого понадобится 3D-модель в формате USDZ, и ARKit отобразит ее так, как она бы выглядела в реальном мире — с проработкой масштаба, освещения и теней. Мы надеемся, что этот обзор поможет вам несколько больше узнать о потенциале и возможностях использования дополненной реальности в веб-браузере. Одним из ключевых преимуществ этой технологии являются практически неограниченные возможности ее применения. И несомненным плюсом является то, что, с одной стороны, AR уже достаточно широко известна среди пользователей, но еще не успела стать мейнстримом и по-прежнему привлекает их внимание. Хотите реализовать интересный проект с использованием AR-технологии? Давайте вместе создадим решение, которое не только вызовет восторг у ваших клиентов, но и позволит оставить конкурентов далеко позади. Обращайтесь к нам как можно скорее, мы ответим на любые интересующие вас вопросы. #AR/VR 02.09.2020 Используемые в статье картинки взяты из открытых источников и используются как иллюстрации. Хотите обсудить ваш проект или заказать разработку? Спасибо за заявку. Мы свяжемся с вами в ближайшее время Не удалось обработать вашу заявку. Мы не работаем с представителями Российской Федерации Текст должен содержать не менее 2 символов Проверьте правильность вашего email адреса Проверьте правильность вашего телефона Текст должен содержать не менее 3 символов Отправить \n"
        },
        {
            "from": "https://evergreens.com.ua/ru/articles/augmented-reality-for-the-web.html",
            "text": " В то время как технология виртуальной реальности (VR) направлена на создание цельной цифровой среды с эффектом полного погружения, дополненная реальность (AR) — это, скорее, фильтр, который накладывает виртуальные цифровые элементы на реальный мир. Такой эффект достигается путем проецирования цифровых объектов на прозрачные голографические линзы специальных носимых устройств — “умные” очки дополненной реальности и устройства смешанной реальности. Элементы дополненной реальности через камеру могут также отображаться на экране смартфона или планшета. Развитие мощности мобильных устройств и мобильных браузеров способствовало росту популярности технологии дополненной реальности в вебе (Web AR). Для доступа к дополненной реальности в мобильном браузере достаточно использовать кастомный URL или QR-код, который автоматически откроет ссылку на AR-содержимое без скачивания дополнительных приложений. Интерес к виртуальной и дополненной реальности усилился во время эпидемии коронавируса, поскольку компании столкнулись с необходимостью перенести бизнес в онлайн. Использование передовых технологий — практически единственный способ для компаний пережить кризис. AR прекрасно подходит для визуализации и сторителлинга как возможность перенести что-то физически не существующее в наше реальное пространство. Например, просмотр товаров в дополненной реальности в браузере, AR-геймификация в рекламе и многое другое. Мы подготовили для вас интересную статистику последних тенденций в сфере AR: 88% компаний среднего размера (по американским меркам — с годовым доходом от 100 миллионов до 1 миллиарда долларов) экспериментируют с AR для развития бизнеса; Ожидается, что к 2022 году доходы от AR-рекламы превысят $2 млрд.; Рынок AR, по прогнозам, достигнет $198 миллиардов в 2025 году; Количество пользователей дополненной реальности на мобильных устройствах, по прогнозам, достигнет 3,5 миллиарда к 2022 году; 90% потребителей знают, что такое виртуальная реальность, но только 65% знают о дополненной реальности; Уровень осведомленности об AR самый высокий среди лиц в возрасте от 16 до 44 лет — от 70% до 75%; 61% онлайн-покупателей предпочитают совершать покупки на сайтах, где есть AR-контент, 49% даже готовы платить больше, если на сайте есть демонстрация товара в дополненной реальности. А теперь давайте рассмотрим несколько ярких примеров того, как компании могут использовать AR и создавать wow-эффект для своих клиентов. Кейсы использования Web AR в ритейле Дополненная реальность в вебе открывает широкие возможности для брендов, которые ищут новые способы привлечения покупателей. Доступ к мобильному AR-контенту могут получить практически все пользователи, без необходимости инвестировать в разработку отдельных фирменных приложений. Технология Web AR для создания виртуальных витрин Обычно клиенты не решаются покупать товар, не посмотрев его сперва вживую, особенно если речь идет о мебели или бытовой технике. Благодаря дополненной реальности пользователи могут “примерить”, настраивать и визуализировать различные цвета и конфигурации цифровой модели продукта в реальном времени. Решение Shopify AR позволяет продавцам создавать контент в дополненной реальности для iOS 12 и выше (поддержка Safari), и делать уникальные продуктовые страницы, а покупателям — просматривать реалистичные интерактивные 3D-версии товаров: Виртуальные примерочные в окне браузера Примерочные в дополненной реальности, подбор очков и виртуальный макияж как, например, сервис YouCam от L'Oreal, — бренды изо всех сил стараются привлечь новых клиентов и используют отслеживание лица в более практичных целях, чем забавные маски в Instagram и Snapchat. Камеры смартфонов отлично подходят на роль зеркала с дополненной реальностью. Кстати, после запуска онлайн-сервиса для подбора косметики и создания макияжа в дополненной реальности продажи компании L'Oreal выросли на 49%. Дополненная реальность и реклама Ссылка на раздел вашего сайта, где можно запустить дополненную реальность, — такой же маркетинговый канал, как и сообщения в социальных сетях, баннерная реклама, email-рассылки. Web AR открывает новое измерение для привлечения покупателей. Согласно Harvard Business Review, повышение внимания клиентов на 5% приводит к увеличению прибыли на 25-95%. Интерактивная онлайн-презентация продукта Дополненная реальность — отличная альтернатива традиционным презентациям. Вы можете создать AR-портал на сайте вашего бренда, где клиенты смогут увидеть продукт, “встроенный” в их реальное пространство, со всей дополнительной информацией, которой вы бы сопроводили живую презентацию. Toyota запустила интерактивную рекламную кампанию новой Corolla в США браузере Chrome — контент в дополненной реальности для Android-устройств (баннерная реклама). Нажимая на разные части 3D-модели, пользователи могли увидеть технические характеристики автомобиля, активировать анимации, поделиться фотографией и многое другое. Еще один впечатляющий пример эффективного привлечения покупателей с помощью дополненной реальности — кампания Air Jordan 2018 года для лимитированной серии кроссовок Air Jordan III \"Tinker\". Гостей, приглашенных на дорелизное мероприятие, попросили отсканировать мобильный Snapcode (коллаборация со Snapchat), чтобы впервые увидеть новые кроссовки, купить их и получить по указанному адресу в тот же вечер. Серия была распродана всего за 23 минуты. Персонализация клиентского опыта Совершая покупки, люди ищут еще и уникальный опыт. Поэтому ритейлеры могут использовать дополненную реальность, чтобы предоставить клиентам этот опыт и обогнать конкурентов. Геймификация — одна из эффективных тактик для повышения узнаваемости бренда, продаж и лояльности покупателей. Люди от природы любят соревноваться, их легко мотивировать различными наградами. Это могут быть значки, бонусы магазина, специальные скидки, подарки, бесплатная доставка и т.д. Челленджи и строка прогресса в игре — отличные мотиваторы, помогающие удерживать внимание пользователей и побуждать их к выполнению нужных действий. К тому же, геймификация — это просто весело, как охота на привидений в магазине LEGO: А еще дополненная реальность в мобильном браузере позволяет каждому пользователю получить уникальный опыт и даже персонализированные рекомендации по изменению его реального пространства. Работая в тандеме, AR и алгоритмы машинного обучения могут анализировать реальное окружение и в зависимости от и в зависимости от контекста предлагать клиенту продукты (например, декор) в режиме реального времени: Продвинутые AR-рекомендации точно так же могут касаться одежды, косметики, электроники, спортивного снаряжения и строиться на основе предыдущего выбора клиента. Другие варианты применения Web AR Дополненная реальность — удивительная технология, которую можно использовать далеко за пределами коммерции, развлечений и геймификации. Мы не сможем рассказать про все возможности использования AR в одной статье — в конце концов, нужно же оставить немного пространства для ваших собственных идей. Но давайте рассмотрим еще несколько примеров. Дополненная реальность в вебе для навигации Web AR можно использовать для навигации как внутри зданий (indoor), так и для outdoor-навигации, создавать AR-карты, заполняя их любым содержимым и триггерами с привязкой к координатам местоположения. Пользователи могут свободно передвигаться и направлять смартфон на любой объект. Если на цифровой карте к этому месту привязан AR-контент, они увидят соответствующие метки. Карты на основе дополненной реальности с привязкой к местоположению (location-based augmented reality) являются веб-альтернативой навигационным приложениям наподобие Google Maps. Это означает, что AR-контент на телефоне будет отображаться в зависимости от координат расположения объектов в реальном мире, в соответствии с ориентацией камеры и геолокацией, но без установки каких-либо приложений. Дополненная реальность для логистики и складов Преимущество использования технологии AR в логистических компаниях — это помощь складским работникам с доступом к нужной информации в нужное время. AR-решения могут применяться для улучшения процессов комплектации и упаковки продукции, сборки, управления запасами, оказания помощи в обучении работников склада. Например, с помощью системы внутренней навигации каждый работник может составить оптимальный маршрут к товару из списка комплектации. С помощью автоматического сканирования штрих-кодов система может проверить, прибыл ли работник в нужное место и выбрал ли правильный товар. Подведем короткий итог Дополненная реальность в вебе — перспективная технология, продолжающая набирать обороты. Ее главное преимущество — простота внедрения. Она позволяет владельцам бизнеса сэкономить на разработке мобильных приложений, и в то же время создать уникальный клиентский опыт. Чтобы узнать больше о технологии Web AR, рекомендуем прочитать нашу следующую статью. Мы предлагаем услуги специалистов по разработке и внедрению дополненной реальности в вебе для различных бизнес-сценариев, включая создание Web AR-порталов, решений для маркетинговых кампаний и не только. С помощью Web AR сервисов от Evergreen ваши клиенты смогут попробовать дополненную реальность самым простым способом — через мобильный браузер. Это делает технологию более доступной для широкой аудитории и выгодной для вашего бизнеса. Команда Evergreen имеет многолетний опыт создания нетривиальных решений для клиентов. Можем разработать для вашей компании кастомный AR-продукт на основе веб-технологий, который поможет вывести отношения с клиентами на новый уровень. Планируете запустить собственный проект с дополненной реальностью? Свяжитесь с нами, и мы с удовольствием подберем для вас лучшее техническое решение. #AR/VR 14.08.2020 Используемые в статье картинки взяты из открытых источников и используются как иллюстрации. Хотите обсудить ваш проект или заказать разработку? Спасибо за заявку. Мы свяжемся с вами в ближайшее время Не удалось обработать вашу заявку. Мы не работаем с представителями Российской Федерации Текст должен содержать не менее 2 символов Проверьте правильность вашего email адреса Проверьте правильность вашего телефона Текст должен содержать не менее 3 символов Отправить \n"
        },
        {
            "from": "https://habr.com/ru/post/656953/",
            "text": "Всем привет! Сегодня я расскажу, как можно создавать веб-реконверсии с помощью новой технологии Google Model Viewer. pexels.comВсем нам достаточно хорошо известно приложение IKEA для просмотра мебели и оформления интерьера в дополненной реальности. В настоящее время рынок пытается сократить путь пользователя от товара к покупке, находя решения, которые не будут требовать загрузки дополнительного приложения.Например, Apple и Google уже сделали попытку создать что-то похожее на IKEA: они оба выпустили WebAR-решения, позволяющие видеть контент в дополненной реальности через браузер. Взаимодействие идет от камеры к веб-странице, на которой загружается продукт.Пользователи могут перемещать и свободно менять размер любой 3D-модели, чтобы посмотреть, как мебель вписывается в их интерьер, более того, есть возможность сфотографировать созданное пространство, чтобы в дальнейшем поделиться с друзьями. Такая функция очень полезна для коммерческих сайтов или для создания произведений искусства.Apple и Google шагнули далеко вперед, перенеся дополненную реальность в веб, чтобы пользователи могли взаимодействовать с контентом и продуктами по URL-ссылке или специальному QR-коду, не устанавливая никаких дополнительных приложений на свой смартфон.WebAR Для просмотра дополненной реальности в браузере Apple разработало решение Quick Look, о котором я уже писала ранее в статье, раскрывающей особенности разработки на iOS.Google разработал Scene Viewer – фреймворк с открытым исходным кодом, который может быть встроен в любую веб-страницу и запускаться или в режиме быстрого просмотра (если устройство основано на iOS и поддерживает данную функцию), либо через Google Scene Viewer (если устройство имеет библиотеки Android или ARCore). Обе компании создали практически идентичное решение для устройств Android и iOS.Данное решение назвали Model Viewer.Model Viewer позволяет просматривать 3D-контент с помощью классической веб-страницы, а также запускать дополненную реальность в вебе, либо делать и то, и другое. В соответствии с заданными параметрами HTML-тега, которые устанавливает пользователь, программа будет выполнять ту или иную функцию.Плюсы и минусы технологии Model ViewerПлюсы:Простота сборки: для создания требуется несколько строк HTML-кода;Кроссплатформинг: с Model Viewer могут работать пользователи iOS, Android, а также те, кто используют технологию API устройств WebXR, если она поддерживается.Простота в использовании: интерфейс дружелюбен для пользователей – они могут перемещать объекты в пространстве, изменять его размер и делать снимки в несколько жестов.Минусы:Простота в использовании – для программистов: на данный момент программа не поддерживает никаких официальных инструментов, позволяющих просматривать AR-контент без знания кода. Этот минус можно рассматривать как временно отсутствующую функцию, так как на данный момент разработка AR-программ близится к созданию платформ, на которых можно просматривать контент без знания кода.Кроссплатформинг: программу сложно назвать полностью кросс-платформерной, так как ее поддерживают устройства iOS, начиная с 13 версии, Android-устройствам необходима поддержка ARCore.Не поддается настройке: на данный момент можно изменить только целевую страницу, на которую устанавливаются триггеры. AR-опыт, который запускается при нажатии кнопки «Запустить AR», отредактировать нельзя.Обнаружение функций: расширение недоступно ни на iOS, ни на Android.unsplash.comНаша команда готова работать над всеми возникающими сложностями, более того, мы всегда ищем наиболее оптимальный для клиента вариант разработки дополненной реальности.Подписывайтесь на наш канал в Telegram: там мы проводим опросы на актуальные в VR-индустрии темы, демонстрируем разработки компании и делимся последними новостями сферы, а также на наш основной источник VC.RU, в котором мы разбираем животрепещущие темы и делимся коммерческими успехами.\n"
        },
        {
            "from": "https://medium.com/phygitalism/web-ar-348de5d7188",
            "text": ""
        },
        {
            "from": "https://wayup.in/blog/augmented-reality-ar-source-of-inspiration-and-ideas-for-web-desig",
            "text": "Дополненная реальность или AR, вероятно, что одна из самых наиболее набирающих популярность тенденций в разработке мобильных приложений. При этом в веб-дизайне более широкое распространение приобрело направление виртуальной реальности (VR), так как невозможно создать такой сайт, который будет дополнять собой окружающий нас мир. Поэтому технологии AR нашли свое применение именно в мобильных приложениях. Тем не менее занятно, что во многих таких приложениях вдохновение можно найти для любых видов творчества или сферы деятельности. Что касается веб-дизайна, то напомним, что мы уже рассказали о том, как можно найти интересные идеи и сочетания элементов в художественных произведениях живописи, как подбираются палитры цветов, на что способен вдохновить Street Art, дизайн интерьеров и не только. Мы даже отдельно рассматривали веб-дизайны сайтов с VR и панорамные 3600 проекты (с работой в Photoshop). Вот и пришла пора поговорить о дополненной реальности и о мобильных приложениях. Ведь с каждым годом Apple проводит инвестирование развития технологии AR (ARKit) и тем самым способствует внедрению больших функций и возможностей. Но самое интересное в том, что технология дополненной реальности работает практически на всех iOS-устройствах и Android, что делает её действительно массовой и широко распространённой. И находит ли она свое отражение в мобильных играх или в приложениях общего характера – но её интересно изучать и ею интересно пользоваться. Что же ты такое, AR? Мобильная игра Pokemon Go – наиболее яркий и знакомый многим (как минимум по сводкам новостей за лето 2016 года) пример реализации технологии дополненной реальности. Пользователям предлагается найти и проследить цифровые объекты на улицах своих городов. На что сами пользователи отреагировали весьма активно и действительно «бросили» свои диваны и вышли на улицы. Таким образом, AR – это своего рода размытие границ между виртуальным и реальным мирами в цифровом пространстве. При этом приложения используют наше с вами фактическое местоположение, что позволяет цифровым объектам вести себя правильно и реалистично. Но игры это только часть айсберга применений AR. Не стоит сбрасывать со счетов учебные инструменты, образовательные варианты или возможности оказаться там, где человек никогда не сможет оказаться в силу разных причин. Ну да, а еще применение в медицине, науке и так далее. Практически все приложения созданы и для iOS и для Android, поэтому найти их в магазинах приложений не составит труда. World Brush Дизайнерам понравится это небольшое приложение, которое совмещает игру и творчество. Приложение позволяет рисовать виртуальное граффити практически на любом «холсте» или в пространстве. В распоряжении будут несколько кистей, цветов, дополнительных инструментов. Как это выглядит представлено на видео ниже. В результате дизайнеры получают интересные идеи и возможности подбора цветов для фотофона страниц, для поиска интересных сочетаний текста и композиции. Но также могут появиться и идеи ввода игрового момента на сайте. Например, будет ли двигаться шлейф за курсором, каким окажется по анимации параллакс и прочие «фишки». Иными словами, появляется возможность создать наброски дизайна непосредственно во время прогулки, подобрать идеи для реализации. Если посмотреть на проекты: expedition-wilde-welten, womenscancerfoundation, wowtapes, epicmoleskine, то можно увидеть забавные анимации загрузки страниц (будто действительно вы рисуете линию, а приложение торопится за вами и окрашивает её). Или забавные курсоры, что имитируют нажатие пальцем по сенсорному экрану, плавные анимации перехода и элементов, как и в приложениях AR, то есть так, как двигается сам пользователь. Некоторые дизайны кажутся созданными под влиянием прогулки и природы. IKEA Place Приложение отлично демонстрирует пример того, как AR может быть использована в электронной коммерции. Это интересно не только с дизайнерской точки зрения, но и маркетинга в целом. Благодаря такому приложению, покупатели получают возможность «примерить» предмет мебели в своем интерьере. То есть узнать, как он будет выглядеть в натуральную величину и не разочароваться при покупке. Кроме того, существует и обзор 360 градусов каждого предмета мебели. Опять же смотрим наглядное видео Самым ярким примером реализации идей приложения является проект gathersystem, где пользователю предлагают выбрать набор и подставочку для гаджетов и принадлежностей или настольный органайзер (для ручек-карандашей, смартфона, отрывных листочков и пр). Если рассматривать дизайн redbox, то это и эффект распада объекта (представьте бурлящие эмоции, когда понравившееся вам кресло не умещается в вашем интерьере, так и хочется чтобы оно перестало существовать..ууххх…обиднааа…). Это и проект модульной мебели modulosdesk с огромными интерактивными возможностями и конфигуратором собственной мебели для заказа. Star Chart Занятное приложение для тех, кто интересуется астрономией и желает пополнить свои знания о вселенной, галактиках, звездах и так далее. Пользователям необходимо навести устройство на небо, и тогда приложение расскажет, что в данный момент скрывается за облаками, какие звезды, созвездия, туманности и прочее в данной точке. Но также это приложение интересно тем, что позволяет увидеть, как небо над головой (в данный момент времени) выглядело 10 000 лет назад, увидеть в перспективе звёздные объекты и многое иное. По сути, это очень сложное приложение, а информация AR представляется во многих всплывающих сообщениях. Но тем оно и интересно. Как всегда видео Интересной реализацией идеи может стать проект lstore.graphics, что позволяет выбрать и настроить под себя макеты различных устройств и затем использовать их в дизайне, художественных работах, презентациях и так далее. Можно выбрать размер, цвет, модель. Также интересен проект bipolarstudio (его, разумеется, лучше увидеть воочию), daydreamdesigns, ceremonycoffee. В общем и целом, это дизайны, где посетители получают возможность узнать больше о продукте или услуге путем выбора из множества, путем самостоятельного решения, нужно ли им знать что-то и нужно ли кликнуть по крестику, стрелочке и так далее. То есть опять, да, интерактивные дизайны. TapMeasure Еще одно сложное приложение дополненной реальности, которое понравится тем, кто занимается интерьерами. В TapMeasure можно измерять расстояние между объектами в комнате, проверять, прямые ли объекты, нет ли искривлений стен, ровно стоит ли холодильник или табуретка (иногда предметы могут и покачиваться), создавать даже трёхмерные планы этажей дома и вообще производить 3D-визуализацию всего и вся. Таким образом, появляется отличная и удобная возможность распланировать все настолько четко и быстро, каким раньше это даже не представлялось. Все созданное в приложении можно экспортировать в обычные приложения по работе с 3D и САПР. Увидеть в действии и понять о чем идет речь можно на видео ниже. Если рассматривать идеи и реализации в веб-дизайне, то отметим для начала, что это все те же проекты с элементами VR, интерактивными подсказками, всплывающими сообщениями. Дело в том, что сам смысл технологии дополненной реальности заключается в том, чтобы дополнить окружающий нас мир, предоставить дополнительную и более детальную информацию о чем-то. Вот и сайты также могут предлагать дополнительную информацию, а могут просто «сухо» и обыденно рассказывать о некой продукции. Проект tsh.io имеет красивый и современный дизайн, впечатляющие градиенты, анимацию и прочее. Приятный визуально. Но вся информация представлена в виде – «вот она вся и не более». Даже блоки «Что внутри» – обычные статические элементы, которые не скрывают за собой ссылок, хотя анимация может некоторым посетителям сказать обратное. Но совсем иное ощущение от интерфейса и дизайна в целом приходит после посещения hotel-frida, nomos-glashuette, comanage, toakchocolate и аналогичных проектов, где пользователям предлагают самим решить, нужно ли им о чем-то большее количество информации или их устраивает все то, что уже есть на страницах сайта. Большой вывод Дополненная реальность в мобильных приложениях – это отличная и невероятная возможность размыть границы между виртуальным миром и реальным, окунуться в свои фантазии, перенестись в далекие уголки, как об этом мечтали в детстве (например, в космос). Пользователи и дизайнеры получают шанс создать свой мир, который может стать для них способом развлечения или инструментом для создания чего-то нового и полезного. Apple ARKit – хорошее решение для начала, тем более что Apple постоянно обновляет и поддерживает технологию. На сайте разработчиков множество всего и интересного: примеры, описания, файлы для загрузки. Если обратить свой взор на веб-дизайн, на плоский интернет и холст, что есть у каждого дизайнера в виде документа в том же Photoshop, то, разумеется, возникает горячее желание изменить его, наполнить некой объемностью и «жизнью». Как мы говорили, для настольных систем существует технология VR и многие сайты создаются либо с псевдо-виртуальной реальностью (когда мышкой прокручиваешь панорамное изображение), либо с поддержкой устройств VR (очков виртуальной реальности). И да, это исторические проекты, хронологические, путешествия по музеям, замкам и так далее, где все подсказки и описания появляются при клике по объекту и так далее. Не только онлайн-торговля и модульные сборки. Но вопреки сложностям работы с библиотеками VR, технология AR находит свое отражение в самых простых вещах, в самых банальных. В тех, что мы сами используем практически на каждом втором-третьем сайте. Это дополнительные подсказки, сообщения, какие-то дополнения или расширенные возможности выбора товара/услуги. И такие проекты пользуются гораздо большей популярностью и известностью, так как пользователь получает шанс узнать все интересующее его практически сразу, без совершения отдельных утомительных звонков, написания электронных писем, обращений в чате или мессенджере. Другое дело, когда информации очень много. Её так и так приходится распределять по страницам, категориям, секциям и блокам. Но ведь можно «прятать» её и в пределах одной страницы, просто используя всплывающие сообщения. vinzi-studio, trigema, ciklum – малая толика того, как дополненная реальность может реализовываться в веб-дизайне. Достаточно просто пройтись по своим любыми сайтам и понаблюдать за интерфейсом, за дизайном в целом. Но что касается мобильных приложений, то они тоже могут навеять разные мысли, которые могли просто «забыться». Идей порой так много и мыслей, что «уложить» все это в голове просто так бывает трудновато.\n"
        },
        {
            "from": "https://enter-vr.com/razrabotka-dopolnennoy-realnosti/razrabotka-web-ar/",
            "text": " Основные механики дополненной реальности в Web браузере Для использования WebAR технологии потребуется индивидуальный QR - код. При сканировании QR кода с помощью камеры телефона, появится уведомление стандартного браузера о возможности перейти по «вшитой» ссылке в QR-код. Перейдя по ссылке, пользователь оказывается на странице с возможностью воспроизвести контент дополненной реальности. AR контент появится, как только в поле зрения камеры попадет заданный триггер (маркер). Воспроизводимым контентом может быть любое изображение, звук, видео, объемная фигура, анимация и т.д. А в качестве маркера, по сути, может задаваться практически любой объект. Привязка к маркеру AR контент появится, как только в поле зрения камеры попадет заданный триггер (маркер). Воспроизводимым контентом может быть любое изображение, звук, видео, объемная фигура, анимация и т.д. А в качестве маркера, по сути, может задаваться практически любой объект. ПРИВЯЗКА 3D-ОБЪЕКТОВ К ПЛОСКОСТИ Один из способов воспроизведения - привязка к определенной точке или поверхности. Нужно только расположить или указать место появление модели или анимации. При этом для размещения не требуется триггер – установка объекта всегда выполняется с идеальной точностью с учетом его реальных размеров. Контент можно будет масштабировать и передвигать. WEBAR ПОРТАЛЫ Порталом называется дополненная реальность, которая демонстрирует виртуальное пространство вокруг пользователя, просматриваемое через мобильное устройство в режиме 360. Портал привязывается к плоскости и напоминает дверь или ворота, в которые можно войти. При проходе через данный портал, у пользователя меняется обстановка и окружение на то, которые было создано с помощью 3D моделирования, а также съемки 360. Демонстрируемый контент может быть практически любым – графическим, фото или видео 360. ВЗАИМОДЕЙСТВИЕ С 3D-ОБЪЕКТАМИ В функционал Web AR приложения можно добавить дополнительный функционал. Например, можно увеличивать/уменьшать объекты, запускать и останавливать анимации, добавлять эффекты, связанные с геолокацией, делать фото и видео с AR объектами, нажимать на специально созданные кнопки. Отснятым с помощью фото или записи видео контент дополненной реальности можно делиться в социальных сетах. Web AR маски Трендами сегодняшнего дня являются AR маски или фильтры. Популярные бренды уже используют данную технологию для увеличения и привлечения аудитории за счет wow эффекта \n"
        },
        {
            "from": "https://likevr.ru/blog/ar-ili-dopolnennaya-realnost/",
            "text": " AR или дополненная реальность — технология наложения цифрового слоя или объектов поверх видеопотока камеры устройства (планшета, смартфона и т. д.). Метод размещения объекта в дополненной реальности зависит от используемой технологии. В основе технологии лежит компьютерное зрение, распознающее картинку с камеры. Что можно размещать в дополненной реальности: трехмерные модели; анимированные сцены, состоящие из нескольких трехмерных моделей; 2D-сцены; интерактивные анимированные 2D-сцены; двухмерные изображения (иллюстрации, фотографии); видеофайлы, наложенные на вертикальную или горизонтальную плоскость; элементы UI (интерфейс). AR или дополненная реальность может быть реализована в виде приложения либо в формате web. Чтобы использовать приложение с дополненной реальностью, его необходимо скачать и установить на используемое устройство. Для использования технологии дополненной реальности на базе веб-технологий — достаточно просто перейти по ссылке на сайт. Разница между двумя типами состоит в качестве картинки (в детализации и сложности трехмерной графики), трекинга (отслеживание перемещения пользователя относительно объектов дополненной реальности и объектов дополненной реальности относительно пользователя), скорости, качестве работы AR-приложения. Типы AR-приложений: 1) Демонстрационные Позволяют просматривать объекты дополненной реальности 2) Интерактивные Конфигураторы, где пользователь может не только просматривать объект дополненной реальности, но и менять его внешний вид. Конфигуратор может быть соединён с интернет-магазином. Например, приложение IKEA Place: можно выбрать понравившийся диван, «примерить» его у себя в гостиной, а затем совершить покупку. 3) Многопользовательские игровые Например, Pokemon Go. Это интеграция AR-технологии и GPS. Могут быть и другие игровые механики, например, когда два игрока сканируют одно изображение. Они могут находиться в в совершенно разных местах, но сканировать одинаковые изображения. 4) Экспозиционные Позволяют дополнять и оживлять объекты, например, музейные или выставочные экспонаты, трехмерной и двухмерной графикой. Это могут быть промо-приложения (например, календарь или визитка дополненной реальности). При наведении на изображение визитки или календаря появляется анимированный объект дополненной реальности. Он представляет бренд или должностное лицо, относящееся к какой-либо компании. Как создается AR или дополненная реальность: Создание AR состоит из двух частей: контента и разработки. Разработка осуществляется на базе SDK (software development kit) — комплект средств разработки, позволяющий специалистам по программному обеспечению создавать приложения для определённого пакета программ, ПО базовых средств разработки, аппаратной платформы, компьютерной системы, игровых консолей, операционных систем и других платформ. SDK использует преимущества каждой из них и сокращает время на интеграцию. Распространенные SDK: Vuforia — использует технологии компьютерного зрения, отслеживания плоских изображений и простых объемных объектов в реальном времени. На базе этой платформы создаются приложения, в которых объекты дополненной реальности размещаются поверх маркеров или целей (изображений, предметов или текста) ArCore — технология для платформы Android от Google. На базе этого решения создаются приложения, где объекты размещаются на плоскости или маркере. ArKit — альтернативное решение для платформ на iOS. Позволяет распознавать плоскости, а также заранее отсканированные и загруженные в приложение трехмерные объекты и маркеры. AR Foundation — используется для кроссплатформенных приложений. Данное решение позволяет унифицировать разработку приложения: разработчик создаёт функционал, а затем с помощью этой надстройки AR Foundation задействует ArCore или ArKit (в зависимости от выбранной платформы устройства). SLAM (simultaneous localization and mapping) — технология одновременной навигации и построения карты. Используется в мобильных автономных средствах для построения карты в неизвестном пространстве или для обновления карты в заранее известном пространстве с одновременным контролем текущего местоположения и пройденного пути. По такому же принципу разработаны решения Maxst и Wikitude, а также менее известные платформы. Помимо этого, качество работы приложения дополненной реальности (обычного или веб-) зависит от устройства. В частности от производительности/мощности процессора, графического ядра и камеры, которая установлена на устройстве. Подробнее о стоимости и сроках разработки AR-приложений читайте здесь ЗАКАЗАТЬ AR \n"
        }
    ]
}