{
    "elements": [
        {
            "from": "https://developer.chrome.com/blog/ar-for-the-web/",
            "text": "In Chrome 67, we announced the WebXR Device API for both augmented reality (AR) and virtual reality (VR), though only the VR features were enabled. VR is an experience based purely on what's in a computing device. AR on the other hand allows you to render virtual objects in the real world. To allow placement and tracking of those objects, we just added the WebXR Hit Test API to Chrome Canary, a new method that helps immersive web code place objects in the real world.Note: If you want to be notified of spec updates as they land in Chrome, the [Immersive Web Early Adopters Guide](Immersive Web Early Adopters Guide) is kept in a GitHub repo and updated whenever spec changes land in Chrome. To be notified of those updates watch its repo on GitHub.# Where can I get it?This API is intended to stay in Canary for the immediate future. We want a protracted testing period because this is a very new API proposal and we want to make sure it's both robust and right for developers.Aside from Chrome Canary, you'll also need:A compatible smartphone running Android O or later.To install ARCore.Two Chrome flags (chrome://flags): WebXRDevice API (#webxr) and WebXR Hit Test (#webxr-hit-test)With these, you can dive into the demos or try out our codelab.Note: Some of the Immersive Web Community Group's existing demos, specifically the ones using magic windows, do not work with the WebXR Hit Test turned on. Please excuse our construction debris.ChacmoolImmersive Web SampleCodelab# It's just the webAt Google IO this year, we demonstrated augmented reality with an early build of Chrome. I said something repeatedly to developers and non-developers alike during those three days that I wish I had known to put in my immersive web article: \"It's just the web.\"\"What Chrome extension do I need to install?\" \"There's no extension. It's just the web.\"\"Do I need a special browser?\" \"It's just the web.\"\"What app do I need to install?\" \"There is no special app. It's just the web.\"This may be obvious to you since you're reading this on a website devoted to the web. If you build demonstrations with this new API, prepare for this question. You'll get it a lot.Speaking of IO, if you want to hear more about the immersive web in general, where it is, where it's going check out this video.# What's it useful for?Augmented reality will be a valuable addition to a lot of existing web pages. For example, it can help people learn on education sites, and allow potential buyers to visualize objects in their home while shopping.Our demos illustrates this. They allow users to place a life-size representation of an object as if in reality. Once placed, the image stays on the selected surface, appears the size it would be if the actual item were on that surface, and allows the user to move around it as well as closer to it or farther from it. This gives viewers a deeper understanding of the object than is possible with a two dimensional image.If you're not sure what I mean by all of that, it will become clear when you use the demos. If you don't have a device that can run the demo, check out the video link at the top of this article.One thing that demo and video doesn't show is how AR can convey the size of a real object. The video here shows an educational demo that we built called Chacmool. A companion article describes this demo in detail. The important thing for this discussion is that when you place the Chacmool statue in augmented reality, you're seeing its size as though it were actually in the room with you.The Chacmool example is educational but it could just as easily be commercial. Imagine a furniture shopping site that lets you place a couch in your living room. The AR application tells you whether the couch fits your space and how it will look next to your other furniture.# Ray casts, hit tests, and reticlesA key problem to solve when implementing augmented reality is how to place objects in a real-world view. The method for doing this is called ray casting. Ray casting means calculating the intersection between the pointer ray and a surface in the real world. That intersection is called a hit and determining whether a hit has occurred is a hit test.This is a good time to try out the new code sample in Chrome Canary. Before doing anything, double-check that you have the correct flags enabled. Now load the sample and click \"Start AR\".Notice a few things. First, the speed meter which you may recognize from the other immersive samples shows 30 frame per second instead of 60. This is the rate at which the web page receives images from the camera.The AR Hit Test demoThe other thing you should notice is the sunflower image. It moves as you move and snaps to surfaces such as floors and table tops. If you tap the screen, a sunflower will be placed on a surface and a new sunflower will move with your device.The image that moves with your device, and that attempts to lock to surfaces is called a reticle. A reticle is a temporary image that aids in placing an object in augmented reality. In this demo, the reticle is a copy of the image to be placed. But it doesn't need to be. In the Chacmool demo, for example, it's a rectangular box roughly the same shape as the base of the object being placed.# Down to the codeThe Chacmool demo shows what AR might look like in a production app. Fortunately, there is a much simpler demo in the WebXR samples repo. My sample code comes from the AR Hit Test demo in that repository. FYI, I like to simplify code examples for the sake of helping you understand what's going on.The basics of entering an AR session and running a render loop are the same for AR as they are for VR. You can read my previous article if you're unfamiliar. To be more specific, entering and running an AR session looks almost exactly like entering a VR magic window session. As with a magic window, the session type must be non-immersive and the frame of reference type must be 'eye-level'.# The new APINow I'll show you how to use the new API. Recall that in AR, the reticle attempts to find a surface before an item is placed. This is done with a hit test. To do a hit test, call XRSession.requestHitTest(). It looks like this:xrSession.requestHitTest(origin, direction, frameOfReference).then(xrHitResult => { //});The three arguments to this method represent a ray cast. The ray cast is defined by two points on the ray (origin and direction) and where those points are calculated from (frameOfReference). The origin and direction are both 3D vectors. Regardless of what value you submit, they will be normalized (converted) to a length of 1.# Moving the reticleAs you move your device the reticle needs to move with it as it tries to find a location where an object can be placed. This means that the reticle must be redrawn in every frame.Start with the requestAnimationFrame() callback. As with VR, you need a session and a pose.function onXRFrame(t, frame) { let xrSession = frame.session; // The frame of reference, which was set elsewhere, is 'eye-level'. // See onSessionStarted() ins the sample code for details. let xrPose = frame.getDevicePose(xrFrameOfRef); if (xrPose && xrPose.poseModelMatrix) { // Do the hit test and draw the reticle. }}Once you have the session and the pose, determine where the ray is casting. The sample code uses the gl-matrix math library. But gl-matrix is not a requirement. The important thing is knowing what you're calculating with it and that it is based on the position of the device. Retrieve the device position from XRPose.poseModalMatrix. With your ray cast in hand, call requestHitTest().function onXRFrame(t, frame) { let xrSession = frame.session; // The frame of reference, which was set elsewhere, is 'eye-level'. // See onSessionStarted() ins the sample code for details. let xrPose = frame.getDevicePose(xrFrameOfRef); if (xrPose && xrPose.poseModelMatrix) { // Calculate the origin and direction for the raycast. xrSession.requestHitTest(rayOrigin, rayDirection, xrFrameOfRef) .then((results) => { if (results.length) { // Draw for each view. } }); } session.requestAnimationFrame(onXRFrame);}Though not as obvious in the hit test sample, you still need to loop through the views to draw the scene. Drawing is done using WebGL APIs. You can do that if you're really ambitious. Though, we recommend using a framework. The immersive web samples use one created just for the demos called Cottontail, and Three.js has supported WebXR since May.# Placing an objectAn object is placed in AR when the user taps the screen. For that you use the select event. The important thing in this step is knowing where to place it. Since the moving reticle gives you a constant source of hit tests, the simplest way to place an object is to draw it at the location of the reticle at the last hit test. If you need to, say you have a legitimate reason not to show a reticle, you can call requestHitTest() in the select event as shown in the sample.# ConclusionThe best way to get a handle on this is to step through the sample code or try out the codelab. I hope I've given you enough background to make sense of both.We're not done building immersive web APIs, not by a long shot. We'll publish new articles here as we make progress.\n"
        },
        {
            "from": "https://www.banuba.com/blog/best-ar-websites-to-try-augmented-reality-online",
            "text": ""
        },
        {
            "from": "https://blog.google/products/google-ar-vr/augmented-reality-web-everyone/",
            "text": " In the next few months, there will be hundreds of millions of Android and iOS devices that are able to provide augmented reality experiences - meaning you'll be able to look at the world through your phone, and place digital objects wherever you look. To help bring this to as many users as possible, we've been exploring how to bring augmented reality to the web platform, so someday anyone with a browser can access this new technology. In this post, we’ll take a look at a recent prototype we built to explore how AR content could work across the web, from today’s mobile and desktop browsers, to future AR-enabled browsers. Techies, take note: the last section of the post focuses on technical details, so stick around if you want to dig deeper. How the prototype worksArticle is a 3D model viewer that works for all browsers. On desktop, users can check out a 3D model—in this case a space suit—by dragging to rotate, or scrolling to zoom. On mobile the experience is similar: users touch and drag to rotate the model, or drag with two fingers to zoom in. The desktop model viewing experience To help convey that the model is 3D and interactive—and not just a static image—the model rotates slightly in response to the user scrolling. With augmented reality, the model comes alive. The unique power of AR is to blend digital content with the real world. So we can, for example, surf the web, find a model, place it in our room to see just how large it truly is, and physically walk around it.When Article is loaded on an AR-capable device and browser, an AR button appears in the bottom right. Tapping on it activates the device camera, and renders a reticle on the ground in front of the user. When the user taps the screen, the model sprouts from the reticle, fixed to the ground and rendered at its physical size. The user can walk around the object and get a sense of scale and immediacy that images and video alone cannot convey. Article’s AR interface as viewed on an AR-capable tablet To reposition the model, users can tap-and-drag, or drag with two fingers to rotate it. Subtle features such as shadows and even lighting help to blend the model with its surroundings. Moving and rotating the model Small touches make it easy to learn how to use AR. User testing has taught us that clear interface cues are key to helping users learn how AR works. For example, while the user waits momentarily for the system to identify a surface that the model can be placed upon, a circle appears on the floor, tilting with the movement of the device. This helps introduce the concept of an AR interface, with digital objects that intersect with the physical environment (also known as diagetic UI). Diagetic activity indicators hint at the AR nature of the experience Under the hood (and on to the technical stuff!)We built our responsive model viewer with Three.js. Three.js makes the low-level power of WebGL more accessible to developers, and it has a large community of examples, documentation and Stack Overflow answers to help ease learning curves. To ensure smooth interactions and animations, we finessed factors that contribute to performance:Using a low polygon-count model;Carefully controlling the number of lights in the scene;Decreasing shadow resolution when on mobile devices;Rendering the emulator UI (discussed below) using shaders that utilize signed distance functions to render their effects at infinite resolution in an efficient manner.To accelerate iteration times, we created a desktop AR emulator that enables us to test UX changes on desktop Chrome. This makes previewing changes nearly instant. Before the emulator, each change—no matter how minor—had to be loaded onto a connected mobile device, taking upwards of 10 seconds for each build-push-reload cycle. With the emulator we can instead preview these tweaks on desktop almost instantly, and then push to device only when needed.The emulator is built on a desktop AR polyfill and Three.js. If one line of code (which include the polyfill), is uncommented in the index.js file , it instantiates a gray grid environment and adds keyboard and mouse controls as substitutes for physically moving in the real world. The emulator is included in the Article project repo. The spacesuit model was sourced from Poly. Many Poly models are licensed under Creative Commons Attribution Generic (CC-BY), which lets users copy and/or remix them, so long as the creator is credited. Our astronaut was created by the Poly team.Article’s 2D sections were built with off-the-shelf libraries and modern web tooling. For responsive layout and typography and overall theme, we used Bootstrap, which makes it easy for developers to create great looking sites that adapt responsively across device screen sizes. As an nod to the aesthetics of Wikipedia and Medium, we went with Bootswatch’s Paper theme. For managing dependencies, classes, and build steps we used NPM, ES6, Babel and Webpack.Looking aheadThere’s vast potential for AR on the web—it could be used in shopping, education, entertainment, and more. Article is just one in a series of prototypes, and there’s so much left to explore—from using light estimation to more seamlessly blend 3D objects with the real world, to adding diegetic UI annotations to specific positions on the model. Mobile AR on the web is incredibly fun right now because there’s a lot to be discovered. If you’d like learn more about our experimental browsers and get started creating your own prototypes, please visit our devsite. POSTED IN: Google AR & VR \n"
        },
        {
            "from": "https://rockpaperreality.com/insights/web-ar/",
            "text": ""
        },
        {
            "from": "https://www.onirix.com/web-ar-online-augmented-reality/",
            "text": " 31 May, 2022 WebAR Image Tracking Surface Tracking 2 minutes read Web AR: online augmented reality Online AR or augmented reality for web is nothing more than the consumption of this type of technology and AR experiences from a mobile web browser, such as Google Chrome or Safari on iOS. But, before we continue, if you don’t know, here we will explain what is augmented reality and also why its evolution towards web pages is so relevant. AR is one of those technologies that will change the way we communicate with our environment. Some experts are calling it “the next big thing”. Through our phone’s camera, we can see layers of visual information that provide context about what’s in front of us: a packet of cereal, a movie poster, a complex engine room, the facade of a landmark building, and so on. This technology already has a multitude of uses in many sectors, many web ar examples such as marketing, tourism, retail, industry, or even pure entertainment. You have probably seen the example of someone trying out a piece of furniture in their own home before buying it, simply by placing a virtual model of it in their living room. This is precisely what augmented reality is all about. Until recently (before the pandemic in March 2020) the vast majority of AR experiences had to be consumed through a mobile application (app-based AR). In other words, in order to view this type of content as a consumer it was necessary to search in the application market (Google Play or App Store) and download a specific app with the consequent consumption of data, space on the phone and the initial configuration process of the application. In the case discussed above would be the IKEA app, to give an example. Spoiler alert: as you can guess from the title of this post, this is no longer necessary. Web AR, how does it work? With the emergence of augmented reality for web (also known as AR in web), essentially thanks to the enormous evolution of mobile web browsers, we now have a next level of access to this technology. It is much easier, therefore, to create web pages with augmented reality and, little by little, we will be as accustomed to consuming this type of experience as we are now with content in the form of videos or gifs. These resources are associated as extra content (embedded content), which brings a next level in communication and interaction with the user and generates value to the already classic static web. So the AR web (AR for web) is nothing more than the possibility of including access to augmented reality experiences in web pages. These experiences are consumed from the browser of a cell phone and, therefore, through access to the camera from these programs we can see augmented content in our environment. As we say, it will be an increasingly natural process, both to consume and to create web content with augmented reality (content embedded in web), providing an added layer of interaction with the user. Thanks to the AR web we can tell stories and make our audience participate in a more active way. Let’s say that augmented reality is not a completely unidirectional channel, as an advertisement in video mode can be, but here the user has a main role. He/she goes from being a mere spectator to a decision-maker in the course of the narratives. Advantages and benefits of Web AR Augmented reality is a technology that offers numerous advantages. It offers contextualized and immediate information, generates a new interactive channel with brands, gives prominence to the user through interaction processes, has an impact on consumers and marks a new communication paradigm, among many others that we could discuss in detail. Here we are going to focus on the advantages of its use through web pages and, therefore, on how this change of environment brings a radically different vision to this technology. No more unnecessary mobile apps, please The main advantage is undoubtedly this, because of all the friction generated by the continuous downloading of apps for information pills that may have a short life, such as an advertisement or a tourism experience. With web orientation the user does not need to download an app with numerous components, weighing a few Megabytes too much, and slowly filling up the storage of his phone. They simply access a link and enjoy the experience immediately. Time of access to the content Related to the previous point, the process of searching, downloading and configuring an app can be slow and tortuous. If we want to reach the consumer we have to give them quick options. There are famous rules that indicate that a person decides in less than three seconds if they are going to be interested in an ad (or a video on their Instagram feed). This psychological barrier of immediacy can be transferred to any domain. Therefore, whatever the experience we are going to offer, through the AR for web we are able to reduce the time to access valuable content from several minutes to a few seconds (it all depends on how good your internet connection is). Universal compatibility Web AR is compatible with web browsers and therefore has a potential reach of more than 92% of users (more about this in our documentation on web AR player compatibility). If you want to generate a powerful and impactful experience it is essential that you reach a large number of people. If you also want to include AR in that action, nowadays it is almost mandatory that it is web AR based. Instant changes. KPI measurement Being a web environment we can include any change in our content instantly. We can forget the typical scenario that occurs in mobile apps: modify and compile the application, generate an executable for Android and another for iOS, publish them in both application markets and wait for validation by Google and Apple (sometimes very long in time). Simply add the change to the experience or structure of the solution and that’s it. In addition, being web-based, it is very easy to include metrics and usage statistics and thus measure the impact of the actions taken. The greatest value of the use of augmented reality is none other than being able to optimize any type of task, whether in an industrial environment (optimization of operator time), or in a marketing or advertising campaign (audience retention time). This KPI measurement is key and increasingly simple thanks to the web orientation of augmented reality. Web AR and QR codes How to use augmented reality? This is one of the first questions that may arise as potential consumers. What role do QR codes play in all this? A QR code is nothing more than a visual representation of an alphanumeric string. This can be any phrase and, consequently, it can also be a URL of a web page. This makes them a very powerful tool because with them we can open web pages without typing in the browser, in a completely transparent way, since it is a representation that our mobile device knows how to interpret. Nowadays most phones have a QR reader integrated into their camera. Specifically, Apple integrated its own QR reader in iPhone since iOS 11 (2017), and later Google introduced its QR reader in Android for all compatible smartphones in Android 9 (2018). This concept is important because there is always a first step to be able to consume an AR web experience and this will depend on whether we are already inside a web page with an embedded experience or not. If we are, the process is simple, there will be a hyperlink or call to action to initiate it and a click that will initiate the next step. If we are not, the first step would be to access that page. That is the role of the QR code, the gateway to the web and, therefore, to the AR experience. In the image above we can see two main elements: the QR code and a reference image or marker. This image will be where the augmented reality experience takes place. In this example we will see how the poster of the classic Chaplin movie comes to life. The character himself will appear waving with background music (turn on the sound of your phone and enjoy!). Web AR Examples Augmented reality that is consumed online can be initiated in several ways. Let’s say that web AR has an essential part in the process, which is the element on which the contents that are defined appear. The contents can be a video, a three-dimensional model, an image, an audio or a set of all of them that are combined into a scene. The way to initiate the experience with all this content is the detection or recognition phase. There are different main types of augmented reality that can be consumed on the web. Let’s look at some examples. Augmented reality with visual markers: image tracking The experience, after opening it with the QR code as explained above, must be initiated from the web browser’s camera. In these cases, an image will be the trigger of the experience. It can be an image of a poster, as in the case of Chaplin’s movie, a business card or any visual element, such as a flyer that invites us to try a car configurator and see them in different colors: If you want to try this experience you can do it in this link, and even see how it is built from Onirix Studio. Markerless web AR: Augmented Reality for Surfaces There is a concept called SLAM (simultaneous location and mapping) closely related to the world of computer vision and AR. This concept allows us to position virtual elements in our environment and keep them anchored, fixed, as if they were attached to the surface where it has been placed. The trigger of this experience is the user by detecting the surface and deciding where to place the content. For example, you can try to place this clock on the table of your desk, simply by accessing it through the QR provided. Augmented reality geolocation: automatic content On other occasions it is interesting that the trigger of the augmented reality experience is automatic. For example, if the user is at an event, let’s say a music festival, and we want him to go to several locations where he will find floating elements, like a kind of treasure hunt. In these places the ideal is that the user has to search for the content and not choose where to position it. In addition, this type of self-loaded content usually makes sense to place them previously in a specific environment, using GPS positions. A complete example of this application of content to maps and treasure hunt can be found in the Onirix documentation. Carlos González Chief Product Officer at Onirix Linkedin \n"
        },
        {
            "from": "https://evergreen.team/articles/augmented-reality-for-the-web.html",
            "text": " While virtual reality technology aims to create a purely digital environment and fully immersive experience, augmented reality (AR) is more like a filter that layers digitally rendered elements over the real world. This effect can be achieved by projecting digital objects onto the see-through holographic lenses of special wearable devices such as AR smart glasses or mixed reality devices, or by inserting AR elements into a camera image of a smartphone or tablet. The evolution of mobile device technology and mobile browsers has contributed to the increasing popularity of web-based augmented reality (Web AR). To enjoy augmented reality in a web browser, you only need a custom URL or a QR code that automatically opens a link without any additional apps. Source: https://google-ar.github.io/ A new interest in virtual and augmented reality emerged during the coronavirus pandemic when businesses were forced to shift their operations online, and the use of technology was the only way for companies to get along with the crisis. AR is very well-suited for visualization and storytelling — features that can help bring something physically inaccessible, into our real living space. For example, previewing products in AR in a web browser, AR gamification in advertising, and much more. We gathered some interesting statistics to keep you updated on the latest AR trends: 88% of mid-sized companies (those with annual revenues between $100 million and $1 billion) are experimenting with AR to help grow their business. Mobile AR advertising revenue is expected to exceed $2 billion by 2022; AR market is projected to reach $198 billion in 2025; The number of mobile augmented reality users is projected to hit 3.5 billion by 2022; 90% of consumers know what virtual reality is, but only 65% are aware of augmented reality; AR awareness levels are highest among 16 to 44-year-olds, ranging from 70% to 75% in this age group; 61% of online shoppers prefer making purchases on sites that offer AR, 49% say that they are willing to pay more for a product as long as they are allowed to preview in AR. And now, let's take a look at some vivid examples of how businesses can use AR to create a wow effect for their customers. Examples of Web AR in Retail AR on the web has opened exciting new doors for brands looking for novel ways to engage customers and makes it easier to experience AR content by anyone without the need for investing in separate mobile app development. Virtual Product Showcase Customers are usually hesitant to buy goods without physically viewing them, especially when it comes to furniture or home appliances. With augmented reality, users can customize and visualize different colors and configurations of a digital product model in real-time without the actual product. The Shopify AR solution enables merchants to develop Web AR in Safari (iOS 12 and above) to enrich their product pages, and allow shoppers to view realistic and interactive 3D versions of the goods: Virtual Try-On Virtual dressing rooms, eyewear try-on, and virtual makeup studios like the YouCam by L’Oreal — brands are trying their best to attract new customers and seek out practical ways to use facial tracking apart from sporting funny masks on Instagram and Snapchat. Smartphone cameras can be effectively used as augmented mirrors. By the way, after launching its try-before-you-buy AR makeup solution, L’Oreal increased sales by 49%. Augmented Reality for Web Advertising Your augmented reality web URL becomes another marketing channel like social media posts, banner ads, email campaigns, adding a new dimension to customer engagement. According to the Harvard Business Review, a 5% rise in customer attention generates a 25%-95% increase in profit. Interactive Online Product Launches Augmented reality is a great alternative to a face-to-face event or launch. You can create an AR portal through your brand's website to allow your audience to view the product embedded in their real environment, with added information you would usually communicate in a live presentation. Toyota launched an interactive ad campaign for the new Corolla in the U.S., available as Web AR in Chrome (banner ads) on Android devices. By tapping on different parts of an interactive 3D model, users could access additional information about the vehicle's specs, activate animations, share a photo, and more. Source: https://mobile-ar.reality.news/news/toyota-rolls-out-web-based-ar-advertising-campaign-via-8th-wall-0198696/ Another cool example of how mobile AR can skyrocket customer engagement is Air Jordan’s 2018 campaign for Air Jordan III ‘Tinker’ limited edition sneakers. Fans who had attended a pre-release event were asked to scan a mobile Snapcode (a collaboration with Snapchat) to reveal the new sneaker, purchase it and have it delivered to a selected address the same night. The sneakers sold out in just 23 minutes. Personalized Customer Experience Customers are looking for a unique experience when it comes to shopping, so retailers can use AR technology to deliver this experience and edge out the competition. Gamification is one of the effective tactics to enhance brand awareness, sales, and customer loyalty. People are naturally competitive and can be easily motivated by different rewards like badges, store points, special discounts, gifts, free shipping, etc. Challenges and progress bars are also a powerful motive to keep the customers engaged and encouraged to take the expected actions. And, gamification is simply fun, like catching ghosts in a LEGO store: Source: https://medium.com/phygitalism/web-ar-348de5d7188 Also, mobile AR can tailor the shopping experience to a customer's preferences and use their living space to make personalized recommendations. Working in tandem, AR, and machine learning can respond to a user's real environment and offer real-time contextual product suggestions: Enhanced AR recommendations can be used for anything from clothing, beauty products, electronics, sports gear based on the customer’s previous choices. Other Use Cases of Web AR Augmented reality is an amazing technology, and it can be used far beyond retail, entertainment, and gamification. We cannot cover all the potential use cases with just one article — after all, we should leave you some space for your own ideas. But let’s take a look at just a few more. Augmented Reality in the Web for Navigation Web AR can be used both for indoor and outdoor navigation, using augmented reality maps and virtually filling them with any content and location-based triggers. Users can walk around and point their phone at any object. If the AR-content exists on the digital map, they will see corresponding labels. Location-based augmented reality is a web alternative to navigation apps like Google Maps, and it means to show AR content on the phone based on the position of places in the real world, according to camera orientation and position, but without installing any apps. Source: https://medium.com/chialab-open-source/location-based-gps-augmented-reality-on-the-web-7a540c515b3c Augmented Reality for Logistics and Warehouses AR technology could be beneficial for logistics companies by providing warehouse workers with the right information at the right time. AR solutions can be used to improve processes for product picking and packing, assembly, inventory management, assisting with the training of warehouse staff. For example, by using an indoor navigation system, each worker can see the best route to the goods from their picking list. By using automated barcode scanning, the system can check whether the worker has arrived at the right place and picked the right item. Summing It Up Web-based augmented reality is a promising technology now living a great time. Its main advantage is the simplicity of implementation, and it allows businesses to cut costs on mobile app development and deliver mind-blowing user experience at the same time. To learn more about the technology behind Web AR, please follow up with our next article. We have expertise in developing and deploying web-based augmented reality for various business scenarios ranging from Web AR portals to marketing campaigns and more. With Web AR services by Evergreen, your customers can try out augmented reality in the easiest way possible — via the web, thus making the technology more accessible for a wider audience, and beneficial for your business. Our team has many years of experience in creating non-trivial solutions for our clients. We can develop a custom web-based AR product that will take your relationship with the customers to a new dimension. Planning to launch your augmented reality project? Just give us a call, and we’ll be happy to provide you with the best technical solution. #AR/VR 13.08.2020 The images used in this article are taken from open sources and are used as illustrations. Do you want to discuss your project or order development? Thank you for your application. We will contact you shortly We were unable to process your request. We do not work with a representative of the Russian Federation The text must contain at least 2 characters Check if your email address is correct Check if your phone is correct The text must contain at least 3 characters Send \n"
        },
        {
            "from": "https://blog.csssr.com/en/article/augmented-and-virtual-reality/",
            "text": "ShareIn this digital era, a website comprising various UI/UX elements and features can reveal the ocean of opportunities and become even more effective and engaging. UI/UX components and technologies not only make a website lookgreat but also secure the brand’s marketing goals.In recent years, we have witnessed a dramatic shift in website development. The innovative and futuristic technologies of augmented (AR) and virtual reality (VR) are transforming the internet and are capable of changing the way websites address users’ demands. Today, both technologies are considered as the most important trends in the IT sector, and with the help of desktops, tablets and smartphones have become more accessible, allowing millions of people to experience AR/VR applications across numerous business verticals. According to Goldman Sachs estimates, the AR/VR is projected to grow into a $95 billion market by 2025.Many web developers have started creating plugins to put AR/VR into action and make them work for the web. Some alternatives where AR/VR can add value include:Creation of exclusive web content. The fast-growing availability of open-source libraries makes it easier to create exclusive AR/VR-based content for the web even for novice developers.The expanded content options. Leveraging both technologies opens up new prospects for businesses, such as providing virtual tours that can take users to places they might not be able to enjoy in real life.Playing to consumers’ emotions. This one is becoming a popular marketing tool that drives users’ attention and encourages them to engage and cooperate with the product before they decide to purchase it.We have made an overview of each technology use case, including why they are helpful in building high-end websites/apps with high-end experience.AR for the WebAR adds digital elements to the surrounding reality, which means that users can see the physical world around with a smartphone or web camera, but they would also see additional fabricated images and elements layered over the real objects. Thus, AR builds a sort of bridge between users and virtual reality allowing them to take up activities based on their current location. Multiple web applications based on AR have stepped in due to the creation of compatible solutions (React-360 among them) that let web developers upload panoramic images and videos to their websites. With the increasing availability of AR, the technology will be broadly used in mobile UIs, as web development turns more and more towards mobile.Advertising and digital marketing will benefit most from the augmented reality since AR provides boundless opportunities to showcase products and their advantages to users. Marketers can build a simulated web (or mobile) environment stimulating customers to experience the product themselves and thus drive greater engagement.There’s a perfect example. In 2017, Wayfair (online furniture retailer) launched an application that included AR software that shows how furniture looks in a customer’s home. The app debuted as a featured app on ASUS ZenFone AR and used Tango (Google’s AR technology), to let consumers see and manipulate virtual furniture and décor at full scale.Speaking from the technology side, we should say, that since a lot of AR development now goes on the web, this is where JavaScript would reign. JavaScript provides a set of features that allow web developers either to create a new AR application or add an AR view to an existing one.Google’s also bringing AR technology to its Chrome browser. An immersive WebXR Device API first came to Chrome 79, and, according to Google Chromium blog, now it supports augmented reality and will arrive in the upcoming stable version of Chrome 81 which is in beta testing at the moment. Google also added support for the WebXR Hit Test API, an API for placing digital objects in a physical real-world view.VR for the WebVirtual reality is also pushing the web development industry further. Unlike AR, VR often requires special equipment (like a headset) and can deliver a complete experience of immersion that disconnects users from the physical world. More specifically, they are immersed in a totally fabricated world, interacting with this environment as they would in real life.Web development gets the best from VR. 3D-style web design looks great and impressive, besides, customers will enjoy observing a product staying at home. Such engagement can have a major impact on customer’s behavior and decision.Other VR capabilities providing benefits to the website include:Building virtual showrooms to highlight specific features of the product.The ability to try the product considerably reducing shopping time.VR technology can also be mobile just like AR. Mobile VR (Google’s Cardboard as the simplest example) works by pairing a smartphone with a portable VR device to generate the VR experience.The most commonly used framework for building VR websites today is WebVR, which is an industry-standard application programming interface based on JavaScript, providing support for virtual reality devices in a web browser. WebVR mainly uses React 360, Three.js and A-Frame as key technologies providing access to the best VR experiences.Developers at Mozilla, Chrome are making efforts to provide support for WebVR. Currently, it works in Nightly builds of Firefox and experimental builds of Chrome. As soon as regular builds are released to the public, users will be able to access AR/VR content with no added steps required. Simultaneously, tech giants like Facebook, Microsoft, and others maintain investments in the development of VR technologies.The Future of AR/VR for web developmentAt present, both AR and VR are still challenging for web developers. Obviously, to take more advantage of AR/VR, in the short term, developers will need to have a better understanding of their user audience demands by making use of big data and analytics. However, ultimately, these two technologies are believed to revolutionize the web development industry. The demand for high-quality content will increase: users will need on-the-go high-end tools that can visualize possible purchase scenarios.As AR/VR will get more advanced over the next few years, they will provide fully personalized, improved and more accessible user experiences. This will give marketers more real-time data based on user preference to dynamically customize marketing and advertising instruments and techniques including messaging, timing and placement.Finally, there will be time and enough space for the new kind of devices to step in: probably, AR glasses may come as a reasonable alternative to the smartphone cameras. One can remember Google stop selling its Google Glass in 2015 after reports of privacy concerns, however, this particular form of AR can come back since the phenomenon is slowly beginning to assert itself as an invaluable asset to web designers.ShareComments\n"
        },
        {
            "from": "https://www.jmir.org/2021/2/e25499/",
            "ref": [
                "Edited by  G Eysenbach; submitted 05.11.20; peer-reviewed by MS Uddin; comments to author 26.11.20; revised version received 08.12.20; accepted 16.01.21; published 10.02.21",
                "©Andy Wai Kan Yeung, Anela Tosevska, Elisabeth Klager, Fabian Eibensteiner, Daniel Laxar, Jivko Stoyanov, Marija Glisic, Sebastian Zeiner, Stefan Tino Kulnik, Rik Crutzen, Oliver Kimberger, Maria Kletecka-Pulker, Atanas G Atanasov, Harald Willschke. Originally published in the Journal of Medical Internet Research (http://www.jmir.org), 10.02.2021.",
                "This is an open-access article distributed under the terms of the Creative Commons Attribution License (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work, first published in the Journal of Medical Internet Research, is properly cited. The complete bibliographic information, a link to the original publication on http://www.jmir.org/, as well as this copyright and license information must be included.",
                "\n                        Please cite as:\n                    ",
                "\n                            Yeung AWK,\n                            Tosevska A,\n                            Klager E,\n                            Eibensteiner F,\n                            Laxar D,\n                            Stoyanov J,\n                            Glisic M,\n                            Zeiner S,\n                            Kulnik ST,\n                            Crutzen R,\n                            Kimberger O,\n                            Kletecka-Pulker M,\n                            Atanasov AG,\n                            Willschke H  Virtual and Augmented Reality Applications in Medicine: Analysis of the Scientific Literature  J Med Internet Res 2021;23(2):e25499  doi:\n                            \n                                    10.2196/25499\n                                 \n                            PMID:\n                            33565986 \n                            PMCID:\n                            7904394",
                "\n                                Copyright ©\n                                \n                                    2022\n                                \n                                JMIR Publications\n                            "
            ],
            "text": "Original PaperAndy Wai Kan Yeung1,2, PhD ; Anela Tosevska2,3, PhD ; Elisabeth Klager2, MSc ; Fabian Eibensteiner2,4, MD ; Daniel Laxar2 ; Jivko Stoyanov5, PhD ; Marija Glisic5,6, PhD ; Sebastian Zeiner7, MD ; Stefan Tino Kulnik8, PhD ; Rik Crutzen8,9, PhD ; Oliver Kimberger2,7, MD, PD, PhD ; Maria Kletecka-Pulker2,10, PhD ; Atanas G Atanasov2,11,12,13, PD, PhD ; Harald Willschke2,7, MD, PhD 1Oral and Maxillofacial Radiology, Applied Oral Sciences and Community Dental Care, Faculty of Dentistry, The University of Hong Kong, Hong Kong, China2Ludwig Boltzmann Institute for Digital Health and Patient Safety, Medical University of Vienna, Vienna, Austria3Department of Molecular, Cell and Developmental Biology, University of California Los Angeles, Los Angeles, CA, United States4Division of Pediatric Nephrology and Gastroenterology, Department of Pediatrics and Adolescent Medicine, Comprehensive Center for Pediatrics, Medical University of Vienna, Vienna, Austria5Swiss Paraplegic Research, Nottwil, Switzerland6Institute of Social and Preventive Medicine, University of Bern, Bern, Switzerland7Department of Anaesthesia, Intensive Care Medicine and Pain Medicine, Medical University Vienna, Vienna, Austria8Ludwig Boltzmann Institute for Digital Health and Prevention, Salzburg, Austria9Department of Health Promotion, Care and Public Health Research Institute (CAPHRI), Maastricht University, Maastricht, Netherlands10Institute for Ethics and Law in Medicine, University of Vienna, Vienna, Austria11Institute of Genetics and Animal Biotechnology of the Polish Academy of Sciences, Jastrzebiec, Poland12Institute of Neurobiology, Bulgarian Academy of Sciences, Sofia, Bulgaria13Department of Pharmacognosy, University of Vienna, Vienna, AustriaCorresponding Author:Atanas G Atanasov, PD, PhDLudwig Boltzmann Institute for Digital Health and Patient SafetyMedical University of ViennaSpitalgasse 23Vienna, AustriaPhone: 43 664 1929 852Email: atanas.atanasov@univie.ac.atAbstractBackground: Virtual reality (VR) and augmented reality (AR) have recently become popular research themes. However, there are no published bibliometric reports that have analyzed the corresponding scientific literature in relation to the application of these technologies in medicine.Objective: We used a bibliometric approach to identify and analyze the scientific literature on VR and AR research in medicine, revealing the popular research topics, key authors, scientific institutions, countries, and journals. We further aimed to capture and describe the themes and medical conditions most commonly investigated by VR and AR research.Methods: The Web of Science electronic database was searched to identify relevant papers on VR research in medicine. Basic publication and citation data were acquired using the “Analyze” and “Create Citation Report” functions of the database. Complete bibliographic data were exported to VOSviewer and Bibliometrix, dedicated bibliometric software packages, for further analyses. Visualization maps were generated to illustrate the recurring keywords and words mentioned in the titles and abstracts.Results: The analysis was based on data from 8399 papers. Major research themes were diagnostic and surgical procedures, as well as rehabilitation. Commonly studied medical conditions were pain, stroke, anxiety, depression, fear, cancer, and neurodegenerative disorders. Overall, contributions to the literature were globally distributed with heaviest contributions from the United States and United Kingdom. Studies from more clinically related research areas such as surgery, psychology, neurosciences, and rehabilitation had higher average numbers of citations than studies from computer sciences and engineering.Conclusions: The conducted bibliometric analysis unequivocally reveals the versatile emerging applications of VR and AR in medicine. With the further maturation of the technology and improved accessibility in countries where VR and AR research is strong, we expect it to have a marked impact on clinical practice and in the life of patients.J Med Internet Res 2021;23(2):e25499doi:10.2196/25499Keywordsvirtual reality; augmented reality; mixed reality; bibliometric; surgical procedures; rehabilitation; neurodegenerative disorder; pain; stroke; medicine IntroductionVirtual reality (VR) is a technology that immerses the user in a synthetic 3-dimensional (3D) environment via wearable screens in the form of VR headsets, while closely related augmented reality (AR) uses elements of VR and superimposes them on to the real-world environment in the form of a live video displayed on the screen of an electronic device [1]. VR is a concept that has been developing over the last 50 years, whereas AR is a relatively new concept. Both are aimed at providing an experience for the users that engages their visual and auditory senses by creating an illusion of the surroundings [2,3]. In recent years, and with the advancement of technology, both VR and AR systems have become more portable, more realistic, and better to navigate in real time, adding a sensory and sometimes olfactory element to the range of sensations [3]. Furthermore, head-mounted devices are becoming more accessible. Personalized VR and AR devices have already been on the market for several years and are constantly improving and developing. The user can interact with the virtual environment through hand-held devices such as joysticks or keyboards and more recently, using integrated body tracking technologies [2,3]. VR and AR can be very versatile, using different systems and setups as well as different content that can range from very immersive, dynamic, and interactive to nonimmersive and static. Immersion, presence, and interaction are 3 essential characteristics of VR and AR [2,4]. Immersion is dependent on the technology used; it can be a head-mounted device, concave or 3D projection, or video where the user is the protagonist. Presence and interaction are related to the individual perception of being connected to the environment and the ability to act within the environment and receive feedback and reaction.VR and AR are digital technologies that allow automation and can be used in fields where repetitive tasks need to be performed and often perfected [2]. A common example for the use of VR and AR in the medical field is medical education and training, especially in surgery [5-7]. For example, using VR or AR in surgical procedure training allows the trainee to perform steps on a virtual patient or having patient information superimposed with reality [1,5,7]. There is some evidence that VR could be a useful tool in improving surgical skills and reducing surgical procedure errors [8]. Neurosurgery, representing a traditionally complex surgical area, has been positively affected by the development of virtual techniques [9]. In acute pain management, VR has been used as a distraction technique [10,11], and there are studies proposing a role of VR in chronic pain management by inducing neurophysiological changes beyond simple distraction [10,12,13]. Further interesting prospects are using VR technology for the treatment of “phantom limb pain” following amputation [14] or after spinal cord injury [15]. VR has been used in rehabilitation for improvement of upper limb function following stroke [4], with modest or no improvement over conventional physiotherapy. Some benefits could be exhibited, on the other hand, in improving the cognitive abilities of patients with stroke, in particular speech, attention, and memory [16]. VR can also benefit patients with mental health conditions such as anxiety, depression, substance abuse, or eating disorders [17] and has been used as a therapy in a number of phobias and posttraumatic stress disorder [18].The benefits of using VR or AR over conventional therapy could be plentiful: It might allow for multiple repetitions of simple tasks in clinical practice in an immersive environment without the need for constant supervision by medical staff, which could considerably reduce the costs for training facilities and trained medical staff. Furthermore, and especially for immobile patients, head-mounted devices could be safely used in patients’ homes, which could decrease the need for hospital visits. VR and AR experiences can be designed to be attractive and user-friendly, decreasing the attrition rate of patients and providing a more pleasurable environment. From a research perspective, the use of VR can facilitate data collection for monitoring of progress [19]. Using VR in surgical training could vastly reduce the possibility for surgical errors, leading to great improvement in patient safety [8].While the number of studies on the use of virtual technologies in health care is growing, these studies tend to be small and heterogeneous and often lack proper controls [4]. Results from such studies are often inconclusive, and the benefits of virtual over conventional approaches in health care are difficult to determine. The mechanisms by which VR treatment provides pain relief, for example, are still debated [12]. Moreover, a long-term benefit of VR treatment, especially in chronic pain management, has yet to be established. In a clinical setting, establishing VR systems is still technically challenging and cost-prohibitive, and such technology often has lower levels of acceptance in the elderly population [2]. A comprehensive guideline for standardization of the use of these technologies in medicine is still lacking and warrants further consideration.Bibliometrics is an analytical approach that generates an integrative view and quantitative parameter profiling of entire research fields or specific scientific application areas [20-22]. Previous work has focused on specific areas of VR application such as dementia and rehabilitation medicine [23,24]. For instance, highly cited papers describing VR application for autism spectrum disorder (ASD) focused their research mainly on the improvement of social skills [23], whereas research in the context of dementia mainly focused on the application of VR as an assessment tool for spatial navigation, memory profile, memory deficit, and memory formation in patients with mild cognitive impairment [24]. As VR is becoming a more prevalent topic in health care and medicine, we aimed to conduct a bibliometric analysis of the current literature, to discover trends and topics explored in VR applications in medicine and quantitatively evaluate the available literature. To the best of our knowledge, this is the first total-scale bibliometric analysis examining overall VR and AR applications in medicine in the scientific literature.MethodsData Source and Search StrategyThe Web of Science (WoS) Core Collection database was searched on September 16, 2020 and queried with the following search string: TOPIC: (“virtual reality*” OR “augmented reality*” OR “mixed reality*” OR “computer-mediated reality*”) AND TOPIC: (medic* OR illness* OR disease* OR health* OR pharma*). The search identified publications mentioning these words and their derivatives in the title, abstract, or keywords. No additional restrictions, such as publication type or language, were used. The “Analyze” and “Create Citation Report” functions of WoS were utilized for basic publication and citation counting. The full records of the resultant publications were exported to VOSviewer (version 1.6.15) and Bibliometrix (Version 3.0 operated under the web interface called Biblioshiny) for further bibliometric analyses.VOSviewer was used to produce a term map showing phrases from titles and abstracts of the publications. For clarity, phrases occurring in at least 0.5% (42/8399) of the publications were included. Multiple appearances in a single publication counted as one. In the obtained map, the circle size represents the frequency of occurrence, whereas the color represents the citations per publication. The distance between 2 circles represents how 2 phrases co-occurred with each other in the publications. Meanwhile, a density map was produced to show author´s keywords in the publications. For clarity, keywords occurring in at least 0.1% (9/8399) of the publications were included. A keyword or cluster of keywords with higher frequency counts formed a red region, and those with lower frequency counts formed a yellow region.Utilizing the software Biblioshiny, the Trend Topics function was used to reveal trends in abstract words. Words were included if they occurred in at least 5 publications. Each year was limited to 5 words.Statistical AnalysisTo analyze citation per publication (CPP) differences between original articles and reviews as well as between core and noncore journals, a 2-sample t test was conducted. In order to assess differences in CPP between different research areas (as designated by WoS), a one-way analysis of variance was utilized. Statistical tests were performed with SPSS (version 26.0; IBM Corp, Armonk, NY). Results were deemed significant if P<.05.ResultsOverall Literature LandscapeThe literature search identified 8399 publications published from 1992 until 2020. The annual publication count reached 100 since 2005 and exceeded 1000 since 2018 (Figure 1). The year 2020 had 802 published papers until the date of the literature search (9/16/2020). There were 5297 original articles (5297/8399, 63.07%; CPP=17.4) and 902 reviews (902/8399, 10.74%; CPP=31.1). Therefore, the article-to-review ratio was 5.9:1, with reviews having a significantly higher CPP than original articles (P<.001). Other major document types were proceedings papers (1908/8399, 22.72%; CPP=2.0; WoS tagged 2213, of which 305 were simultaneously tagged as original articles), editorial materials (135/8399, 1.61%; CPP=13.7), and meeting abstracts (130/8399, 1.55%; CPP=0.2). The analyzed papers were mainly published in English (8131/8399, 96.81%).‎Figure 1. Annual publication and citation count of virtual reality research in medicine. View this figureMost Productive EntitiesThe 10 most productive authors by number of publications are listed in Table 1. The most productive author was Professor Giuseppe Riva from General Psychology and Communication Psychology, Catholic University of Milan, Italy. He also had the highest H-index among the 10 most productive authors. Meanwhile, the author with the highest CPP was Professor Albert “Skip” Rizzo from Medical Virtual Reality, Institute for Creative Technologies, University of Southern California. From the M-index, it was noted that among these authors, the most impactful newcomer to the field was Dr Silvia Serino from MySpace Lab, Department of Clinical Neurosciences, University Hospital Lausanne, Switzerland.The 10 most productive organizations are listed in Table 2; 5 of these were in the United States, 2 each in the United Kingdom and Italy, and 1 in Canada. The University of London was the most productive organization, and the University of Toronto had the highest CPP, whereas the earliest research in this field was published at Harvard University.Table 1. The 10 most productive authors of virtual reality research in medicine (8399 articles).AuthorNumber of publications, n (%)Citations per publication (CPP)H-indexaM-index (first year)a,bGiuseppe Riva114 (1.36)18.5271.29 (2000)Brenda K. Wiederhold63 (0.75)15.0150.71 (2000)Nassir Navab60 (0.71)12.6160.76 (2000)Albert “Skip” Rizzo50 (0.60)32.1200.95 (2000)Cristina Botella37 (0.44)17.0160.80 (2001)Mariano Alcaniz36 (0.44)22.7150.75 (2001)Pietro Cipresso34 (0.40)12.2111.10 (2011)Andrea Gaggioli34 (0.40)17.2100.50 (2001)Silvia Serino33 (0.39)14.6131.63 (2013)Lars Konge32 (0.38)13.8121.20 (2011)aCalculated from the dataset.bCalculated by dividing the H-index by the number of years since the first published paper (within the dataset) of the author.Table 2. The 10 most productive organizations of virtual reality research in medicine (8399 articles).OrganizationPublications, n (%)Citations per publication (CPP)H-indexaM-index (first year)a,bUniversity of London175 (2.08)27.5371.61 (1998)University of California System164 (1.95)22.4341.42 (1997)Harvard University140 (1.67)24.6301.03 (1992)University of Toronto132 (1.57)42.5341.55 (1999)Imperial College London124 (1.48)27.8351.30 (1994)Istituto Auxologico Italiano116 (1.38)18.1271.29 (2000)University of Southern California113 (1.35)29.1291.07 (1994)Catholic University of the Sacred Heart112 (1.33)17.5251.19 (2000)State University System of Florida107 (1.27)25.2220.88 (1996)Pennsylvania Commonwealth System of Higher Education103 (1.23)19.6251.09 (1998)aCalculated from the dataset.bCalculated by dividing the H-index by the number of years since the first published paper (within the dataset) of the author.The 10 most productive countries are listed in Table 3. The United States had contributions to nearly 30% of the VR publications in medicine and had the highest CPP. The international collaboration rates of these countries were mostly around 20%-30%, with the United States having a lower rate at 12.3%.The 10 most productive journals are listed in Table 4. Computer science, surgery, and psychology were the 3 major research areas of these productive journals. Among the list, computer science journals seemed to have much lower CPP compared to others. According to Bradford’s law, core journals are defined as the most productive journals that collectively account for publishing one-third of all concerned articles [25]. By this definition, there were 85 core and 3565 noncore journals in this dataset. The CPP of core (14.8) and noncore (15.0) journals did not significantly differ (P=.845).Table 3. The 10 most productive countries of virtual reality research in medicine (8399 articles).CountryPublications, n (%)Citations per publication (CPP)SCPaMCPb (% of MCP:MCP+SCP)cUnited States2457 (29.25)23.01807253 (12.3)United Kingdom707 (8.42)21.9415137 (24.8)Germany663 (7.89)12.0396104 (20.8)Canada609 (7.25)20.7341125 (26.8)Italy559 (6.66)12.5311128 (29.2)China466 (5.55)6.7411117 (22.2)Spain436 (5.19)11.727455 (16.7)Australia429 (5.11)19.122883 (26.7)France355 (4.23)12.520650 (19.5)Netherlands324 (3.86)19.416457 (25.8)aSCP: single-country publication.bMCP: multiple-country publication.cSCP and MCP were computed by Bibliometrix based on data from the corresponding author’s country only. Hence, their summation did not equal the total number of publications of that country.Table 4. The 10 most productive journals of virtual reality research in medicine (8399 articles).JournalPublications, n (%)Citations per publication (CPP)2019 Impact FactorResearch area (domain)aLecture Notes in Computer Science207 (2.46)3.20.402Computer scienceCyberpsychology, Behavior, and Social Networking119 (1.42)29.32.258PsychologyProceedings of SPIEb97 (1.15)1.6N/AcComputer science, opticsSurgical Endoscopy and Other Interventional Techniques96 (1.14)33.73.149SurgeryAnnual Review of Cybertherapy and Telemedicine92 (1.10)1.7N/AComputer sciencePLOS One81 (0.96)12.42.740Science and technologyJournal of Neuroengineering and Rehabilitation73 (0.87)27.03.519Engineering, neurosciences and neurology, rehabilitationStudies in Health Technology and Informatics73 (0.87)5.8N/AHealth care sciences and services, medical informaticsJournal of Surgical Education69 (0.82)14.72.220Education and educational research,surgeryFrontiers in Psychology48 (0.57)7.72.067PsychologyaResearch area as assigned by Web of Science.bSPIE: Society of Photo-Optical Instrumentation Engineers.cN/A: not available.When the research area (of journals) was examined, the top 6 areas in descending order of publication count were computer science (CS), engineering (En), neurosciences and neurology (Neuro), surgery (Surg), psychology (Psy), and rehabilitation (Rehab). The CPPs of these 6 groups were significantly (P<.001) different from each other. Post-hoc tests revealed that the CPPs of Surg (25.1, SD 40.0), Psy (19.0, SD 35.6), and Neuro (20.3, SD 44.1) were greater than those of En (8.5, SD 26.8) and CS (9.5, SD 76.0); Surg was greater than that of Rehab (12.3, SD 24.5); and Others (15.6, SD 57.5) was greater than those of CS and En. Since some journals can be assigned to multiple research areas, a mutual exclusion procedure was performed in reverse hierarchical order (ie, the Rehab group retained all relevant papers first, then the Psy group retained all relevant papers excluding those coassigned to the Rehab group, then the Surg group retained all relevant papers excluding those coassigned to the Rehab and Psy groups, and so on). Finally, the Others group consisted of papers not assigned to the other 6 groups. In summary, papers dealing with clinical topics of surgery, neurosciences, psychology, and rehabilitation generally had more citations than those dealing with topics of computer science and engineering. This is consistent to a previous study in which neurosciences and surgery were among the top scientific categories with high citations [26].Popular Research ThemesVOSviewer was used to generate a term map that tagged the phrases mentioned in the titles and abstracts of the publications with their CPPs (Figure 2). Phrases located in the upper part of the figure generally had higher CPPs. They were mainly related to surgery, such as laparoscopic skill (95/8399, CPP=29.9), surgical skill (190/8399, CPP=35.9), surgical training (195/8399, CPP=29.1), and surgical simulation (103/8399, CPP=26.5). Bibliometrix was used to illustrate the temporal changes in the abstract words (Figure 3). The most common words in the 2000s were related to diagnostic procedures such as angiographic, echocardiographic, ureteroscopy, and colonoscopy. In the 2010s, the most common words were related to brain diseases and mental health disorders, such as schizophrenia, AD (Alzheimer’s disease), and ASD. Table 5 lists the medical conditions mentioned in at least 0.5% (42/8399) of the titles and abstracts of publications of VR research in medicine. This list was enriched with neuropsychological (eg, anxiety, depression), neurophysiological (eg, pain), and neuropathological (eg, Parkinson, Alzheimer) conditions and diseases.‎Figure 2. Term map showing phrases from publication titles and abstracts in virtual reality research in medicine. Phrases occurring in at least 0.5% (42/8399) of the publications were included. Multiple appearances in a single publication counted as one. Circle size represents the frequency of occurrence, color represents the citation per publication, and distance between 2 circles represent how 2 phrases co-occurred in the publications. View this figure‎Figure 3. Trends in the abstract words, as determined using the Trend Topics function of Bibliometrix. View this figureTable 5. Medical conditions mentioned in at least 0.5% (42/8399) of the publications of virtual reality research in medicine.Medical conditionnCitations per publication (CPP)Pain36418.0Stroke31918.3Anxiety31621.2Parkinson25817.6Depression14818.3Fear14324.7Cancer11713.5Alzheimer11315.1Dementia11314.9PTSDa9416.8Mild cognitive impairment9019.7Cerebral palsy7325.8Traumatic brain injury6725.0Multiple sclerosis5413.2Psychosis4720.7Obesity4611.5aPTSD: posttraumatic stress disorder.Author keywords also revealed that rehabilitation and simulation were the 2 major foci. As seen in Figure 4, the former was centered by words related to aging and neurodegenerative problems, such as Parkinson’s disease (PD), stroke, dementia, gait, and cognition. The latter was centered by words related to surgery and education, such as surgical training, image-guided surgery, virtual patient, and robotic surgery. There were also other words related to emotion and perception, such as anxiety, stress, and pain, which occupied subclusters with lower frequency densities. The 10 author keywords with the highest frequencies and CPPs are listed in Table 6.The highest frequency keyword was simulation. Table 7 lists the 10 most cited papers that mentioned “simulation” in their keywords. Besides laparoscopic skills, the use of simulation in general medical education was also covered in terms of implementation issues, availability of products on the market, and recommendations.‎Figure 4. Density map showing author keywords of the publications in virtual reality research in medicine. Keywords occurring in at least 0.1% (9/8399) of the publications were included. The keywords “virtual reality,” “augmented reality,” and “mixed reality” are not shown as they were the major search terms. A keyword or cluster of keywords with higher frequency counts forms a red region, and those with lower frequency counts form a yellow region. View this figureTable 6. The 10 author keywords with highest frequencies and citations per publication (CPPs; 8399 articles).KeywordsPublications, nCPPHighest frequencySimulation39919.3Rehabilitation35713.9Education26315.9Training25921.0Stroke21111.8Medical education20916.1Laparoscopy14522.5Parkinson’s disease12617.1Technology1099.5Surgery10418.3Highest CPPOptical flow9104.8Hemiparesis983.1Patient simulation1378.0Laparoscopic skills974.4Research1060.4Education, medical956.6Hemiplegia1054.8Laparoscopic954.8Motor control2146.3Fear945.2Table 7. The 10 most cited papers with simulation as their keyword.AuthorsTitleJournalYearCitations, nVassiliou MC, Feldman LS, Andrew CG, Bergman S, Leffondré K, Stanbridge D, Fried GM [27]A global assessment tool for evaluation of intraoperative laparoscopic skillsAmerican Journal of Surgery2005431Ahlberg G, Enochsson L, Gallagher AG, Hedman L, Hogman C, McClusky III DA, Ramel S, Smith CD, Arvidsson D [28]Proficiency-based virtual reality training significantly reduces the error rate for residents during their first 10 laparoscopic cholecystectomiesAmerican Journal of Surgery2007367Kneebone R [29]Simulation in surgical training: educational issues and practical implicationsMedical Education2003290Kneebone RL, Scott W, Darzi A, Horrocks M [30]Simulation and clinical practice: strengthening the relationship.Medical Education2004215Coles TR, Meglan D, John NW [31] The role of haptics in medical training simulators: a survey of the state of the artIEEE Transactions on Haptics2010203Rosen KR [32]The history of medical simulationJournal of Critical Care2008188Basdogan C, Ho CH, Srinivasan MA [33]Virtual environments for medical training: graphical and haptic simulation of laparoscopic common bile duct explorationIEEE/Asme Transactions on Mechatronics2001173Hassfeld S, Mühling J [34]Computer assisted oral and maxillofacial surgery–a review and an assessment of technologyInternational Journal of Oral and Maxillofacial Surgery2001164Vozenilek J, Huff JS, Reznek M, Gordon JA [35]See one, do one, teach one: advanced technology in medical educationAcademic Emergency Medicine2004157Zendejas B, Brydges R, Hamstra SJ, Cook DA [36]State of the evidence on simulation-based training for laparoscopic surgery: a systematic reviewAnnals of Surgery2013154The use of AR can be facilitated by many related technologies, for example, wearable tactile sensors [37] and skin-like electronics [38]. In surgery, AR can enhance the surgeon’s vision by offering a virtual transparency of the patient [39]. When learning anatomy, AR can create an illusion that allows the display of internal anatomical structures on the body of the user [40]. These cases illustrate the versatility of AR.DiscussionPrincipal FindingsThis bibliometric analysis of 8399 publications on VR research in medicine revealed that the field began to develop in the 1990s, grew in the 2000s, and has been thriving in the 2010s in terms of both publications and citation counts. Original articles accounted for 63.1% of the literature. The article-to-review ratio was 5.9:1.The literature had global contributions not only from North America and Europe but also from Asia and Oceania, implying that the application of VR in medicine has attracted worldwide attention. Diagnostic and surgical procedures as well as rehabilitation in neurodegenerative and mental health disorders were major research themes.The use of VR simulators helped in diagnostic and surgical procedures, such as improving novice hospital residents’ laparoscopic skills in terms of error and procedure time reduction [28]. It was also used to assess the suturing skills of different groups of operators [41]. In surgery, it was suggested that VR and simulation could be of value for 4 aspects, namely training and education, surgical planning, image guidance, and telesurgery [42].Geriatrics has been exploring the use of VR tasks to assess and train episodic memory in the elderly population, by simulating various environments representative of daily life that cannot be physically replicated in the clinic or rehabilitation centers [43]. The use of VR might also help rehabilitation clinicians conduct telerehabilitation on a remote basis so that the patient (eg, after stroke) carries out exercises at home in a virtual environment and data are then transmitted to the clinician [44]. Moreover, VR could incorporate gamified elements so that the process could be more rewarding (eg, for encouraging patients with PD to do more remotely supervised aerobic exercise) [45]. Nonimmersive VR has also been used to add cognitive challenges and virtual obstacles to treadmill training for older adults, targeting attention, perception, and dual tasking during walking with the aim to reduce fall risk [46]. Since the existing studies were quite diverse, more studies should be conducted to optimize the implementation and evaluate the beneficiary effects in different population groups, so that a recommendation can be made for how to use VR in cognitive rehabilitation [47].Meanwhile, the use of immersive VR was beneficial in managing a spectrum of emotional problems, such as the fear of heights [48], anxiety disorders [17], depression [49], and ASD [50]. Immersive VR could also reduce pain in patients, such as those with severe burn injuries during wound care [51] and pediatric patients during invasive medical procedures [52,53]. Two functions of VR for this category are distraction [54] and creation of presence [55,56]. Whereas the former distracts the subject from the real-world situation, such as pain-inducing medical procedures, the latter enables the subject to “experience” designed scenarios to facilitate management strategies such as cognitive reappraisal or cognitive behavioral therapy.To the authors’ knowledge, no previous bibliometric analysis on VR research in the medicine literature overall has been published. A bibliometric analysis of VR research in general (including nonmedical areas) by Cipresso et al [2] similarly revealed the dominance by the United States, United Kingdom, Germany, and China in this research field [2]. Five authors in the top 10 list of this study were also in the top 10 list of Cipresso et al [2], namely Giuseppe Riva, Brenda K. Wiederhold, Albert “Skip” Rizzo, Cristina Botella, and Mariano Alcaniz. This implies that medicine might be among the most important scientific areas for applications of VR in general. The general VR research literature covered broader aspects apart from the research areas reported here and had large shares from mathematical and computational biology, radiology, and social sciences [2]. For VR research in ASD, the United States accounted for 51.2% of all publications, followed by the United Kingdom (16.5%), India, Spain, and China (3%-5% each) [57]. VR research in rehabilitation was similarly led by the United States (29.8%) and the United Kingdom (9.0%), followed by Italy (7.7%), Canada (7.4%), and Germany (5.1%) [58]. Meanwhile, the United Kingdom was most productive in VR research in dementia (43.2%), followed by the United States (39.5%), France (33.5%), Switzerland (28.6%), Germany, Greece, and Italy (23.2% each) [24].A bibliometric analysis of artificial intelligence research in health and medicine similarly found that the United States was the top contributing country (30.8% versus 29.3% in this VR report) [59]. While China and Italy were the second and third most productive countries in artificial intelligence research in medicine, the United Kingdom did not enter the top 20 list. Here, for VR research in medicine, China and Italy were sixth and fifth on the list, whereas the United Kingdom ranked second. Both fields seemed to have different diseases of interest, but both shared stroke, cancer, AD, and PD [59].LimitationsThe current work searched one literature database only, implying that some papers could inevitably have been missed. However, as different databases record citation counts differently, it would be impossible to merge data from multiple databases. Moreover, publication and citation counts might not directly reflect the scientific quality of the papers, which might be influenced by various parameters including the sample size, study design, and standard of reporting. These would be best addressed by a systematic review with a focused scope, whereas the current work used bibliometric approach reports on the overall landscape of the literature in the research field.ConclusionsLiterature in the field of VR research in medicine represented over 8000 publications. The analyzed literature had global contributions with the heaviest contributions from the United States and United Kingdom. More clinically related research areas such as surgery, psychology, neurosciences, and rehabilitation had higher average numbers of citations than computer science and engineering. Diagnostic and surgical procedures and rehabilitation were major research themes. Medical conditions commonly investigated were pain, stroke, anxiety, depression, fear, cancer, and neurodegenerative disorders. The high potential and diversity of applications of VR and AR in medicine are already highly visible, and further improvements in these technologies are expected to both enhance their functionality and make them more accessible to patients, which will finally translate to significant therapeutic or preventive impact.Conflicts of InterestNone declared."
        }
    ]
}